stevew817/DAPLink/source/common/cmsis-core/siliconlabs/efm32hg/efm32hgfull.h
  uint32_t         RESERVED5[5];      /**< Reserved for future use **/
  __IO uint32_t    DIEPEMPMSK;        /**< Device IN Endpoint FIFO Empty Interrupt Mask Register  */

  uint32_t         RESERVED6[50];     /**< Reserved for future use **/
  __IO uint32_t    DIEP0CTL;          /**< Device IN Endpoint 0 Control Register  */
  uint32_t         RESERVED7[1];      /**< Reserved for future use **/
  __IO uint32_t    DIEP0INT;          /**< Device IN Endpoint 0 Interrupt Register  */
  uint32_t         RESERVED8[1];      /**< Reserved for future use **/
  __IO uint32_t    DIEP0TSIZ;         /**< Device IN Endpoint 0 Transfer Size Register  */
  __IO uint32_t    DIEP0DMAADDR;      /**< Device IN Endpoint 0 DMA Address Register  */
  __I uint32_t     DIEP0TXFSTS;       /**< Device IN Endpoint 0 Transmit FIFO Status Register  */

  uint32_t         RESERVED9[1];      /**< Reserved registers */
  USB_DIEP_TypeDef DIEP[3];           /**< Device IN Endpoint x+1 Registers */

  uint32_t         RESERVED10[96];    /**< Reserved for future use **/
  __IO uint32_t    DOEP0CTL;          /**< Device OUT Endpoint 0 Control Register  */
  uint32_t         RESERVED11[1];     /**< Reserved for future use **/
  __IO uint32_t    DOEP0INT;          /**< Device OUT Endpoint 0 Interrupt Register  */
  uint32_t         RESERVED12[1];     /**< Reserved for future use **/
  __IO uint32_t    DOEP0TSIZ;         /**< Device OUT Endpoint 0 Transfer Size Register  */
  __IO uint32_t    DOEP0DMAADDR;      /**< Device OUT Endpoint 0 DMA Address Register  */

  uint32_t         RESERVED13[2];     /**< Reserved registers */
  USB_DOEP_TypeDef DOEP[3];           /**< Device OUT Endpoint x+1 Registers */

  uint32_t         RESERVED14[160];   /**< Reserved for future use **/
  __IO uint32_t    PCGCCTL;           /**< Power and Clock Gating Control Register  */

  uint32_t         RESERVED15[127];   /**< Reserved registers */
  __IO uint32_t    FIFO0D[384];       /**< Device EP 0 FIFO  */

  uint32_t         RESERVED16[640];   /**< Reserved registers */
  __IO uint32_t    FIFO1D[384];       /**< Device EP 1 FIFO  */

  uint32_t         RESERVED17[640];   /**< Reserved registers */
  __IO uint32_t    FIFO2D[384];       /**< Device EP 2 FIFO  */

  uint32_t         RESERVED18[640];   /**< Reserved registers */
  __IO uint32_t    FIFO3D[384];       /**< Device EP 3 FIFO  */

  uint32_t         RESERVED19[28288]; /**< Reserved registers */
  __IO uint32_t    FIFORAM[512];      /**< Direct Access to Data FIFO RAM for Debugging (2 KB)  */
} USB_TypeDef;                        /** @} */

/**************************************************************************//**
 * @brief MSC_CACHE EFM32HGFULL MSC CACHE
 *****************************************************************************/
typedef struct
{
  __IO uint32_t DATA; /**< Cache Data  */
} MSC_CACHE_TypeDef;

/**************************************************************************//**
 * @defgroup EFM32HGFULL_MSC EFM32HGFULL MSC
 * @{
 * @brief EFM32HGFULL_MSC Register Declaration
 *****************************************************************************/
typedef struct
{
  __IO uint32_t     CTRL;           /**< Memory System Control Register  */
  __IO uint32_t     READCTRL;       /**< Read Control Register  */
  __IO uint32_t     WRITECTRL;      /**< Write Control Register  */
  __IO uint32_t     WRITECMD;       /**< Write Command Register  */
  __IO uint32_t     ADDRB;          /**< Page Erase/Write Address Buffer  */
  __I uint32_t      ADDR;           /**< Page Erase/Write Address Register  */
  __IO uint32_t     WDATA;          /**< Write Data Register  */
  __I uint32_t      STATUS;         /**< Status Register  */
  __IO uint32_t     MEMFEATURE;     /**< Memory Feature Config Register  */
  __IO uint32_t     CFGFEATURE;     /**< Configuration Pages Register  */
  __IO uint32_t     DEBUGLOCK;      /**< Debug Lock Register  */
  __I uint32_t      IF;             /**< Interrupt Flag Register  */
  __IO uint32_t     IFS;            /**< Interrupt Flag Set Register  */
  __IO uint32_t     IFC;            /**< Interrupt Flag Clear Register  */
  __IO uint32_t     IEN;            /**< Interrupt Enable Register  */
  __IO uint32_t     LOCK;           /**< Configuration Lock Register  */
  __IO uint32_t     CMD;            /**< Command Register  */
  __I uint32_t      CACHEHITS;      /**< Cache Hits Performance Counter  */
  __I uint32_t      CACHEMISSES;    /**< Cache Misses Performance Counter  */
  uint32_t          RESERVED0[1];   /**< Reserved for future use **/
  __IO uint32_t     TIMEBASE;       /**< Flash Write and Erase Timebase  */
  __IO uint32_t     MASSLOCK;       /**< Mass Erase Lock Register  */
  __IO uint32_t     IRQLATENCY;     /**< Irq Latency Register  */
  uint32_t          RESERVED1[1];   /**< Reserved for future use **/
  __IO uint32_t     TEST;           /**< Test register  */

  uint32_t          RESERVED2[103]; /**< Reserved registers */
  MSC_CACHE_TypeDef CACHE[128];     /**< Cache Memory */
} MSC_TypeDef;                      /** @} */

/**************************************************************************//**
 * @defgroup EFM32HGFULL_EMU EFM32HGFULL EMU
 * @{
 * @brief EFM32HGFULL_EMU Register Declaration
 *****************************************************************************/
typedef struct
{
  __IO uint32_t CTRL;         /**< Control Register  */

  uint32_t      RESERVED0[1]; /**< Reserved for future use **/
  __IO uint32_t LOCK;         /**< Configuration Lock Register  */
  __IO uint32_t BIASCONF;     /**< Configurations Related to the Bias  */
  __I uint32_t  BIASSTATUS;   /**< Status related to the BIAS  */
  __IO uint32_t TESTCTRL;     /**< Test Control Register  */
  __IO uint32_t ATESTCTRL;    /**< Analog Test Control Register  */
  __IO uint32_t ANACONF;      /**< Analog configuration bits  */
  __IO uint32_t DREGCONF;     /**< Configurations related to the DREG  */
  __IO uint32_t AUXCTRL;      /**< Auxiliary Control Register  */
  __IO uint32_t MEMFEATURE;   /**< Memory Feature Config Register  */
} EMU_TypeDef;                /** @} */

/**************************************************************************//**
 * @defgroup EFM32HGFULL_RMU EFM32HGFULL RMU
 * @{
 * @brief EFM32HGFULL_RMU Register Declaration
 *****************************************************************************/
typedef struct
{
  __IO uint32_t CTRL;         /**< Control Register  */
  __I uint32_t  RSTCAUSE;     /**< Reset Cause Register  */
  __O uint32_t  CMD;          /**< Command Register  */
  __IO uint32_t PORBODCONFIG; /**< Porbod Configuration Register  */
} RMU_TypeDef;                /** @} */

/**************************************************************************//**
 * @defgroup EFM32HGFULL_CMU EFM32HGFULL CMU
 * @{
 * @brief EFM32HGFULL_CMU Register Declaration
 *****************************************************************************/
typedef struct
{
  __IO uint32_t CTRL;             /**< CMU Control Register  */
  __IO uint32_t HFCORECLKDIV;     /**< High Frequency Core Clock Division Register  */
  __IO uint32_t HFPERCLKDIV;      /**< High Frequency Peripheral Clock Division Register  */
  __IO uint32_t HFRCOCTRL;        /**< HFRCO Control Register  */
  __IO uint32_t LFRCOCTRL;        /**< LFRCO Control Register  */
  __IO uint32_t AUXHFRCOCTRL;     /**< AUXHFRCO Control Register  */
  __IO uint32_t CALCTRL;          /**< Calibration Control Register  */
  __IO uint32_t CALCNT;           /**< Calibration Counter Register  */
  __IO uint32_t OSCENCMD;         /**< Oscillator Enable/Disable Command Register  */
  __IO uint32_t CMD;              /**< Command Register  */
  __IO uint32_t LFCLKSEL;         /**< Low Frequency Clock Select Register  */
  __I uint32_t  STATUS;           /**< Status Register  */
  __I uint32_t  IF;               /**< Interrupt Flag Register  */
  __IO uint32_t IFS;              /**< Interrupt Flag Set Register  */
  __IO uint32_t IFC;              /**< Interrupt Flag Clear Register  */
  __IO uint32_t IEN;              /**< Interrupt Enable Register  */
  __IO uint32_t HFCORECLKEN0;     /**< High Frequency Core Clock Enable Register 0  */
  __IO uint32_t HFPERCLKEN0;      /**< High Frequency Peripheral Clock Enable Register 0  */
  uint32_t      RESERVED0[2];     /**< Reserved for future use **/
  __I uint32_t  SYNCBUSY;         /**< Synchronization Busy Register  */
  __IO uint32_t FREEZE;           /**< Freeze Register  */
  __IO uint32_t LFACLKEN0;        /**< Low Frequency A Clock Enable Register 0  (Async Reg)  */
  uint32_t      RESERVED1[1];     /**< Reserved for future use **/
  __IO uint32_t LFBCLKEN0;        /**< Low Frequency B Clock Enable Register 0 (Async Reg)  */
  __IO uint32_t LFCCLKEN0;        /**< Low Frequency C Clock Enable Register 0 (Async Reg)  */
  __IO uint32_t LFAPRESC0;        /**< Low Frequency A Prescaler Register 0 (Async Reg)  */
  uint32_t      RESERVED2[1];     /**< Reserved for future use **/
  __IO uint32_t LFBPRESC0;        /**< Low Frequency B Prescaler Register 0  (Async Reg)  */
  uint32_t      RESERVED3[1];     /**< Reserved for future use **/
  __IO uint32_t PCNTCTRL;         /**< PCNT Control Register  */
  __IO uint32_t LCDCTRL;          /**< LCD Control Register  */
  __IO uint32_t ROUTE;            /**< I/O Routing Register  */
  __IO uint32_t LOCK;             /**< Configuration Lock Register  */
  __IO uint32_t HFCORECLKENMASK0; /**< High Frequency Core Clock Lock  */
  __IO uint32_t HFPERCLKENMASK0;  /**< High Frequency Peripheral Clock Lock  */
  uint32_t      RESERVED4[2];     /**< Reserved for future use **/
  __O uint32_t  LFACLKENMASK0;    /**< Low Frequency A Clock Lock  */
  uint32_t      RESERVED5[1];     /**< Reserved for future use **/
  __IO uint32_t LFBCLKENMASK0;    /**< Low Frequency B Clock Lock  */
  __O uint32_t  LFCCLKENMASK0;    /**< Low Frequency C Clock Lock  */
  __IO uint32_t PCNTCLKENMASK;    /**< PCNT Clock Lock  */
  __IO uint32_t TEST;             /**< Test Register  */
  __IO uint32_t RST;              /**< Reset Register  */
  uint32_t      RESERVED6[3];     /**< Reserved for future use **/
  __IO uint32_t LPOSCCTRL;        /**< Low Power Oscillator Control  */

  uint32_t      RESERVED7[3];     /**< Reserved for future use **/
  __IO uint32_t USBCRCTRL;        /**< USB Clock Recovery Control  */
  __IO uint32_t USHFRCOCTRL;      /**< USHFRCO Control  */
  __IO uint32_t USHFRCOTUNE;      /**< USHFRCO Frequency Tune  */
  __IO uint32_t USHFRCOCONF;      /**< USHFRCO Configuration  */
  __IO uint32_t USHFRCOCAL1;      /**< USB factory calibration  */
  __IO uint32_t USHFRCOCAL2;      /**< USHFRCO temperature compensation  */
  __IO uint32_t USHFRCOCALLOCK;   /**< USHFRCO Calibration Lock Register  */
} CMU_TypeDef;                    /** @} */

/**************************************************************************//**
 * @brief TIMER_CC EFM32HGFULL TIMER CC
 *****************************************************************************/
typedef struct
{
  __IO uint32_t CTRL; /**< CC Channel Control Register  */
  __IO uint32_t CCV;  /**< CC Channel Value Register  */
  __I uint32_t  CCVP; /**< CC Channel Value Peek Register  */
  __IO uint32_t CCVB; /**< CC Channel Buffer Register  */
} TIMER_CC_TypeDef;

/**************************************************************************//**
 * @defgroup EFM32HGFULL_TIMER EFM32HGFULL TIMER
 * @{
 * @brief EFM32HGFULL_TIMER Register Declaration
 *****************************************************************************/
typedef struct
{
  __IO uint32_t    CTRL;         /**< Control Register  */
  __IO uint32_t    CMD;          /**< Command Register  */
  __I uint32_t     STATUS;       /**< Status Register  */
  __IO uint32_t    IEN;          /**< Interrupt Enable Register  */
  __I uint32_t     IF;           /**< Interrupt Flag Register  */
  __IO uint32_t    IFS;          /**< Interrupt Flag Set Register  */
  __IO uint32_t    IFC;          /**< Interrupt Flag Clear Register  */
  __IO uint32_t    TOP;          /**< Counter Top Value Register  */
  __IO uint32_t    TOPB;         /**< Counter Top Value Buffer Register  */
  __IO uint32_t    CNT;          /**< Counter Value Register  */
  __IO uint32_t    ROUTE;        /**< I/O Routing Register  */

  uint32_t         RESERVED0[1]; /**< Reserved registers */
  TIMER_CC_TypeDef CC[3];        /**< Compare/Capture Channel */

  uint32_t         RESERVED1[4]; /**< Reserved for future use **/
  __IO uint32_t    DTCTRL;       /**< DTI Control Register  */
  __IO uint32_t    DTTIME;       /**< DTI Time Control Register  */
  __IO uint32_t    DTFC;         /**< DTI Fault Configuration Register  */
  __IO uint32_t    DTOGEN;       /**< DTI Output Generation Enable Register  */
  __I uint32_t     DTFAULT;      /**< DTI Fault Register  */
  __O uint32_t     DTFAULTC;     /**< DTI Fault Clear Register  */
  __IO uint32_t    DTLOCK;       /**< DTI Configuration Lock Register  */
} TIMER_TypeDef;                 /** @} */

/**************************************************************************//**
 * @defgroup EFM32HGFULL_ACMP EFM32HGFULL ACMP
 * @{
 * @brief EFM32HGFULL_ACMP Register Declaration
 *****************************************************************************/
typedef struct
{
  __IO uint32_t CTRL;     /**< Control Register  */
  __IO uint32_t INPUTSEL; /**< Input Selection Register  */
  __I uint32_t  STATUS;   /**< Status Register  */
  __IO uint32_t IEN;      /**< Interrupt Enable Register  */
  __I uint32_t  IF;       /**< Interrupt Flag Register  */
  __IO uint32_t IFS;      /**< Interrupt Flag Set Register  */
  __IO uint32_t IFC;      /**< Interrupt Flag Clear Register  */
  __IO uint32_t ROUTE;    /**< I/O Routing Register  */
  __IO uint32_t TEST;     /**< Test Register  */
} ACMP_TypeDef;           /** @} */

/**************************************************************************//**
 * @defgroup EFM32HGFULL_USART EFM32HGFULL USART
 * @{
 * @brief EFM32HGFULL_USART Register Declaration
 *****************************************************************************/
typedef struct
{
  __IO uint32_t CTRL;       /**< Control Register  */
  __IO uint32_t FRAME;      /**< USART Frame Format Register  */
  __IO uint32_t TRIGCTRL;   /**< USART Trigger Control register  */
  __IO uint32_t CMD;        /**< Command Register  */
  __I uint32_t  STATUS;     /**< USART Status Register  */
  __IO uint32_t CLKDIV;     /**< Clock Control Register  */
  __I uint32_t  RXDATAX;    /**< RX Buffer Data Extended Register  */
  __I uint32_t  RXDATA;     /**< RX Buffer Data Register  */
  __I uint32_t  RXDOUBLEX;  /**< RX Buffer Double Data Extended Register  */
  __I uint32_t  RXDOUBLE;   /**< RX FIFO Double Data Register  */
  __I uint32_t  RXDATAXP;   /**< RX Buffer Data Extended Peek Register  */
  __I uint32_t  RXDOUBLEXP; /**< RX Buffer Double Data Extended Peek Register  */
  __IO uint32_t TXDATAX;    /**< TX Buffer Data Extended Register  */
  __IO uint32_t TXDATA;     /**< TX Buffer Data Register  */
  __IO uint32_t TXDOUBLEX;  /**< TX Buffer Double Data Extended Register  */
  __IO uint32_t TXDOUBLE;   /**< TX Buffer Double Data Register  */
  __I uint32_t  IF;         /**< Interrupt Flag Register  */
  __IO uint32_t IFS;        /**< Interrupt Flag Set Register  */
  __IO uint32_t IFC;        /**< Interrupt Flag Clear Register  */
  __IO uint32_t IEN;        /**< Interrupt Enable Register  */
  __IO uint32_t IRCTRL;     /**< IrDA Control Register  */
  __IO uint32_t ROUTE;      /**< I/O Routing Register  */
  __IO uint32_t INPUT;      /**< USART Input Register  */
  __IO uint32_t I2SCTRL;    /**< I2S Control Register  */
} USART_TypeDef;            /** @} */

/**************************************************************************//**
 * @brief PRS_CH EFM32HGFULL PRS CH
 *****************************************************************************/
typedef struct
{
  __IO uint32_t CTRL; /**< Channel Control Register  */
} PRS_CH_TypeDef;

/**************************************************************************//**
 * @defgroup EFM32HGFULL_PRS EFM32HGFULL PRS
 * @{
 * @brief EFM32HGFULL_PRS Register Declaration
 *****************************************************************************/
typedef struct
{
  __IO uint32_t  SWPULSE;      /**< Software Pulse Register  */
  __IO uint32_t  SWLEVEL;      /**< Software Level Register  */
  __IO uint32_t  ROUTE;        /**< I/O Routing Register  */

