stevew817/DAPLink/source/common/cmsis-core/siliconlabs/efm32hg/efm32hgfull.h
/** @} End of group EFM32HGFULL_Peripheral_Base */

/**************************************************************************//**
 * @defgroup EFM32HGFULL_Peripheral_Declaration  EFM32HGFULL Peripheral Declarations
 * @{
 *****************************************************************************/

#define AES          ((AES_TypeDef *) AES_BASE)             /**< AES base pointer */
#define DMA          ((DMA_TypeDef *) DMA_BASE)             /**< DMA base pointer */
#define USB          ((USB_TypeDef *) USB_BASE)             /**< USB base pointer */
#define MSC          ((MSC_TypeDef *) MSC_BASE)             /**< MSC base pointer */
#define EMU          ((EMU_TypeDef *) EMU_BASE)             /**< EMU base pointer */
#define RMU          ((RMU_TypeDef *) RMU_BASE)             /**< RMU base pointer */
#define CMU          ((CMU_TypeDef *) CMU_BASE)             /**< CMU base pointer */
#define TIMER0       ((TIMER_TypeDef *) TIMER0_BASE)        /**< TIMER0 base pointer */
#define TIMER1       ((TIMER_TypeDef *) TIMER1_BASE)        /**< TIMER1 base pointer */
#define TIMER2       ((TIMER_TypeDef *) TIMER2_BASE)        /**< TIMER2 base pointer */
#define ACMP0        ((ACMP_TypeDef *) ACMP0_BASE)          /**< ACMP0 base pointer */
#define USART0       ((USART_TypeDef *) USART0_BASE)        /**< USART0 base pointer */
#define USART1       ((USART_TypeDef *) USART1_BASE)        /**< USART1 base pointer */
#define PRS          ((PRS_TypeDef *) PRS_BASE)             /**< PRS base pointer */
#define IDAC0        ((IDAC_TypeDef *) IDAC0_BASE)          /**< IDAC0 base pointer */
#define GPIO         ((GPIO_TypeDef *) GPIO_BASE)           /**< GPIO base pointer */
#define VCMP         ((VCMP_TypeDef *) VCMP_BASE)           /**< VCMP base pointer */
#define ADC0         ((ADC_TypeDef *) ADC0_BASE)            /**< ADC0 base pointer */
#define LEUART0      ((LEUART_TypeDef *) LEUART0_BASE)      /**< LEUART0 base pointer */
#define PCNT0        ((PCNT_TypeDef *) PCNT0_BASE)          /**< PCNT0 base pointer */
#define I2C0         ((I2C_TypeDef *) I2C0_BASE)            /**< I2C0 base pointer */
#define RTC          ((RTC_TypeDef *) RTC_BASE)             /**< RTC base pointer */
#define WDOG         ((WDOG_TypeDef *) WDOG_BASE)           /**< WDOG base pointer */
#define MTB          ((MTB_TypeDef *) MTB_BASE)             /**< MTB base pointer */
#define CALIBRATE    ((CALIBRATE_TypeDef *) CALIBRATE_BASE) /**< CALIBRATE base pointer */
#define DEVINFO      ((DEVINFO_TypeDef *) DEVINFO_BASE)     /**< DEVINFO base pointer */
#define ROMTABLE     ((ROMTABLE_TypeDef *) ROMTABLE_BASE)   /**< ROMTABLE base pointer */

/** @} End of group EFM32HGFULL_Peripheral_Declaration */

/**************************************************************************//**
 * @defgroup EFM32HGFULL_BitFields EFM32HGFULL Bit Fields
 * @{
 *****************************************************************************/

/**************************************************************************//**
 * @addtogroup EFM32HGFULL_PRS_Signals
 * @{
 * @brief PRS Signal names
 *****************************************************************************/
#define PRS_VCMP_OUT              ((1 << 16) + 0)  /**< PRS Voltage comparator output */
#define PRS_ACMP0_OUT             ((2 << 16) + 0)  /**< PRS Analog comparator output */
#define PRS_ADC0_SINGLE           ((8 << 16) + 0)  /**< PRS ADC single conversion done */
#define PRS_ADC0_SCAN             ((8 << 16) + 1)  /**< PRS ADC scan conversion done */
#define PRS_USART0_IRTX           ((16 << 16) + 0) /**< PRS USART 0 IRDA out */
#define PRS_USART0_TXC            ((16 << 16) + 1) /**< PRS USART 0 TX complete */
#define PRS_USART0_RXDATAV        ((16 << 16) + 2) /**< PRS USART 0 RX Data Valid */
#define PRS_USART1_IRTX           ((17 << 16) + 0) /**< PRS USART 1 IRDA out */
#define PRS_USART1_TXC            ((17 << 16) + 1) /**< PRS USART 1 TX complete */
#define PRS_USART1_RXDATAV        ((17 << 16) + 2) /**< PRS USART 1 RX Data Valid */
#define PRS_TIMER0_UF             ((28 << 16) + 0) /**< PRS Timer 0 Underflow */
#define PRS_TIMER0_OF             ((28 << 16) + 1) /**< PRS Timer 0 Overflow */
#define PRS_TIMER0_CC0            ((28 << 16) + 2) /**< PRS Timer 0 Compare/Capture 0 */
#define PRS_TIMER0_CC1            ((28 << 16) + 3) /**< PRS Timer 0 Compare/Capture 1 */
#define PRS_TIMER0_CC2            ((28 << 16) + 4) /**< PRS Timer 0 Compare/Capture 2 */
#define PRS_TIMER1_UF             ((29 << 16) + 0) /**< PRS Timer 1 Underflow */
#define PRS_TIMER1_OF             ((29 << 16) + 1) /**< PRS Timer 1 Overflow */
#define PRS_TIMER1_CC0            ((29 << 16) + 2) /**< PRS Timer 1 Compare/Capture 0 */
#define PRS_TIMER1_CC1            ((29 << 16) + 3) /**< PRS Timer 1 Compare/Capture 1 */
#define PRS_TIMER1_CC2            ((29 << 16) + 4) /**< PRS Timer 1 Compare/Capture 2 */
#define PRS_TIMER2_UF             ((30 << 16) + 0) /**< PRS Timer 2 Underflow */
#define PRS_TIMER2_OF             ((30 << 16) + 1) /**< PRS Timer 2 Overflow */
#define PRS_TIMER2_CC0            ((30 << 16) + 2) /**< PRS Timer 2 Compare/Capture 0 */
#define PRS_TIMER2_CC1            ((30 << 16) + 3) /**< PRS Timer 2 Compare/Capture 1 */
#define PRS_TIMER2_CC2            ((30 << 16) + 4) /**< PRS Timer 2 Compare/Capture 2 */
#define PRS_USB_SOF               ((36 << 16) + 0) /**< PRS USB Start of Frame */
#define PRS_USB_SOFSR             ((36 << 16) + 1) /**< PRS USB Start of Frame Sent/Received */
#define PRS_RTC_OF                ((40 << 16) + 0) /**< PRS RTC Overflow */
#define PRS_RTC_COMP0             ((40 << 16) + 1) /**< PRS RTC Compare 0 */
#define PRS_RTC_COMP1             ((40 << 16) + 2) /**< PRS RTC Compare 1 */
#define PRS_GPIO_PIN0             ((48 << 16) + 0) /**< PRS GPIO pin 0 */
#define PRS_GPIO_PIN1             ((48 << 16) + 1) /**< PRS GPIO pin 1 */
#define PRS_GPIO_PIN2             ((48 << 16) + 2) /**< PRS GPIO pin 2 */
#define PRS_GPIO_PIN3             ((48 << 16) + 3) /**< PRS GPIO pin 3 */
#define PRS_GPIO_PIN4             ((48 << 16) + 4) /**< PRS GPIO pin 4 */
#define PRS_GPIO_PIN5             ((48 << 16) + 5) /**< PRS GPIO pin 5 */
#define PRS_GPIO_PIN6             ((48 << 16) + 6) /**< PRS GPIO pin 6 */
#define PRS_GPIO_PIN7             ((48 << 16) + 7) /**< PRS GPIO pin 7 */
#define PRS_GPIO_PIN8             ((49 << 16) + 0) /**< PRS GPIO pin 8 */
#define PRS_GPIO_PIN9             ((49 << 16) + 1) /**< PRS GPIO pin 9 */
#define PRS_GPIO_PIN10            ((49 << 16) + 2) /**< PRS GPIO pin 10 */
#define PRS_GPIO_PIN11            ((49 << 16) + 3) /**< PRS GPIO pin 11 */
#define PRS_GPIO_PIN12            ((49 << 16) + 4) /**< PRS GPIO pin 12 */
#define PRS_GPIO_PIN13            ((49 << 16) + 5) /**< PRS GPIO pin 13 */
#define PRS_GPIO_PIN14            ((49 << 16) + 6) /**< PRS GPIO pin 14 */
#define PRS_GPIO_PIN15            ((49 << 16) + 7) /**< PRS GPIO pin 15 */
#define PRS_PCNT0_TCC             ((54 << 16) + 0) /**< PRS Triggered compare match */
#define PRS_LETEST_MUTG1          ((62 << 16) + 0) /**< PRS Grant output from LFA mutex */
#define PRS_LETEST_RTCCLKAPBLE    ((62 << 16) + 1) /**< PRS Mixed clock from RTC */
#define PRS_MANTEST_LFABLOCK      ((63 << 16) + 0) /**< PRS Block on LFA */
#define PRS_MANTEST_LFADLY        ((63 << 16) + 1) /**< PRS Delayed LFA clock */
#define PRS_MANTEST_LFAPULSE      ((63 << 16) + 2) /**< PRS LFA clock pulse */
#define PRS_MANTEST_GMCCALACT     ((63 << 16) + 3) /**< PRS GMC calibration active */

/** @} End of group EFM32HGFULL_PRS */

/**************************************************************************//**
 * @defgroup EFM32HGFULL_DMAREQ_BitFields  EFM32HGFULL_DMAREQ Bit Fields
 * @{
 *****************************************************************************/
#define DMAREQ_ADC0_SINGLE            ((8 << 16) + 0)  /**< DMA channel select for ADC0_SINGLE */
#define DMAREQ_ADC0_SCAN              ((8 << 16) + 1)  /**< DMA channel select for ADC0_SCAN */
#define DMAREQ_USART0_RXDATAV         ((12 << 16) + 0) /**< DMA channel select for USART0_RXDATAV */
#define DMAREQ_USART0_TXBL            ((12 << 16) + 1) /**< DMA channel select for USART0_TXBL */
#define DMAREQ_USART0_TXEMPTY         ((12 << 16) + 2) /**< DMA channel select for USART0_TXEMPTY */
#define DMAREQ_USART1_RXDATAV         ((13 << 16) + 0) /**< DMA channel select for USART1_RXDATAV */
#define DMAREQ_USART1_TXBL            ((13 << 16) + 1) /**< DMA channel select for USART1_TXBL */
#define DMAREQ_USART1_TXEMPTY         ((13 << 16) + 2) /**< DMA channel select for USART1_TXEMPTY */
#define DMAREQ_USART1_RXDATAVRIGHT    ((13 << 16) + 3) /**< DMA channel select for USART1_RXDATAVRIGHT */
#define DMAREQ_USART1_TXBLRIGHT       ((13 << 16) + 4) /**< DMA channel select for USART1_TXBLRIGHT */
#define DMAREQ_LEUART0_RXDATAV        ((16 << 16) + 0) /**< DMA channel select for LEUART0_RXDATAV */
#define DMAREQ_LEUART0_TXBL           ((16 << 16) + 1) /**< DMA channel select for LEUART0_TXBL */
#define DMAREQ_LEUART0_TXEMPTY        ((16 << 16) + 2) /**< DMA channel select for LEUART0_TXEMPTY */
#define DMAREQ_I2C0_RXDATAV           ((20 << 16) + 0) /**< DMA channel select for I2C0_RXDATAV */
#define DMAREQ_I2C0_TXBL              ((20 << 16) + 1) /**< DMA channel select for I2C0_TXBL */
#define DMAREQ_TIMER0_UFOF            ((24 << 16) + 0) /**< DMA channel select for TIMER0_UFOF */
#define DMAREQ_TIMER0_CC0             ((24 << 16) + 1) /**< DMA channel select for TIMER0_CC0 */
#define DMAREQ_TIMER0_CC1             ((24 << 16) + 2) /**< DMA channel select for TIMER0_CC1 */
#define DMAREQ_TIMER0_CC2             ((24 << 16) + 3) /**< DMA channel select for TIMER0_CC2 */
#define DMAREQ_TIMER1_UFOF            ((25 << 16) + 0) /**< DMA channel select for TIMER1_UFOF */
#define DMAREQ_TIMER1_CC0             ((25 << 16) + 1) /**< DMA channel select for TIMER1_CC0 */
#define DMAREQ_TIMER1_CC1             ((25 << 16) + 2) /**< DMA channel select for TIMER1_CC1 */
#define DMAREQ_TIMER1_CC2             ((25 << 16) + 3) /**< DMA channel select for TIMER1_CC2 */
#define DMAREQ_TIMER2_UFOF            ((26 << 16) + 0) /**< DMA channel select for TIMER2_UFOF */
#define DMAREQ_TIMER2_CC0             ((26 << 16) + 1) /**< DMA channel select for TIMER2_CC0 */
#define DMAREQ_TIMER2_CC1             ((26 << 16) + 2) /**< DMA channel select for TIMER2_CC1 */
#define DMAREQ_TIMER2_CC2             ((26 << 16) + 3) /**< DMA channel select for TIMER2_CC2 */
#define DMAREQ_MSC_WDATA              ((48 << 16) + 0) /**< DMA channel select for MSC_WDATA */
#define DMAREQ_AES_DATAWR             ((49 << 16) + 0) /**< DMA channel select for AES_DATAWR */
#define DMAREQ_AES_XORDATAWR          ((49 << 16) + 1) /**< DMA channel select for AES_XORDATAWR */
#define DMAREQ_AES_DATARD             ((49 << 16) + 2) /**< DMA channel select for AES_DATARD */
#define DMAREQ_AES_KEYWR              ((49 << 16) + 3) /**< DMA channel select for AES_KEYWR */

