stevew817/DAPLink/source/common/cmsis-core/siliconlabs/efm32hg/efm32hgfull.h
/* Bit fields for IDAC DUTYFREQSEL */
#define _IDAC_DUTYFREQSEL_RESETVALUE                0x00000000UL                              /**< Default value for IDAC_DUTYFREQSEL */
#define _IDAC_DUTYFREQSEL_MASK                      0x00000060UL                              /**< Mask for IDAC_DUTYFREQSEL */
#define _IDAC_DUTYFREQSEL_DUTYFSEL_SHIFT            5                                         /**< Shift value for IDAC_DUTYFSEL */
#define _IDAC_DUTYFREQSEL_DUTYFSEL_MASK             0x60UL                                    /**< Bit mask for IDAC_DUTYFSEL */
#define _IDAC_DUTYFREQSEL_DUTYFSEL_DEFAULT          0x00000000UL                              /**< Mode DEFAULT for IDAC_DUTYFREQSEL */
#define _IDAC_DUTYFREQSEL_DUTYFSEL_F0               0x00000000UL                              /**< Mode F0 for IDAC_DUTYFREQSEL */
#define _IDAC_DUTYFREQSEL_DUTYFSEL_F1               0x00000001UL                              /**< Mode F1 for IDAC_DUTYFREQSEL */
#define _IDAC_DUTYFREQSEL_DUTYFSEL_F2               0x00000002UL                              /**< Mode F2 for IDAC_DUTYFREQSEL */
#define _IDAC_DUTYFREQSEL_DUTYFSEL_F3               0x00000003UL                              /**< Mode F3 for IDAC_DUTYFREQSEL */
#define IDAC_DUTYFREQSEL_DUTYFSEL_DEFAULT           (_IDAC_DUTYFREQSEL_DUTYFSEL_DEFAULT << 5) /**< Shifted mode DEFAULT for IDAC_DUTYFREQSEL */
#define IDAC_DUTYFREQSEL_DUTYFSEL_F0                (_IDAC_DUTYFREQSEL_DUTYFSEL_F0 << 5)      /**< Shifted mode F0 for IDAC_DUTYFREQSEL */
#define IDAC_DUTYFREQSEL_DUTYFSEL_F1                (_IDAC_DUTYFREQSEL_DUTYFSEL_F1 << 5)      /**< Shifted mode F1 for IDAC_DUTYFREQSEL */
#define IDAC_DUTYFREQSEL_DUTYFSEL_F2                (_IDAC_DUTYFREQSEL_DUTYFSEL_F2 << 5)      /**< Shifted mode F2 for IDAC_DUTYFREQSEL */
#define IDAC_DUTYFREQSEL_DUTYFSEL_F3                (_IDAC_DUTYFREQSEL_DUTYFSEL_F3 << 5)      /**< Shifted mode F3 for IDAC_DUTYFREQSEL */

/* Bit fields for IDAC TESTCTRL */
#define _IDAC_TESTCTRL_RESETVALUE                   0x00000000UL                               /**< Default value for IDAC_TESTCTRL */
#define _IDAC_TESTCTRL_MASK                         0x0000001FUL                               /**< Mask for IDAC_TESTCTRL */
#define IDAC_TESTCTRL_CASCODEDIS                    (0x1UL << 0)                               /**< Cascode Stage Disable */
#define _IDAC_TESTCTRL_CASCODEDIS_SHIFT             0                                          /**< Shift value for IDAC_CASCODEDIS */
#define _IDAC_TESTCTRL_CASCODEDIS_MASK              0x1UL                                      /**< Bit mask for IDAC_CASCODEDIS */
#define _IDAC_TESTCTRL_CASCODEDIS_DEFAULT           0x00000000UL                               /**< Mode DEFAULT for IDAC_TESTCTRL */
#define IDAC_TESTCTRL_CASCODEDIS_DEFAULT            (_IDAC_TESTCTRL_CASCODEDIS_DEFAULT << 0)   /**< Shifted mode DEFAULT for IDAC_TESTCTRL */
#define IDAC_TESTCTRL_OPAMPDIS                      (0x1UL << 1)                               /**< Opamp Stage Disable */
#define _IDAC_TESTCTRL_OPAMPDIS_SHIFT               1                                          /**< Shift value for IDAC_OPAMPDIS */
#define _IDAC_TESTCTRL_OPAMPDIS_MASK                0x2UL                                      /**< Bit mask for IDAC_OPAMPDIS */
#define _IDAC_TESTCTRL_OPAMPDIS_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for IDAC_TESTCTRL */
#define IDAC_TESTCTRL_OPAMPDIS_DEFAULT              (_IDAC_TESTCTRL_OPAMPDIS_DEFAULT << 1)     /**< Shifted mode DEFAULT for IDAC_TESTCTRL */
#define _IDAC_TESTCTRL_PMOSCASCTUNE_SHIFT           2                                          /**< Shift value for IDAC_PMOSCASCTUNE */
#define _IDAC_TESTCTRL_PMOSCASCTUNE_MASK            0x1CUL                                     /**< Bit mask for IDAC_PMOSCASCTUNE */
#define _IDAC_TESTCTRL_PMOSCASCTUNE_DEFAULT         0x00000000UL                               /**< Mode DEFAULT for IDAC_TESTCTRL */
#define IDAC_TESTCTRL_PMOSCASCTUNE_DEFAULT          (_IDAC_TESTCTRL_PMOSCASCTUNE_DEFAULT << 2) /**< Shifted mode DEFAULT for IDAC_TESTCTRL */

/** @} End of group EFM32HGFULL_IDAC */

/**************************************************************************//**
 * @defgroup EFM32HGFULL_ADC_BitFields  EFM32HGFULL_ADC Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for ADC CTRL */
#define _ADC_CTRL_RESETVALUE                    0x001F0000UL                                /**< Default value for ADC_CTRL */
#define _ADC_CTRL_MASK                          0x1F7F7F3BUL                                /**< Mask for ADC_CTRL */
#define _ADC_CTRL_WARMUPMODE_SHIFT              0                                           /**< Shift value for ADC_WARMUPMODE */
#define _ADC_CTRL_WARMUPMODE_MASK               0x3UL                                       /**< Bit mask for ADC_WARMUPMODE */
#define _ADC_CTRL_WARMUPMODE_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for ADC_CTRL */
#define _ADC_CTRL_WARMUPMODE_NORMAL             0x00000000UL                                /**< Mode NORMAL for ADC_CTRL */
#define _ADC_CTRL_WARMUPMODE_FASTBG             0x00000001UL                                /**< Mode FASTBG for ADC_CTRL */
#define _ADC_CTRL_WARMUPMODE_KEEPSCANREFWARM    0x00000002UL                                /**< Mode KEEPSCANREFWARM for ADC_CTRL */
#define _ADC_CTRL_WARMUPMODE_KEEPADCWARM        0x00000003UL                                /**< Mode KEEPADCWARM for ADC_CTRL */
#define ADC_CTRL_WARMUPMODE_DEFAULT             (_ADC_CTRL_WARMUPMODE_DEFAULT << 0)         /**< Shifted mode DEFAULT for ADC_CTRL */
#define ADC_CTRL_WARMUPMODE_NORMAL              (_ADC_CTRL_WARMUPMODE_NORMAL << 0)          /**< Shifted mode NORMAL for ADC_CTRL */
#define ADC_CTRL_WARMUPMODE_FASTBG              (_ADC_CTRL_WARMUPMODE_FASTBG << 0)          /**< Shifted mode FASTBG for ADC_CTRL */
#define ADC_CTRL_WARMUPMODE_KEEPSCANREFWARM     (_ADC_CTRL_WARMUPMODE_KEEPSCANREFWARM << 0) /**< Shifted mode KEEPSCANREFWARM for ADC_CTRL */
#define ADC_CTRL_WARMUPMODE_KEEPADCWARM         (_ADC_CTRL_WARMUPMODE_KEEPADCWARM << 0)     /**< Shifted mode KEEPADCWARM for ADC_CTRL */
#define ADC_CTRL_TAILGATE                       (0x1UL << 3)                                /**< Conversion Tailgating */
#define _ADC_CTRL_TAILGATE_SHIFT                3                                           /**< Shift value for ADC_TAILGATE */
#define _ADC_CTRL_TAILGATE_MASK                 0x8UL                                       /**< Bit mask for ADC_TAILGATE */
#define _ADC_CTRL_TAILGATE_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for ADC_CTRL */
#define ADC_CTRL_TAILGATE_DEFAULT               (_ADC_CTRL_TAILGATE_DEFAULT << 3)           /**< Shifted mode DEFAULT for ADC_CTRL */
#define _ADC_CTRL_LPFMODE_SHIFT                 4                                           /**< Shift value for ADC_LPFMODE */
#define _ADC_CTRL_LPFMODE_MASK                  0x30UL                                      /**< Bit mask for ADC_LPFMODE */
#define _ADC_CTRL_LPFMODE_DEFAULT               0x00000000UL                                /**< Mode DEFAULT for ADC_CTRL */
#define _ADC_CTRL_LPFMODE_BYPASS                0x00000000UL                                /**< Mode BYPASS for ADC_CTRL */
#define _ADC_CTRL_LPFMODE_DECAP                 0x00000001UL                                /**< Mode DECAP for ADC_CTRL */
#define _ADC_CTRL_LPFMODE_RCFILT                0x00000002UL                                /**< Mode RCFILT for ADC_CTRL */
#define ADC_CTRL_LPFMODE_DEFAULT                (_ADC_CTRL_LPFMODE_DEFAULT << 4)            /**< Shifted mode DEFAULT for ADC_CTRL */
#define ADC_CTRL_LPFMODE_BYPASS                 (_ADC_CTRL_LPFMODE_BYPASS << 4)             /**< Shifted mode BYPASS for ADC_CTRL */
#define ADC_CTRL_LPFMODE_DECAP                  (_ADC_CTRL_LPFMODE_DECAP << 4)              /**< Shifted mode DECAP for ADC_CTRL */
#define ADC_CTRL_LPFMODE_RCFILT                 (_ADC_CTRL_LPFMODE_RCFILT << 4)             /**< Shifted mode RCFILT for ADC_CTRL */
#define _ADC_CTRL_PRESC_SHIFT                   8                                           /**< Shift value for ADC_PRESC */
#define _ADC_CTRL_PRESC_MASK                    0x7F00UL                                    /**< Bit mask for ADC_PRESC */
#define _ADC_CTRL_PRESC_DEFAULT                 0x00000000UL                                /**< Mode DEFAULT for ADC_CTRL */
#define _ADC_CTRL_PRESC_NODIVISION              0x00000000UL                                /**< Mode NODIVISION for ADC_CTRL */
#define ADC_CTRL_PRESC_DEFAULT                  (_ADC_CTRL_PRESC_DEFAULT << 8)              /**< Shifted mode DEFAULT for ADC_CTRL */
#define ADC_CTRL_PRESC_NODIVISION               (_ADC_CTRL_PRESC_NODIVISION << 8)           /**< Shifted mode NODIVISION for ADC_CTRL */
#define _ADC_CTRL_TIMEBASE_SHIFT                16                                          /**< Shift value for ADC_TIMEBASE */
#define _ADC_CTRL_TIMEBASE_MASK                 0x7F0000UL                                  /**< Bit mask for ADC_TIMEBASE */
#define _ADC_CTRL_TIMEBASE_DEFAULT              0x0000001FUL                                /**< Mode DEFAULT for ADC_CTRL */
#define ADC_CTRL_TIMEBASE_DEFAULT               (_ADC_CTRL_TIMEBASE_DEFAULT << 16)          /**< Shifted mode DEFAULT for ADC_CTRL */
#define _ADC_CTRL_OVSRSEL_SHIFT                 24                                          /**< Shift value for ADC_OVSRSEL */
#define _ADC_CTRL_OVSRSEL_MASK                  0xF000000UL                                 /**< Bit mask for ADC_OVSRSEL */
#define _ADC_CTRL_OVSRSEL_DEFAULT               0x00000000UL                                /**< Mode DEFAULT for ADC_CTRL */
#define _ADC_CTRL_OVSRSEL_X2                    0x00000000UL                                /**< Mode X2 for ADC_CTRL */
#define _ADC_CTRL_OVSRSEL_X4                    0x00000001UL                                /**< Mode X4 for ADC_CTRL */
#define _ADC_CTRL_OVSRSEL_X8                    0x00000002UL                                /**< Mode X8 for ADC_CTRL */
#define _ADC_CTRL_OVSRSEL_X16                   0x00000003UL                                /**< Mode X16 for ADC_CTRL */
#define _ADC_CTRL_OVSRSEL_X32                   0x00000004UL                                /**< Mode X32 for ADC_CTRL */
#define _ADC_CTRL_OVSRSEL_X64                   0x00000005UL                                /**< Mode X64 for ADC_CTRL */
#define _ADC_CTRL_OVSRSEL_X128                  0x00000006UL                                /**< Mode X128 for ADC_CTRL */
#define _ADC_CTRL_OVSRSEL_X256                  0x00000007UL                                /**< Mode X256 for ADC_CTRL */
#define _ADC_CTRL_OVSRSEL_X512                  0x00000008UL                                /**< Mode X512 for ADC_CTRL */
#define _ADC_CTRL_OVSRSEL_X1024                 0x00000009UL                                /**< Mode X1024 for ADC_CTRL */
#define _ADC_CTRL_OVSRSEL_X2048                 0x0000000AUL                                /**< Mode X2048 for ADC_CTRL */
#define _ADC_CTRL_OVSRSEL_X4096                 0x0000000BUL                                /**< Mode X4096 for ADC_CTRL */
#define ADC_CTRL_OVSRSEL_DEFAULT                (_ADC_CTRL_OVSRSEL_DEFAULT << 24)           /**< Shifted mode DEFAULT for ADC_CTRL */
#define ADC_CTRL_OVSRSEL_X2                     (_ADC_CTRL_OVSRSEL_X2 << 24)                /**< Shifted mode X2 for ADC_CTRL */
#define ADC_CTRL_OVSRSEL_X4                     (_ADC_CTRL_OVSRSEL_X4 << 24)                /**< Shifted mode X4 for ADC_CTRL */
#define ADC_CTRL_OVSRSEL_X8                     (_ADC_CTRL_OVSRSEL_X8 << 24)                /**< Shifted mode X8 for ADC_CTRL */
#define ADC_CTRL_OVSRSEL_X16                    (_ADC_CTRL_OVSRSEL_X16 << 24)               /**< Shifted mode X16 for ADC_CTRL */
#define ADC_CTRL_OVSRSEL_X32                    (_ADC_CTRL_OVSRSEL_X32 << 24)               /**< Shifted mode X32 for ADC_CTRL */
#define ADC_CTRL_OVSRSEL_X64                    (_ADC_CTRL_OVSRSEL_X64 << 24)               /**< Shifted mode X64 for ADC_CTRL */
#define ADC_CTRL_OVSRSEL_X128                   (_ADC_CTRL_OVSRSEL_X128 << 24)              /**< Shifted mode X128 for ADC_CTRL */
#define ADC_CTRL_OVSRSEL_X256                   (_ADC_CTRL_OVSRSEL_X256 << 24)              /**< Shifted mode X256 for ADC_CTRL */
#define ADC_CTRL_OVSRSEL_X512                   (_ADC_CTRL_OVSRSEL_X512 << 24)              /**< Shifted mode X512 for ADC_CTRL */
#define ADC_CTRL_OVSRSEL_X1024                  (_ADC_CTRL_OVSRSEL_X1024 << 24)             /**< Shifted mode X1024 for ADC_CTRL */
#define ADC_CTRL_OVSRSEL_X2048                  (_ADC_CTRL_OVSRSEL_X2048 << 24)             /**< Shifted mode X2048 for ADC_CTRL */
#define ADC_CTRL_OVSRSEL_X4096                  (_ADC_CTRL_OVSRSEL_X4096 << 24)             /**< Shifted mode X4096 for ADC_CTRL */
#define ADC_CTRL_CHCONIDLE                      (0x1UL << 28)                               /**< Input channel connected when ADC is IDLE */
#define _ADC_CTRL_CHCONIDLE_SHIFT               28                                          /**< Shift value for ADC_CHCONIDLE */
#define _ADC_CTRL_CHCONIDLE_MASK                0x10000000UL                                /**< Bit mask for ADC_CHCONIDLE */
#define _ADC_CTRL_CHCONIDLE_DEFAULT             0x00000000UL                                /**< Mode DEFAULT for ADC_CTRL */
#define _ADC_CTRL_CHCONIDLE_DISCONNECT          0x00000000UL                                /**< Mode DISCONNECT for ADC_CTRL */
#define _ADC_CTRL_CHCONIDLE_KEEPCON             0x00000001UL                                /**< Mode KEEPCON for ADC_CTRL */
#define ADC_CTRL_CHCONIDLE_DEFAULT              (_ADC_CTRL_CHCONIDLE_DEFAULT << 28)         /**< Shifted mode DEFAULT for ADC_CTRL */
#define ADC_CTRL_CHCONIDLE_DISCONNECT           (_ADC_CTRL_CHCONIDLE_DISCONNECT << 28)      /**< Shifted mode DISCONNECT for ADC_CTRL */
#define ADC_CTRL_CHCONIDLE_KEEPCON              (_ADC_CTRL_CHCONIDLE_KEEPCON << 28)         /**< Shifted mode KEEPCON for ADC_CTRL */

/* Bit fields for ADC CMD */
#define _ADC_CMD_RESETVALUE                     0x00000000UL                        /**< Default value for ADC_CMD */
#define _ADC_CMD_MASK                           0x0000000FUL                        /**< Mask for ADC_CMD */
#define ADC_CMD_SINGLESTART                     (0x1UL << 0)                        /**< Single Conversion Start */
#define _ADC_CMD_SINGLESTART_SHIFT              0                                   /**< Shift value for ADC_SINGLESTART */
#define _ADC_CMD_SINGLESTART_MASK               0x1UL                               /**< Bit mask for ADC_SINGLESTART */
#define _ADC_CMD_SINGLESTART_DEFAULT            0x00000000UL                        /**< Mode DEFAULT for ADC_CMD */
#define ADC_CMD_SINGLESTART_DEFAULT             (_ADC_CMD_SINGLESTART_DEFAULT << 0) /**< Shifted mode DEFAULT for ADC_CMD */
#define ADC_CMD_SINGLESTOP                      (0x1UL << 1)                        /**< Single Conversion Stop */
#define _ADC_CMD_SINGLESTOP_SHIFT               1                                   /**< Shift value for ADC_SINGLESTOP */
#define _ADC_CMD_SINGLESTOP_MASK                0x2UL                               /**< Bit mask for ADC_SINGLESTOP */
#define _ADC_CMD_SINGLESTOP_DEFAULT             0x00000000UL                        /**< Mode DEFAULT for ADC_CMD */
#define ADC_CMD_SINGLESTOP_DEFAULT              (_ADC_CMD_SINGLESTOP_DEFAULT << 1)  /**< Shifted mode DEFAULT for ADC_CMD */
#define ADC_CMD_SCANSTART                       (0x1UL << 2)                        /**< Scan Sequence Start */
#define _ADC_CMD_SCANSTART_SHIFT                2                                   /**< Shift value for ADC_SCANSTART */
#define _ADC_CMD_SCANSTART_MASK                 0x4UL                               /**< Bit mask for ADC_SCANSTART */
#define _ADC_CMD_SCANSTART_DEFAULT              0x00000000UL                        /**< Mode DEFAULT for ADC_CMD */
#define ADC_CMD_SCANSTART_DEFAULT               (_ADC_CMD_SCANSTART_DEFAULT << 2)   /**< Shifted mode DEFAULT for ADC_CMD */
#define ADC_CMD_SCANSTOP                        (0x1UL << 3)                        /**< Scan Sequence Stop */
#define _ADC_CMD_SCANSTOP_SHIFT                 3                                   /**< Shift value for ADC_SCANSTOP */
#define _ADC_CMD_SCANSTOP_MASK                  0x8UL                               /**< Bit mask for ADC_SCANSTOP */
#define _ADC_CMD_SCANSTOP_DEFAULT               0x00000000UL                        /**< Mode DEFAULT for ADC_CMD */
#define ADC_CMD_SCANSTOP_DEFAULT                (_ADC_CMD_SCANSTOP_DEFAULT << 3)    /**< Shifted mode DEFAULT for ADC_CMD */

