stevew817/DAPLink/source/common/cmsis-core/siliconlabs/efm32hg/efm32hgfull.h
/* Bit fields for USB IEN */
#define _USB_IEN_RESETVALUE                        0x00000000UL                    /**< Default value for USB_IEN */
#define _USB_IEN_MASK                              0x00000007UL                    /**< Mask for USB_IEN */
#define USB_IEN_VREGOSH                            (0x1UL << 0)                    /**< VREGO Sense High Interrupt Enable */
#define _USB_IEN_VREGOSH_SHIFT                     0                               /**< Shift value for USB_VREGOSH */
#define _USB_IEN_VREGOSH_MASK                      0x1UL                           /**< Bit mask for USB_VREGOSH */
#define _USB_IEN_VREGOSH_DEFAULT                   0x00000000UL                    /**< Mode DEFAULT for USB_IEN */
#define USB_IEN_VREGOSH_DEFAULT                    (_USB_IEN_VREGOSH_DEFAULT << 0) /**< Shifted mode DEFAULT for USB_IEN */
#define USB_IEN_VREGOSL                            (0x1UL << 1)                    /**< VREGO Sense Low Interrupt Enable */
#define _USB_IEN_VREGOSL_SHIFT                     1                               /**< Shift value for USB_VREGOSL */
#define _USB_IEN_VREGOSL_MASK                      0x2UL                           /**< Bit mask for USB_VREGOSL */
#define _USB_IEN_VREGOSL_DEFAULT                   0x00000000UL                    /**< Mode DEFAULT for USB_IEN */
#define USB_IEN_VREGOSL_DEFAULT                    (_USB_IEN_VREGOSL_DEFAULT << 1) /**< Shifted mode DEFAULT for USB_IEN */
#define USB_IEN_DWCOTG                             (0x1UL << 2)                    /**< DWC_otg Interrupt Enable */
#define _USB_IEN_DWCOTG_SHIFT                      2                               /**< Shift value for USB_DWCOTG */
#define _USB_IEN_DWCOTG_MASK                       0x4UL                           /**< Bit mask for USB_DWCOTG */
#define _USB_IEN_DWCOTG_DEFAULT                    0x00000000UL                    /**< Mode DEFAULT for USB_IEN */
#define USB_IEN_DWCOTG_DEFAULT                     (_USB_IEN_DWCOTG_DEFAULT << 2)  /**< Shifted mode DEFAULT for USB_IEN */

/* Bit fields for USB ROUTE */
#define _USB_ROUTE_RESETVALUE                      0x00000000UL                      /**< Default value for USB_ROUTE */
#define _USB_ROUTE_MASK                            0x00000005UL                      /**< Mask for USB_ROUTE */
#define USB_ROUTE_PHYPEN                           (0x1UL << 0)                      /**< USB PHY Pin Enable */
#define _USB_ROUTE_PHYPEN_SHIFT                    0                                 /**< Shift value for USB_PHYPEN */
#define _USB_ROUTE_PHYPEN_MASK                     0x1UL                             /**< Bit mask for USB_PHYPEN */
#define _USB_ROUTE_PHYPEN_DEFAULT                  0x00000000UL                      /**< Mode DEFAULT for USB_ROUTE */
#define USB_ROUTE_PHYPEN_DEFAULT                   (_USB_ROUTE_PHYPEN_DEFAULT << 0)  /**< Shifted mode DEFAULT for USB_ROUTE */
#define USB_ROUTE_DMPUPEN                          (0x1UL << 2)                      /**< DMPU Pin Enable */
#define _USB_ROUTE_DMPUPEN_SHIFT                   2                                 /**< Shift value for USB_DMPUPEN */
#define _USB_ROUTE_DMPUPEN_MASK                    0x4UL                             /**< Bit mask for USB_DMPUPEN */
#define _USB_ROUTE_DMPUPEN_DEFAULT                 0x00000000UL                      /**< Mode DEFAULT for USB_ROUTE */
#define USB_ROUTE_DMPUPEN_DEFAULT                  (_USB_ROUTE_DMPUPEN_DEFAULT << 2) /**< Shifted mode DEFAULT for USB_ROUTE */

/* Bit fields for USB TESTCTRL */
#define _USB_TESTCTRL_RESETVALUE                   0x00000000UL                              /**< Default value for USB_TESTCTRL */
#define _USB_TESTCTRL_MASK                         0xFFFF000FUL                              /**< Mask for USB_TESTCTRL */
#define USB_TESTCTRL_PHYOSEN                       (0x1UL << 0)                              /**< PHY Output Sampling Enable */
#define _USB_TESTCTRL_PHYOSEN_SHIFT                0                                         /**< Shift value for USB_PHYOSEN */
#define _USB_TESTCTRL_PHYOSEN_MASK                 0x1UL                                     /**< Bit mask for USB_PHYOSEN */
#define _USB_TESTCTRL_PHYOSEN_DEFAULT              0x00000000UL                              /**< Mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_PHYOSEN_DEFAULT               (_USB_TESTCTRL_PHYOSEN_DEFAULT << 0)      /**< Shifted mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_PHYIOEN                       (0x1UL << 1)                              /**< PHY Input Override Enable */
#define _USB_TESTCTRL_PHYIOEN_SHIFT                1                                         /**< Shift value for USB_PHYIOEN */
#define _USB_TESTCTRL_PHYIOEN_MASK                 0x2UL                                     /**< Bit mask for USB_PHYIOEN */
#define _USB_TESTCTRL_PHYIOEN_DEFAULT              0x00000000UL                              /**< Mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_PHYIOEN_DEFAULT               (_USB_TESTCTRL_PHYIOEN_DEFAULT << 1)      /**< Shifted mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_RAMRWU3BEN                    (0x1UL << 2)                              /**< RAM Read/Write Upper 3 Bits Enable */
#define _USB_TESTCTRL_RAMRWU3BEN_SHIFT             2                                         /**< Shift value for USB_RAMRWU3BEN */
#define _USB_TESTCTRL_RAMRWU3BEN_MASK              0x4UL                                     /**< Bit mask for USB_RAMRWU3BEN */
#define _USB_TESTCTRL_RAMRWU3BEN_DEFAULT           0x00000000UL                              /**< Mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_RAMRWU3BEN_DEFAULT            (_USB_TESTCTRL_RAMRWU3BEN_DEFAULT << 2)   /**< Shifted mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_EOPDETEN                      (0x1UL << 3)                              /**< EOP detector enable */
#define _USB_TESTCTRL_EOPDETEN_SHIFT               3                                         /**< Shift value for USB_EOPDETEN */
#define _USB_TESTCTRL_EOPDETEN_MASK                0x8UL                                     /**< Bit mask for USB_EOPDETEN */
#define _USB_TESTCTRL_EOPDETEN_DEFAULT             0x00000000UL                              /**< Mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_EOPDETEN_DEFAULT              (_USB_TESTCTRL_EOPDETEN_DEFAULT << 3)     /**< Shifted mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_IDPULLUP                      (0x1UL << 16)                             /**< ID Pullup */
#define _USB_TESTCTRL_IDPULLUP_SHIFT               16                                        /**< Shift value for USB_IDPULLUP */
#define _USB_TESTCTRL_IDPULLUP_MASK                0x10000UL                                 /**< Bit mask for USB_IDPULLUP */
#define _USB_TESTCTRL_IDPULLUP_DEFAULT             0x00000000UL                              /**< Mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_IDPULLUP_DEFAULT              (_USB_TESTCTRL_IDPULLUP_DEFAULT << 16)    /**< Shifted mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_VBUSCHG                       (0x1UL << 17)                             /**< VBUS Charge */
#define _USB_TESTCTRL_VBUSCHG_SHIFT                17                                        /**< Shift value for USB_VBUSCHG */
#define _USB_TESTCTRL_VBUSCHG_MASK                 0x20000UL                                 /**< Bit mask for USB_VBUSCHG */
#define _USB_TESTCTRL_VBUSCHG_DEFAULT              0x00000000UL                              /**< Mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_VBUSCHG_DEFAULT               (_USB_TESTCTRL_VBUSCHG_DEFAULT << 17)     /**< Shifted mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_VBUSDISCHG                    (0x1UL << 18)                             /**< VBUS Discharge */
#define _USB_TESTCTRL_VBUSDISCHG_SHIFT             18                                        /**< Shift value for USB_VBUSDISCHG */
#define _USB_TESTCTRL_VBUSDISCHG_MASK              0x40000UL                                 /**< Bit mask for USB_VBUSDISCHG */
#define _USB_TESTCTRL_VBUSDISCHG_DEFAULT           0x00000000UL                              /**< Mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_VBUSDISCHG_DEFAULT            (_USB_TESTCTRL_VBUSDISCHG_DEFAULT << 18)  /**< Shifted mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_DMHIGH                        (0x1UL << 19)                             /**< DM Pullup */
#define _USB_TESTCTRL_DMHIGH_SHIFT                 19                                        /**< Shift value for USB_DMHIGH */
#define _USB_TESTCTRL_DMHIGH_MASK                  0x80000UL                                 /**< Bit mask for USB_DMHIGH */
#define _USB_TESTCTRL_DMHIGH_DEFAULT               0x00000000UL                              /**< Mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_DMHIGH_DEFAULT                (_USB_TESTCTRL_DMHIGH_DEFAULT << 19)      /**< Shifted mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_DPHIGH                        (0x1UL << 20)                             /**< DP Pullup */
#define _USB_TESTCTRL_DPHIGH_SHIFT                 20                                        /**< Shift value for USB_DPHIGH */
#define _USB_TESTCTRL_DPHIGH_MASK                  0x100000UL                                /**< Bit mask for USB_DPHIGH */
#define _USB_TESTCTRL_DPHIGH_DEFAULT               0x00000000UL                              /**< Mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_DPHIGH_DEFAULT                (_USB_TESTCTRL_DPHIGH_DEFAULT << 20)      /**< Shifted mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_DMLOW                         (0x1UL << 21)                             /**< DM Pulldown */
#define _USB_TESTCTRL_DMLOW_SHIFT                  21                                        /**< Shift value for USB_DMLOW */
#define _USB_TESTCTRL_DMLOW_MASK                   0x200000UL                                /**< Bit mask for USB_DMLOW */
#define _USB_TESTCTRL_DMLOW_DEFAULT                0x00000000UL                              /**< Mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_DMLOW_DEFAULT                 (_USB_TESTCTRL_DMLOW_DEFAULT << 21)       /**< Shifted mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_DPLOW                         (0x1UL << 22)                             /**< DP Pulldown */
#define _USB_TESTCTRL_DPLOW_SHIFT                  22                                        /**< Shift value for USB_DPLOW */
#define _USB_TESTCTRL_DPLOW_MASK                   0x400000UL                                /**< Bit mask for USB_DPLOW */
#define _USB_TESTCTRL_DPLOW_DEFAULT                0x00000000UL                              /**< Mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_DPLOW_DEFAULT                 (_USB_TESTCTRL_DPLOW_DEFAULT << 22)       /**< Shifted mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_RPUHIGH                       (0x1UL << 23)                             /**< Extra Pullup Enable */
#define _USB_TESTCTRL_RPUHIGH_SHIFT                23                                        /**< Shift value for USB_RPUHIGH */
#define _USB_TESTCTRL_RPUHIGH_MASK                 0x800000UL                                /**< Bit mask for USB_RPUHIGH */
#define _USB_TESTCTRL_RPUHIGH_DEFAULT              0x00000000UL                              /**< Mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_RPUHIGH_DEFAULT               (_USB_TESTCTRL_RPUHIGH_DEFAULT << 23)     /**< Shifted mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_SUSPEND                       (0x1UL << 24)                             /**< Suspend */
#define _USB_TESTCTRL_SUSPEND_SHIFT                24                                        /**< Shift value for USB_SUSPEND */
#define _USB_TESTCTRL_SUSPEND_MASK                 0x1000000UL                               /**< Bit mask for USB_SUSPEND */
#define _USB_TESTCTRL_SUSPEND_DEFAULT              0x00000000UL                              /**< Mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_SUSPEND_DEFAULT               (_USB_TESTCTRL_SUSPEND_DEFAULT << 24)     /**< Shifted mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_SPEED                         (0x1UL << 25)                             /**< Speed */
#define _USB_TESTCTRL_SPEED_SHIFT                  25                                        /**< Shift value for USB_SPEED */
#define _USB_TESTCTRL_SPEED_MASK                   0x2000000UL                               /**< Bit mask for USB_SPEED */
#define _USB_TESTCTRL_SPEED_DEFAULT                0x00000000UL                              /**< Mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_SPEED_DEFAULT                 (_USB_TESTCTRL_SPEED_DEFAULT << 25)       /**< Shifted mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_TXDATA                        (0x1UL << 26)                             /**< TX Data */
#define _USB_TESTCTRL_TXDATA_SHIFT                 26                                        /**< Shift value for USB_TXDATA */
#define _USB_TESTCTRL_TXDATA_MASK                  0x4000000UL                               /**< Bit mask for USB_TXDATA */
#define _USB_TESTCTRL_TXDATA_DEFAULT               0x00000000UL                              /**< Mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_TXDATA_DEFAULT                (_USB_TESTCTRL_TXDATA_DEFAULT << 26)      /**< Shifted mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_TXSE0                         (0x1UL << 27)                             /**< TX SE0 */
#define _USB_TESTCTRL_TXSE0_SHIFT                  27                                        /**< Shift value for USB_TXSE0 */
#define _USB_TESTCTRL_TXSE0_MASK                   0x8000000UL                               /**< Bit mask for USB_TXSE0 */
#define _USB_TESTCTRL_TXSE0_DEFAULT                0x00000000UL                              /**< Mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_TXSE0_DEFAULT                 (_USB_TESTCTRL_TXSE0_DEFAULT << 27)       /**< Shifted mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_OEN                           (0x1UL << 28)                             /**< Output Enable (active low) */
#define _USB_TESTCTRL_OEN_SHIFT                    28                                        /**< Shift value for USB_OEN */
#define _USB_TESTCTRL_OEN_MASK                     0x10000000UL                              /**< Bit mask for USB_OEN */
#define _USB_TESTCTRL_OEN_DEFAULT                  0x00000000UL                              /**< Mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_OEN_DEFAULT                   (_USB_TESTCTRL_OEN_DEFAULT << 28)         /**< Shifted mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_PRSOVERRIDE                   (0x1UL << 29)                             /**< Route test signals to PRS */
#define _USB_TESTCTRL_PRSOVERRIDE_SHIFT            29                                        /**< Shift value for USB_PRSOVERRIDE */
#define _USB_TESTCTRL_PRSOVERRIDE_MASK             0x20000000UL                              /**< Bit mask for USB_PRSOVERRIDE */
#define _USB_TESTCTRL_PRSOVERRIDE_DEFAULT          0x00000000UL                              /**< Mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_PRSOVERRIDE_DEFAULT           (_USB_TESTCTRL_PRSOVERRIDE_DEFAULT << 29) /**< Shifted mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_PRSOVRSEL0                    (0x1UL << 30)                             /**< PRS override select 0 */
#define _USB_TESTCTRL_PRSOVRSEL0_SHIFT             30                                        /**< Shift value for USB_PRSOVRSEL0 */
#define _USB_TESTCTRL_PRSOVRSEL0_MASK              0x40000000UL                              /**< Bit mask for USB_PRSOVRSEL0 */
#define _USB_TESTCTRL_PRSOVRSEL0_DEFAULT           0x00000000UL                              /**< Mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_PRSOVRSEL0_DEFAULT            (_USB_TESTCTRL_PRSOVRSEL0_DEFAULT << 30)  /**< Shifted mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_PRSOVRSEL1                    (0x1UL << 31)                             /**< PRS override select 0 */
#define _USB_TESTCTRL_PRSOVRSEL1_SHIFT             31                                        /**< Shift value for USB_PRSOVRSEL1 */
#define _USB_TESTCTRL_PRSOVRSEL1_MASK              0x80000000UL                              /**< Bit mask for USB_PRSOVRSEL1 */
#define _USB_TESTCTRL_PRSOVRSEL1_DEFAULT           0x00000000UL                              /**< Mode DEFAULT for USB_TESTCTRL */
#define USB_TESTCTRL_PRSOVRSEL1_DEFAULT            (_USB_TESTCTRL_PRSOVRSEL1_DEFAULT << 31)  /**< Shifted mode DEFAULT for USB_TESTCTRL */

/* Bit fields for USB TESTSTATUS */
#define _USB_TESTSTATUS_RESETVALUE                 0x00000000UL                          /**< Default value for USB_TESTSTATUS */
#define _USB_TESTSTATUS_MASK                       0x0000007FUL                          /**< Mask for USB_TESTSTATUS */
#define USB_TESTSTATUS_VBUS44                      (0x1UL << 0)                          /**< VBUS 4.4V Comparator Output */
#define _USB_TESTSTATUS_VBUS44_SHIFT               0                                     /**< Shift value for USB_VBUS44 */
#define _USB_TESTSTATUS_VBUS44_MASK                0x1UL                                 /**< Bit mask for USB_VBUS44 */
#define _USB_TESTSTATUS_VBUS44_DEFAULT             0x00000000UL                          /**< Mode DEFAULT for USB_TESTSTATUS */
#define USB_TESTSTATUS_VBUS44_DEFAULT              (_USB_TESTSTATUS_VBUS44_DEFAULT << 0) /**< Shifted mode DEFAULT for USB_TESTSTATUS */
#define USB_TESTSTATUS_VBUS20                      (0x1UL << 1)                          /**< VBUS 2.0V Comparator Output */
#define _USB_TESTSTATUS_VBUS20_SHIFT               1                                     /**< Shift value for USB_VBUS20 */
#define _USB_TESTSTATUS_VBUS20_MASK                0x2UL                                 /**< Bit mask for USB_VBUS20 */
#define _USB_TESTSTATUS_VBUS20_DEFAULT             0x00000000UL                          /**< Mode DEFAULT for USB_TESTSTATUS */
#define USB_TESTSTATUS_VBUS20_DEFAULT              (_USB_TESTSTATUS_VBUS20_DEFAULT << 1) /**< Shifted mode DEFAULT for USB_TESTSTATUS */
#define USB_TESTSTATUS_VBUS08                      (0x1UL << 2)                          /**< VBUS 0.8V Comparator Output */
#define _USB_TESTSTATUS_VBUS08_SHIFT               2                                     /**< Shift value for USB_VBUS08 */
#define _USB_TESTSTATUS_VBUS08_MASK                0x4UL                                 /**< Bit mask for USB_VBUS08 */
#define _USB_TESTSTATUS_VBUS08_DEFAULT             0x00000000UL                          /**< Mode DEFAULT for USB_TESTSTATUS */
#define USB_TESTSTATUS_VBUS08_DEFAULT              (_USB_TESTSTATUS_VBUS08_DEFAULT << 2) /**< Shifted mode DEFAULT for USB_TESTSTATUS */
#define USB_TESTSTATUS_RCV                         (0x1UL << 3)                          /**< Differential Receiver Output */
#define _USB_TESTSTATUS_RCV_SHIFT                  3                                     /**< Shift value for USB_RCV */
#define _USB_TESTSTATUS_RCV_MASK                   0x8UL                                 /**< Bit mask for USB_RCV */
#define _USB_TESTSTATUS_RCV_DEFAULT                0x00000000UL                          /**< Mode DEFAULT for USB_TESTSTATUS */
#define USB_TESTSTATUS_RCV_DEFAULT                 (_USB_TESTSTATUS_RCV_DEFAULT << 3)    /**< Shifted mode DEFAULT for USB_TESTSTATUS */
#define USB_TESTSTATUS_DM                          (0x1UL << 4)                          /**< Single Ended D- */
#define _USB_TESTSTATUS_DM_SHIFT                   4                                     /**< Shift value for USB_DM */
#define _USB_TESTSTATUS_DM_MASK                    0x10UL                                /**< Bit mask for USB_DM */
#define _USB_TESTSTATUS_DM_DEFAULT                 0x00000000UL                          /**< Mode DEFAULT for USB_TESTSTATUS */
#define USB_TESTSTATUS_DM_DEFAULT                  (_USB_TESTSTATUS_DM_DEFAULT << 4)     /**< Shifted mode DEFAULT for USB_TESTSTATUS */
#define USB_TESTSTATUS_DP                          (0x1UL << 5)                          /**< Single Ended D+ */
#define _USB_TESTSTATUS_DP_SHIFT                   5                                     /**< Shift value for USB_DP */
#define _USB_TESTSTATUS_DP_MASK                    0x20UL                                /**< Bit mask for USB_DP */
#define _USB_TESTSTATUS_DP_DEFAULT                 0x00000000UL                          /**< Mode DEFAULT for USB_TESTSTATUS */
#define USB_TESTSTATUS_DP_DEFAULT                  (_USB_TESTSTATUS_DP_DEFAULT << 5)     /**< Shifted mode DEFAULT for USB_TESTSTATUS */
#define USB_TESTSTATUS_ID                          (0x1UL << 6)                          /**< ID status */
#define _USB_TESTSTATUS_ID_SHIFT                   6                                     /**< Shift value for USB_ID */
#define _USB_TESTSTATUS_ID_MASK                    0x40UL                                /**< Bit mask for USB_ID */
#define _USB_TESTSTATUS_ID_DEFAULT                 0x00000000UL                          /**< Mode DEFAULT for USB_TESTSTATUS */
#define USB_TESTSTATUS_ID_DEFAULT                  (_USB_TESTSTATUS_ID_DEFAULT << 6)     /**< Shifted mode DEFAULT for USB_TESTSTATUS */

/* Bit fields for USB FEATURE */
#define _USB_FEATURE_RESETVALUE                    0x00000000UL                              /**< Default value for USB_FEATURE */
#define _USB_FEATURE_MASK                          0x00000003UL                              /**< Mask for USB_FEATURE */
#define USB_FEATURE_AHBDIVDIS                      (0x1UL << 0)                              /**< AHB Clock Division Disable */
#define _USB_FEATURE_AHBDIVDIS_SHIFT               0                                         /**< Shift value for USB_AHBDIVDIS */
#define _USB_FEATURE_AHBDIVDIS_MASK                0x1UL                                     /**< Bit mask for USB_AHBDIVDIS */
#define _USB_FEATURE_AHBDIVDIS_DEFAULT             0x00000000UL                              /**< Mode DEFAULT for USB_FEATURE */
#define USB_FEATURE_AHBDIVDIS_DEFAULT              (_USB_FEATURE_AHBDIVDIS_DEFAULT << 0)     /**< Shifted mode DEFAULT for USB_FEATURE */
#define USB_FEATURE_LEMNAKIDLEDIS                  (0x1UL << 1)                              /**< LEM NAK Idle detect disable */
#define _USB_FEATURE_LEMNAKIDLEDIS_SHIFT           1                                         /**< Shift value for USB_LEMNAKIDLEDIS */
#define _USB_FEATURE_LEMNAKIDLEDIS_MASK            0x2UL                                     /**< Bit mask for USB_LEMNAKIDLEDIS */
#define _USB_FEATURE_LEMNAKIDLEDIS_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for USB_FEATURE */
#define USB_FEATURE_LEMNAKIDLEDIS_DEFAULT          (_USB_FEATURE_LEMNAKIDLEDIS_DEFAULT << 1) /**< Shifted mode DEFAULT for USB_FEATURE */

/* Bit fields for USB VREGCONF */
#define _USB_VREGCONF_RESETVALUE                   0x00000000UL                          /**< Default value for USB_VREGCONF */
#define _USB_VREGCONF_MASK                         0x0000000FUL                          /**< Mask for USB_VREGCONF */
#define _USB_VREGCONF_VREGOCAL_SHIFT               0                                     /**< Shift value for USB_VREGOCAL */
#define _USB_VREGCONF_VREGOCAL_MASK                0xFUL                                 /**< Bit mask for USB_VREGOCAL */
#define _USB_VREGCONF_VREGOCAL_DEFAULT             0x00000000UL                          /**< Mode DEFAULT for USB_VREGCONF */
#define USB_VREGCONF_VREGOCAL_DEFAULT              (_USB_VREGCONF_VREGOCAL_DEFAULT << 0) /**< Shifted mode DEFAULT for USB_VREGCONF */

