stevew817/DAPLink/source/common/cmsis-core/siliconlabs/efm32hg/efm32hgfull.h
/* Bit fields for MSC STATUS */
#define _MSC_STATUS_RESETVALUE                   0x00000008UL                            /**< Default value for MSC_STATUS */
#define _MSC_STATUS_MASK                         0x0000007FUL                            /**< Mask for MSC_STATUS */
#define MSC_STATUS_BUSY                          (0x1UL << 0)                            /**< Erase/Write Busy */
#define _MSC_STATUS_BUSY_SHIFT                   0                                       /**< Shift value for MSC_BUSY */
#define _MSC_STATUS_BUSY_MASK                    0x1UL                                   /**< Bit mask for MSC_BUSY */
#define _MSC_STATUS_BUSY_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for MSC_STATUS */
#define MSC_STATUS_BUSY_DEFAULT                  (_MSC_STATUS_BUSY_DEFAULT << 0)         /**< Shifted mode DEFAULT for MSC_STATUS */
#define MSC_STATUS_LOCKED                        (0x1UL << 1)                            /**< Access Locked */
#define _MSC_STATUS_LOCKED_SHIFT                 1                                       /**< Shift value for MSC_LOCKED */
#define _MSC_STATUS_LOCKED_MASK                  0x2UL                                   /**< Bit mask for MSC_LOCKED */
#define _MSC_STATUS_LOCKED_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for MSC_STATUS */
#define MSC_STATUS_LOCKED_DEFAULT                (_MSC_STATUS_LOCKED_DEFAULT << 1)       /**< Shifted mode DEFAULT for MSC_STATUS */
#define MSC_STATUS_INVADDR                       (0x1UL << 2)                            /**< Invalid Write Address or Erase Page */
#define _MSC_STATUS_INVADDR_SHIFT                2                                       /**< Shift value for MSC_INVADDR */
#define _MSC_STATUS_INVADDR_MASK                 0x4UL                                   /**< Bit mask for MSC_INVADDR */
#define _MSC_STATUS_INVADDR_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for MSC_STATUS */
#define MSC_STATUS_INVADDR_DEFAULT               (_MSC_STATUS_INVADDR_DEFAULT << 2)      /**< Shifted mode DEFAULT for MSC_STATUS */
#define MSC_STATUS_WDATAREADY                    (0x1UL << 3)                            /**< WDATA Write Ready */
#define _MSC_STATUS_WDATAREADY_SHIFT             3                                       /**< Shift value for MSC_WDATAREADY */
#define _MSC_STATUS_WDATAREADY_MASK              0x8UL                                   /**< Bit mask for MSC_WDATAREADY */
#define _MSC_STATUS_WDATAREADY_DEFAULT           0x00000001UL                            /**< Mode DEFAULT for MSC_STATUS */
#define MSC_STATUS_WDATAREADY_DEFAULT            (_MSC_STATUS_WDATAREADY_DEFAULT << 3)   /**< Shifted mode DEFAULT for MSC_STATUS */
#define MSC_STATUS_WORDTIMEOUT                   (0x1UL << 4)                            /**< Flash Write Word Timeout */
#define _MSC_STATUS_WORDTIMEOUT_SHIFT            4                                       /**< Shift value for MSC_WORDTIMEOUT */
#define _MSC_STATUS_WORDTIMEOUT_MASK             0x10UL                                  /**< Bit mask for MSC_WORDTIMEOUT */
#define _MSC_STATUS_WORDTIMEOUT_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for MSC_STATUS */
#define MSC_STATUS_WORDTIMEOUT_DEFAULT           (_MSC_STATUS_WORDTIMEOUT_DEFAULT << 4)  /**< Shifted mode DEFAULT for MSC_STATUS */
#define MSC_STATUS_ERASEABORTED                  (0x1UL << 5)                            /**< The Current Flash Erase Operation Aborted */
#define _MSC_STATUS_ERASEABORTED_SHIFT           5                                       /**< Shift value for MSC_ERASEABORTED */
#define _MSC_STATUS_ERASEABORTED_MASK            0x20UL                                  /**< Bit mask for MSC_ERASEABORTED */
#define _MSC_STATUS_ERASEABORTED_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for MSC_STATUS */
#define MSC_STATUS_ERASEABORTED_DEFAULT          (_MSC_STATUS_ERASEABORTED_DEFAULT << 5) /**< Shifted mode DEFAULT for MSC_STATUS */
#define MSC_STATUS_PCRUNNING                     (0x1UL << 6)                            /**< Performance Counters Running */
#define _MSC_STATUS_PCRUNNING_SHIFT              6                                       /**< Shift value for MSC_PCRUNNING */
#define _MSC_STATUS_PCRUNNING_MASK               0x40UL                                  /**< Bit mask for MSC_PCRUNNING */
#define _MSC_STATUS_PCRUNNING_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for MSC_STATUS */
#define MSC_STATUS_PCRUNNING_DEFAULT             (_MSC_STATUS_PCRUNNING_DEFAULT << 6)    /**< Shifted mode DEFAULT for MSC_STATUS */

/* Bit fields for MSC MEMFEATURE */
#define _MSC_MEMFEATURE_RESETVALUE               0x0000000AUL                                  /**< Default value for MSC_MEMFEATURE */
#define _MSC_MEMFEATURE_MASK                     0x0102000FUL                                  /**< Mask for MSC_MEMFEATURE */
#define _MSC_MEMFEATURE_FLASHSIZE_SHIFT          0                                             /**< Shift value for MSC_FLASHSIZE */
#define _MSC_MEMFEATURE_FLASHSIZE_MASK           0xFUL                                         /**< Bit mask for MSC_FLASHSIZE */
#define _MSC_MEMFEATURE_FLASHSIZE_4K             0x00000002UL                                  /**< Mode 4K for MSC_MEMFEATURE */
#define _MSC_MEMFEATURE_FLASHSIZE_8K             0x00000003UL                                  /**< Mode 8K for MSC_MEMFEATURE */
#define _MSC_MEMFEATURE_FLASHSIZE_16K            0x00000004UL                                  /**< Mode 16K for MSC_MEMFEATURE */
#define _MSC_MEMFEATURE_FLASHSIZE_32K            0x00000005UL                                  /**< Mode 32K for MSC_MEMFEATURE */
#define _MSC_MEMFEATURE_FLASHSIZE_64K            0x00000006UL                                  /**< Mode 64K for MSC_MEMFEATURE */
#define _MSC_MEMFEATURE_FLASHSIZE_128K           0x00000007UL                                  /**< Mode 128K for MSC_MEMFEATURE */
#define _MSC_MEMFEATURE_FLASHSIZE_256K           0x00000008UL                                  /**< Mode 256K for MSC_MEMFEATURE */
#define _MSC_MEMFEATURE_FLASHSIZE_512K           0x00000009UL                                  /**< Mode 512K for MSC_MEMFEATURE */
#define _MSC_MEMFEATURE_FLASHSIZE_DEFAULT        0x0000000AUL                                  /**< Mode DEFAULT for MSC_MEMFEATURE */
#define _MSC_MEMFEATURE_FLASHSIZE_1024K          0x0000000AUL                                  /**< Mode 1024K for MSC_MEMFEATURE */
#define MSC_MEMFEATURE_FLASHSIZE_4K              (_MSC_MEMFEATURE_FLASHSIZE_4K << 0)           /**< Shifted mode 4K for MSC_MEMFEATURE */
#define MSC_MEMFEATURE_FLASHSIZE_8K              (_MSC_MEMFEATURE_FLASHSIZE_8K << 0)           /**< Shifted mode 8K for MSC_MEMFEATURE */
#define MSC_MEMFEATURE_FLASHSIZE_16K             (_MSC_MEMFEATURE_FLASHSIZE_16K << 0)          /**< Shifted mode 16K for MSC_MEMFEATURE */
#define MSC_MEMFEATURE_FLASHSIZE_32K             (_MSC_MEMFEATURE_FLASHSIZE_32K << 0)          /**< Shifted mode 32K for MSC_MEMFEATURE */
#define MSC_MEMFEATURE_FLASHSIZE_64K             (_MSC_MEMFEATURE_FLASHSIZE_64K << 0)          /**< Shifted mode 64K for MSC_MEMFEATURE */
#define MSC_MEMFEATURE_FLASHSIZE_128K            (_MSC_MEMFEATURE_FLASHSIZE_128K << 0)         /**< Shifted mode 128K for MSC_MEMFEATURE */
#define MSC_MEMFEATURE_FLASHSIZE_256K            (_MSC_MEMFEATURE_FLASHSIZE_256K << 0)         /**< Shifted mode 256K for MSC_MEMFEATURE */
#define MSC_MEMFEATURE_FLASHSIZE_512K            (_MSC_MEMFEATURE_FLASHSIZE_512K << 0)         /**< Shifted mode 512K for MSC_MEMFEATURE */
#define MSC_MEMFEATURE_FLASHSIZE_DEFAULT         (_MSC_MEMFEATURE_FLASHSIZE_DEFAULT << 0)      /**< Shifted mode DEFAULT for MSC_MEMFEATURE */
#define MSC_MEMFEATURE_FLASHSIZE_1024K           (_MSC_MEMFEATURE_FLASHSIZE_1024K << 0)        /**< Shifted mode 1024K for MSC_MEMFEATURE */
#define MSC_MEMFEATURE_CACHERAMIFDIS             (0x1UL << 17)                                 /**< Cache RAM Interface Disable */
#define _MSC_MEMFEATURE_CACHERAMIFDIS_SHIFT      17                                            /**< Shift value for MSC_CACHERAMIFDIS */
#define _MSC_MEMFEATURE_CACHERAMIFDIS_MASK       0x20000UL                                     /**< Bit mask for MSC_CACHERAMIFDIS */
#define _MSC_MEMFEATURE_CACHERAMIFDIS_DEFAULT    0x00000000UL                                  /**< Mode DEFAULT for MSC_MEMFEATURE */
#define MSC_MEMFEATURE_CACHERAMIFDIS_DEFAULT     (_MSC_MEMFEATURE_CACHERAMIFDIS_DEFAULT << 17) /**< Shifted mode DEFAULT for MSC_MEMFEATURE */
#define MSC_MEMFEATURE_USEUPPERHALF              (0x1UL << 24)                                 /**< Use upper half of flash */
#define _MSC_MEMFEATURE_USEUPPERHALF_SHIFT       24                                            /**< Shift value for MSC_USEUPPERHALF */
#define _MSC_MEMFEATURE_USEUPPERHALF_MASK        0x1000000UL                                   /**< Bit mask for MSC_USEUPPERHALF */
#define _MSC_MEMFEATURE_USEUPPERHALF_DEFAULT     0x00000000UL                                  /**< Mode DEFAULT for MSC_MEMFEATURE */
#define MSC_MEMFEATURE_USEUPPERHALF_DEFAULT      (_MSC_MEMFEATURE_USEUPPERHALF_DEFAULT << 24)  /**< Shifted mode DEFAULT for MSC_MEMFEATURE */

