stevew817/DAPLink/source/common/cmsis-core/siliconlabs/efm32hg/efm32hgfull.h
/* Bit fields for MSC CACHEHITS */
#define _MSC_CACHEHITS_RESETVALUE                0x00000000UL                            /**< Default value for MSC_CACHEHITS */
#define _MSC_CACHEHITS_MASK                      0x000FFFFFUL                            /**< Mask for MSC_CACHEHITS */
#define _MSC_CACHEHITS_CACHEHITS_SHIFT           0                                       /**< Shift value for MSC_CACHEHITS */
#define _MSC_CACHEHITS_CACHEHITS_MASK            0xFFFFFUL                               /**< Bit mask for MSC_CACHEHITS */
#define _MSC_CACHEHITS_CACHEHITS_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for MSC_CACHEHITS */
#define MSC_CACHEHITS_CACHEHITS_DEFAULT          (_MSC_CACHEHITS_CACHEHITS_DEFAULT << 0) /**< Shifted mode DEFAULT for MSC_CACHEHITS */

/* Bit fields for MSC CACHEMISSES */
#define _MSC_CACHEMISSES_RESETVALUE              0x00000000UL                                /**< Default value for MSC_CACHEMISSES */
#define _MSC_CACHEMISSES_MASK                    0x000FFFFFUL                                /**< Mask for MSC_CACHEMISSES */
#define _MSC_CACHEMISSES_CACHEMISSES_SHIFT       0                                           /**< Shift value for MSC_CACHEMISSES */
#define _MSC_CACHEMISSES_CACHEMISSES_MASK        0xFFFFFUL                                   /**< Bit mask for MSC_CACHEMISSES */
#define _MSC_CACHEMISSES_CACHEMISSES_DEFAULT     0x00000000UL                                /**< Mode DEFAULT for MSC_CACHEMISSES */
#define MSC_CACHEMISSES_CACHEMISSES_DEFAULT      (_MSC_CACHEMISSES_CACHEMISSES_DEFAULT << 0) /**< Shifted mode DEFAULT for MSC_CACHEMISSES */

/* Bit fields for MSC TIMEBASE */
#define _MSC_TIMEBASE_RESETVALUE                 0x00000010UL                         /**< Default value for MSC_TIMEBASE */
#define _MSC_TIMEBASE_MASK                       0x0001003FUL                         /**< Mask for MSC_TIMEBASE */
#define _MSC_TIMEBASE_BASE_SHIFT                 0                                    /**< Shift value for MSC_BASE */
#define _MSC_TIMEBASE_BASE_MASK                  0x3FUL                               /**< Bit mask for MSC_BASE */
#define _MSC_TIMEBASE_BASE_DEFAULT               0x00000010UL                         /**< Mode DEFAULT for MSC_TIMEBASE */
#define MSC_TIMEBASE_BASE_DEFAULT                (_MSC_TIMEBASE_BASE_DEFAULT << 0)    /**< Shifted mode DEFAULT for MSC_TIMEBASE */
#define MSC_TIMEBASE_PERIOD                      (0x1UL << 16)                        /**< Sets the timebase period */
#define _MSC_TIMEBASE_PERIOD_SHIFT               16                                   /**< Shift value for MSC_PERIOD */
#define _MSC_TIMEBASE_PERIOD_MASK                0x10000UL                            /**< Bit mask for MSC_PERIOD */
#define _MSC_TIMEBASE_PERIOD_DEFAULT             0x00000000UL                         /**< Mode DEFAULT for MSC_TIMEBASE */
#define _MSC_TIMEBASE_PERIOD_1US                 0x00000000UL                         /**< Mode 1US for MSC_TIMEBASE */
#define _MSC_TIMEBASE_PERIOD_5US                 0x00000001UL                         /**< Mode 5US for MSC_TIMEBASE */
#define MSC_TIMEBASE_PERIOD_DEFAULT              (_MSC_TIMEBASE_PERIOD_DEFAULT << 16) /**< Shifted mode DEFAULT for MSC_TIMEBASE */
#define MSC_TIMEBASE_PERIOD_1US                  (_MSC_TIMEBASE_PERIOD_1US << 16)     /**< Shifted mode 1US for MSC_TIMEBASE */
#define MSC_TIMEBASE_PERIOD_5US                  (_MSC_TIMEBASE_PERIOD_5US << 16)     /**< Shifted mode 5US for MSC_TIMEBASE */

/* Bit fields for MSC MASSLOCK */
#define _MSC_MASSLOCK_RESETVALUE                 0x00000001UL                          /**< Default value for MSC_MASSLOCK */
#define _MSC_MASSLOCK_MASK                       0x0000FFFFUL                          /**< Mask for MSC_MASSLOCK */
#define _MSC_MASSLOCK_LOCKKEY_SHIFT              0                                     /**< Shift value for MSC_LOCKKEY */
#define _MSC_MASSLOCK_LOCKKEY_MASK               0xFFFFUL                              /**< Bit mask for MSC_LOCKKEY */
#define _MSC_MASSLOCK_LOCKKEY_LOCK               0x00000000UL                          /**< Mode LOCK for MSC_MASSLOCK */
#define _MSC_MASSLOCK_LOCKKEY_UNLOCKED           0x00000000UL                          /**< Mode UNLOCKED for MSC_MASSLOCK */
#define _MSC_MASSLOCK_LOCKKEY_DEFAULT            0x00000001UL                          /**< Mode DEFAULT for MSC_MASSLOCK */
#define _MSC_MASSLOCK_LOCKKEY_LOCKED             0x00000001UL                          /**< Mode LOCKED for MSC_MASSLOCK */
#define _MSC_MASSLOCK_LOCKKEY_UNLOCK             0x0000631AUL                          /**< Mode UNLOCK for MSC_MASSLOCK */
#define MSC_MASSLOCK_LOCKKEY_LOCK                (_MSC_MASSLOCK_LOCKKEY_LOCK << 0)     /**< Shifted mode LOCK for MSC_MASSLOCK */
#define MSC_MASSLOCK_LOCKKEY_UNLOCKED            (_MSC_MASSLOCK_LOCKKEY_UNLOCKED << 0) /**< Shifted mode UNLOCKED for MSC_MASSLOCK */
#define MSC_MASSLOCK_LOCKKEY_DEFAULT             (_MSC_MASSLOCK_LOCKKEY_DEFAULT << 0)  /**< Shifted mode DEFAULT for MSC_MASSLOCK */
#define MSC_MASSLOCK_LOCKKEY_LOCKED              (_MSC_MASSLOCK_LOCKKEY_LOCKED << 0)   /**< Shifted mode LOCKED for MSC_MASSLOCK */
#define MSC_MASSLOCK_LOCKKEY_UNLOCK              (_MSC_MASSLOCK_LOCKKEY_UNLOCK << 0)   /**< Shifted mode UNLOCK for MSC_MASSLOCK */

/* Bit fields for MSC IRQLATENCY */
#define _MSC_IRQLATENCY_RESETVALUE               0x00000000UL                              /**< Default value for MSC_IRQLATENCY */
#define _MSC_IRQLATENCY_MASK                     0x000000FFUL                              /**< Mask for MSC_IRQLATENCY */
#define _MSC_IRQLATENCY_IRQLATENCY_SHIFT         0                                         /**< Shift value for MSC_IRQLATENCY */
#define _MSC_IRQLATENCY_IRQLATENCY_MASK          0xFFUL                                    /**< Bit mask for MSC_IRQLATENCY */
#define _MSC_IRQLATENCY_IRQLATENCY_DEFAULT       0x00000000UL                              /**< Mode DEFAULT for MSC_IRQLATENCY */
#define MSC_IRQLATENCY_IRQLATENCY_DEFAULT        (_MSC_IRQLATENCY_IRQLATENCY_DEFAULT << 0) /**< Shifted mode DEFAULT for MSC_IRQLATENCY */

/* Bit fields for MSC TEST */
#define _MSC_TEST_RESETVALUE                     0x00000000UL                 /**< Default value for MSC_TEST */
#define _MSC_TEST_MASK                           0x00000001UL                 /**< Mask for MSC_TEST */
#define MSC_TEST_LVE                             (0x1UL << 0)                 /**< Flash Low-Voltage Enable */
#define _MSC_TEST_LVE_SHIFT                      0                            /**< Shift value for MSC_LVE */
#define _MSC_TEST_LVE_MASK                       0x1UL                        /**< Bit mask for MSC_LVE */
#define _MSC_TEST_LVE_DEFAULT                    0x00000000UL                 /**< Mode DEFAULT for MSC_TEST */
#define MSC_TEST_LVE_DEFAULT                     (_MSC_TEST_LVE_DEFAULT << 0) /**< Shifted mode DEFAULT for MSC_TEST */

/* Bit fields for MSC CACHE_DATA */
#define _MSC_CACHE_DATA_RESETVALUE               0x00000000UL                        /**< Default value for MSC_CACHE_DATA */
#define _MSC_CACHE_DATA_MASK                     0xFFFFFFFFUL                        /**< Mask for MSC_CACHE_DATA */
#define _MSC_CACHE_DATA_DATA_SHIFT               0                                   /**< Shift value for MSC_DATA */
#define _MSC_CACHE_DATA_DATA_MASK                0xFFFFFFFFUL                        /**< Bit mask for MSC_DATA */
#define _MSC_CACHE_DATA_DATA_DEFAULT             0x00000000UL                        /**< Mode DEFAULT for MSC_CACHE_DATA */
#define MSC_CACHE_DATA_DATA_DEFAULT              (_MSC_CACHE_DATA_DATA_DEFAULT << 0) /**< Shifted mode DEFAULT for MSC_CACHE_DATA */

/** @} End of group EFM32HGFULL_MSC */

/**************************************************************************//**
 * @defgroup EFM32HGFULL_EMU_BitFields  EFM32HGFULL_EMU Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for EMU CTRL */
#define _EMU_CTRL_RESETVALUE                                0x00000000UL                        /**< Default value for EMU_CTRL */
#define _EMU_CTRL_MASK                                      0x000001BFUL                        /**< Mask for EMU_CTRL */
#define EMU_CTRL_EMVREG                                     (0x1UL << 0)                        /**< Energy Mode Voltage Regulator Control */
#define _EMU_CTRL_EMVREG_SHIFT                              0                                   /**< Shift value for EMU_EMVREG */
#define _EMU_CTRL_EMVREG_MASK                               0x1UL                               /**< Bit mask for EMU_EMVREG */
#define _EMU_CTRL_EMVREG_DEFAULT                            0x00000000UL                        /**< Mode DEFAULT for EMU_CTRL */
#define _EMU_CTRL_EMVREG_REDUCED                            0x00000000UL                        /**< Mode REDUCED for EMU_CTRL */
#define _EMU_CTRL_EMVREG_FULL                               0x00000001UL                        /**< Mode FULL for EMU_CTRL */
#define EMU_CTRL_EMVREG_DEFAULT                             (_EMU_CTRL_EMVREG_DEFAULT << 0)     /**< Shifted mode DEFAULT for EMU_CTRL */
#define EMU_CTRL_EMVREG_REDUCED                             (_EMU_CTRL_EMVREG_REDUCED << 0)     /**< Shifted mode REDUCED for EMU_CTRL */
#define EMU_CTRL_EMVREG_FULL                                (_EMU_CTRL_EMVREG_FULL << 0)        /**< Shifted mode FULL for EMU_CTRL */
#define EMU_CTRL_EM2BLOCK                                   (0x1UL << 1)                        /**< Energy Mode 2 Block */
#define _EMU_CTRL_EM2BLOCK_SHIFT                            1                                   /**< Shift value for EMU_EM2BLOCK */
#define _EMU_CTRL_EM2BLOCK_MASK                             0x2UL                               /**< Bit mask for EMU_EM2BLOCK */
#define _EMU_CTRL_EM2BLOCK_DEFAULT                          0x00000000UL                        /**< Mode DEFAULT for EMU_CTRL */
#define EMU_CTRL_EM2BLOCK_DEFAULT                           (_EMU_CTRL_EM2BLOCK_DEFAULT << 1)   /**< Shifted mode DEFAULT for EMU_CTRL */
#define _EMU_CTRL_EM4CTRL_SHIFT                             2                                   /**< Shift value for EMU_EM4CTRL */
#define _EMU_CTRL_EM4CTRL_MASK                              0xCUL                               /**< Bit mask for EMU_EM4CTRL */
#define _EMU_CTRL_EM4CTRL_DEFAULT                           0x00000000UL                        /**< Mode DEFAULT for EMU_CTRL */
#define EMU_CTRL_EM4CTRL_DEFAULT                            (_EMU_CTRL_EM4CTRL_DEFAULT << 2)    /**< Shifted mode DEFAULT for EMU_CTRL */
#define _EMU_CTRL_REGDISCTRL_SHIFT                          4                                   /**< Shift value for EMU_REGDISCTRL */
#define _EMU_CTRL_REGDISCTRL_MASK                           0x30UL                              /**< Bit mask for EMU_REGDISCTRL */
#define _EMU_CTRL_REGDISCTRL_DEFAULT                        0x00000000UL                        /**< Mode DEFAULT for EMU_CTRL */
#define EMU_CTRL_REGDISCTRL_DEFAULT                         (_EMU_CTRL_REGDISCTRL_DEFAULT << 4) /**< Shifted mode DEFAULT for EMU_CTRL */
#define EMU_CTRL_LDRAINDIS                                  (0x1UL << 7)                        /**< Set to disable low drain regulator */
#define _EMU_CTRL_LDRAINDIS_SHIFT                           7                                   /**< Shift value for EMU_LDRAINDIS */
#define _EMU_CTRL_LDRAINDIS_MASK                            0x80UL                              /**< Bit mask for EMU_LDRAINDIS */
#define _EMU_CTRL_LDRAINDIS_DEFAULT                         0x00000000UL                        /**< Mode DEFAULT for EMU_CTRL */
#define EMU_CTRL_LDRAINDIS_DEFAULT                          (_EMU_CTRL_LDRAINDIS_DEFAULT << 7)  /**< Shifted mode DEFAULT for EMU_CTRL */
#define EMU_CTRL_HDRAINDIS                                  (0x1UL << 8)                        /**< Set to disable high drain regulator */
#define _EMU_CTRL_HDRAINDIS_SHIFT                           8                                   /**< Shift value for EMU_HDRAINDIS */
#define _EMU_CTRL_HDRAINDIS_MASK                            0x100UL                             /**< Bit mask for EMU_HDRAINDIS */
#define _EMU_CTRL_HDRAINDIS_DEFAULT                         0x00000000UL                        /**< Mode DEFAULT for EMU_CTRL */
#define EMU_CTRL_HDRAINDIS_DEFAULT                          (_EMU_CTRL_HDRAINDIS_DEFAULT << 8)  /**< Shifted mode DEFAULT for EMU_CTRL */

