stevew817/DAPLink/source/common/cmsis-core/siliconlabs/efm32hg/efm32hgfull.h
/* Bit fields for EMU LOCK */
#define _EMU_LOCK_RESETVALUE                                0x00000000UL                      /**< Default value for EMU_LOCK */
#define _EMU_LOCK_MASK                                      0x0000FFFFUL                      /**< Mask for EMU_LOCK */
#define _EMU_LOCK_LOCKKEY_SHIFT                             0                                 /**< Shift value for EMU_LOCKKEY */
#define _EMU_LOCK_LOCKKEY_MASK                              0xFFFFUL                          /**< Bit mask for EMU_LOCKKEY */
#define _EMU_LOCK_LOCKKEY_DEFAULT                           0x00000000UL                      /**< Mode DEFAULT for EMU_LOCK */
#define _EMU_LOCK_LOCKKEY_LOCK                              0x00000000UL                      /**< Mode LOCK for EMU_LOCK */
#define _EMU_LOCK_LOCKKEY_UNLOCKED                          0x00000000UL                      /**< Mode UNLOCKED for EMU_LOCK */
#define _EMU_LOCK_LOCKKEY_LOCKED                            0x00000001UL                      /**< Mode LOCKED for EMU_LOCK */
#define _EMU_LOCK_LOCKKEY_UNLOCK                            0x0000ADE8UL                      /**< Mode UNLOCK for EMU_LOCK */
#define EMU_LOCK_LOCKKEY_DEFAULT                            (_EMU_LOCK_LOCKKEY_DEFAULT << 0)  /**< Shifted mode DEFAULT for EMU_LOCK */
#define EMU_LOCK_LOCKKEY_LOCK                               (_EMU_LOCK_LOCKKEY_LOCK << 0)     /**< Shifted mode LOCK for EMU_LOCK */
#define EMU_LOCK_LOCKKEY_UNLOCKED                           (_EMU_LOCK_LOCKKEY_UNLOCKED << 0) /**< Shifted mode UNLOCKED for EMU_LOCK */
#define EMU_LOCK_LOCKKEY_LOCKED                             (_EMU_LOCK_LOCKKEY_LOCKED << 0)   /**< Shifted mode LOCKED for EMU_LOCK */
#define EMU_LOCK_LOCKKEY_UNLOCK                             (_EMU_LOCK_LOCKKEY_UNLOCK << 0)   /**< Shifted mode UNLOCK for EMU_LOCK */

/* Bit fields for EMU BIASCONF */
#define _EMU_BIASCONF_RESETVALUE                            0x00020102UL                                         /**< Default value for EMU_BIASCONF */
#define _EMU_BIASCONF_MASK                                  0x00030303UL                                         /**< Mask for EMU_BIASCONF */
#define EMU_BIASCONF_BIAS_LOW_POW_REF_EN_EM0                (0x1UL << 0)                                         /**< The Setting of low_power_reference when emu_vreg_en is 1 */
#define _EMU_BIASCONF_BIAS_LOW_POW_REF_EN_EM0_SHIFT         0                                                    /**< Shift value for EMU_BIAS_LOW_POW_REF_EN_EM0 */
#define _EMU_BIASCONF_BIAS_LOW_POW_REF_EN_EM0_MASK          0x1UL                                                /**< Bit mask for EMU_BIAS_LOW_POW_REF_EN_EM0 */
#define _EMU_BIASCONF_BIAS_LOW_POW_REF_EN_EM0_DEFAULT       0x00000000UL                                         /**< Mode DEFAULT for EMU_BIASCONF */
#define EMU_BIASCONF_BIAS_LOW_POW_REF_EN_EM0_DEFAULT        (_EMU_BIASCONF_BIAS_LOW_POW_REF_EN_EM0_DEFAULT << 0) /**< Shifted mode DEFAULT for EMU_BIASCONF */
#define EMU_BIASCONF_BIAS_LOW_POW_REF_EN_EM2                (0x1UL << 1)                                         /**< The setting of low_power_reference when emu_vreg_en is 0 */
#define _EMU_BIASCONF_BIAS_LOW_POW_REF_EN_EM2_SHIFT         1                                                    /**< Shift value for EMU_BIAS_LOW_POW_REF_EN_EM2 */
#define _EMU_BIASCONF_BIAS_LOW_POW_REF_EN_EM2_MASK          0x2UL                                                /**< Bit mask for EMU_BIAS_LOW_POW_REF_EN_EM2 */
#define _EMU_BIASCONF_BIAS_LOW_POW_REF_EN_EM2_DEFAULT       0x00000001UL                                         /**< Mode DEFAULT for EMU_BIASCONF */
#define EMU_BIASCONF_BIAS_LOW_POW_REF_EN_EM2_DEFAULT        (_EMU_BIASCONF_BIAS_LOW_POW_REF_EN_EM2_DEFAULT << 1) /**< Shifted mode DEFAULT for EMU_BIASCONF */
#define EMU_BIASCONF_BIAS_HIGH_ACC_EN_EM0                   (0x1UL << 8)                                         /**< The setting of high_accuracy_en when emu_vreg_en is 1 */
#define _EMU_BIASCONF_BIAS_HIGH_ACC_EN_EM0_SHIFT            8                                                    /**< Shift value for EMU_BIAS_HIGH_ACC_EN_EM0 */
#define _EMU_BIASCONF_BIAS_HIGH_ACC_EN_EM0_MASK             0x100UL                                              /**< Bit mask for EMU_BIAS_HIGH_ACC_EN_EM0 */
#define _EMU_BIASCONF_BIAS_HIGH_ACC_EN_EM0_DEFAULT          0x00000001UL                                         /**< Mode DEFAULT for EMU_BIASCONF */
#define EMU_BIASCONF_BIAS_HIGH_ACC_EN_EM0_DEFAULT           (_EMU_BIASCONF_BIAS_HIGH_ACC_EN_EM0_DEFAULT << 8)    /**< Shifted mode DEFAULT for EMU_BIASCONF */
#define EMU_BIASCONF_BIAS_HIGH_ACC_EN_EM2                   (0x1UL << 9)                                         /**< The setting of high_accuracy_en when emu_vreg_en is 0 */
#define _EMU_BIASCONF_BIAS_HIGH_ACC_EN_EM2_SHIFT            9                                                    /**< Shift value for EMU_BIAS_HIGH_ACC_EN_EM2 */
#define _EMU_BIASCONF_BIAS_HIGH_ACC_EN_EM2_MASK             0x200UL                                              /**< Bit mask for EMU_BIAS_HIGH_ACC_EN_EM2 */
#define _EMU_BIASCONF_BIAS_HIGH_ACC_EN_EM2_DEFAULT          0x00000000UL                                         /**< Mode DEFAULT for EMU_BIASCONF */
#define EMU_BIASCONF_BIAS_HIGH_ACC_EN_EM2_DEFAULT           (_EMU_BIASCONF_BIAS_HIGH_ACC_EN_EM2_DEFAULT << 9)    /**< Shifted mode DEFAULT for EMU_BIASCONF */
#define EMU_BIASCONF_BIAS_DUTY_EN_EM0                       (0x1UL << 16)                                        /**< The setting of emu_bias_duty when emu_vreg_en is 1 */
#define _EMU_BIASCONF_BIAS_DUTY_EN_EM0_SHIFT                16                                                   /**< Shift value for EMU_BIAS_DUTY_EN_EM0 */
#define _EMU_BIASCONF_BIAS_DUTY_EN_EM0_MASK                 0x10000UL                                            /**< Bit mask for EMU_BIAS_DUTY_EN_EM0 */
#define _EMU_BIASCONF_BIAS_DUTY_EN_EM0_DEFAULT              0x00000000UL                                         /**< Mode DEFAULT for EMU_BIASCONF */
#define EMU_BIASCONF_BIAS_DUTY_EN_EM0_DEFAULT               (_EMU_BIASCONF_BIAS_DUTY_EN_EM0_DEFAULT << 16)       /**< Shifted mode DEFAULT for EMU_BIASCONF */
#define EMU_BIASCONF_BIAS_DUTY_EN_EM2                       (0x1UL << 17)                                        /**< The setting of emu_bias_duty when emu_vreg_en is 0 */
#define _EMU_BIASCONF_BIAS_DUTY_EN_EM2_SHIFT                17                                                   /**< Shift value for EMU_BIAS_DUTY_EN_EM2 */
#define _EMU_BIASCONF_BIAS_DUTY_EN_EM2_MASK                 0x20000UL                                            /**< Bit mask for EMU_BIAS_DUTY_EN_EM2 */
#define _EMU_BIASCONF_BIAS_DUTY_EN_EM2_DEFAULT              0x00000001UL                                         /**< Mode DEFAULT for EMU_BIASCONF */
#define EMU_BIASCONF_BIAS_DUTY_EN_EM2_DEFAULT               (_EMU_BIASCONF_BIAS_DUTY_EN_EM2_DEFAULT << 17)       /**< Shifted mode DEFAULT for EMU_BIASCONF */

/* Bit fields for EMU BIASSTATUS */
#define _EMU_BIASSTATUS_RESETVALUE                          0x00000000UL                                        /**< Default value for EMU_BIASSTATUS */
#define _EMU_BIASSTATUS_MASK                                0x00000007UL                                        /**< Mask for EMU_BIASSTATUS */
#define EMU_BIASSTATUS_BIAS_LOW_POW_REF_ACK                 (0x1UL << 0)                                        /**< Acknowledge bit of the low_power_reference */
#define _EMU_BIASSTATUS_BIAS_LOW_POW_REF_ACK_SHIFT          0                                                   /**< Shift value for EMU_BIAS_LOW_POW_REF_ACK */
#define _EMU_BIASSTATUS_BIAS_LOW_POW_REF_ACK_MASK           0x1UL                                               /**< Bit mask for EMU_BIAS_LOW_POW_REF_ACK */
#define _EMU_BIASSTATUS_BIAS_LOW_POW_REF_ACK_DEFAULT        0x00000000UL                                        /**< Mode DEFAULT for EMU_BIASSTATUS */
#define EMU_BIASSTATUS_BIAS_LOW_POW_REF_ACK_DEFAULT         (_EMU_BIASSTATUS_BIAS_LOW_POW_REF_ACK_DEFAULT << 0) /**< Shifted mode DEFAULT for EMU_BIASSTATUS */
#define EMU_BIASSTATUS_BIAS_HIGH_ACC_ACK                    (0x1UL << 1)                                        /**< Acknowledge bit of the high_accuracy */
#define _EMU_BIASSTATUS_BIAS_HIGH_ACC_ACK_SHIFT             1                                                   /**< Shift value for EMU_BIAS_HIGH_ACC_ACK */
#define _EMU_BIASSTATUS_BIAS_HIGH_ACC_ACK_MASK              0x2UL                                               /**< Bit mask for EMU_BIAS_HIGH_ACC_ACK */
#define _EMU_BIASSTATUS_BIAS_HIGH_ACC_ACK_DEFAULT           0x00000000UL                                        /**< Mode DEFAULT for EMU_BIASSTATUS */
#define EMU_BIASSTATUS_BIAS_HIGH_ACC_ACK_DEFAULT            (_EMU_BIASSTATUS_BIAS_HIGH_ACC_ACK_DEFAULT << 1)    /**< Shifted mode DEFAULT for EMU_BIASSTATUS */
#define EMU_BIASSTATUS_BIAS_DUTY_EN_ACK                     (0x1UL << 2)                                        /**< Acknowledge bit of the bias_duty */
#define _EMU_BIASSTATUS_BIAS_DUTY_EN_ACK_SHIFT              2                                                   /**< Shift value for EMU_BIAS_DUTY_EN_ACK */
#define _EMU_BIASSTATUS_BIAS_DUTY_EN_ACK_MASK               0x4UL                                               /**< Bit mask for EMU_BIAS_DUTY_EN_ACK */
#define _EMU_BIASSTATUS_BIAS_DUTY_EN_ACK_DEFAULT            0x00000000UL                                        /**< Mode DEFAULT for EMU_BIASSTATUS */
#define EMU_BIASSTATUS_BIAS_DUTY_EN_ACK_DEFAULT             (_EMU_BIASSTATUS_BIAS_DUTY_EN_ACK_DEFAULT << 2)     /**< Shifted mode DEFAULT for EMU_BIASSTATUS */

