stevew817/DAPLink/source/common/cmsis-core/siliconlabs/efm32hg/efm32hgfull.h
/* Bit fields for EMU AUXCTRL */
#define _EMU_AUXCTRL_RESETVALUE                             0x00000000UL                       /**< Default value for EMU_AUXCTRL */
#define _EMU_AUXCTRL_MASK                                   0x00000001UL                       /**< Mask for EMU_AUXCTRL */
#define EMU_AUXCTRL_HRCCLR                                  (0x1UL << 0)                       /**< Hard Reset Cause Clear */
#define _EMU_AUXCTRL_HRCCLR_SHIFT                           0                                  /**< Shift value for EMU_HRCCLR */
#define _EMU_AUXCTRL_HRCCLR_MASK                            0x1UL                              /**< Bit mask for EMU_HRCCLR */
#define _EMU_AUXCTRL_HRCCLR_DEFAULT                         0x00000000UL                       /**< Mode DEFAULT for EMU_AUXCTRL */
#define EMU_AUXCTRL_HRCCLR_DEFAULT                          (_EMU_AUXCTRL_HRCCLR_DEFAULT << 0) /**< Shifted mode DEFAULT for EMU_AUXCTRL */

/* Bit fields for EMU MEMFEATURE */
#define _EMU_MEMFEATURE_RESETVALUE                          0x00000000UL                           /**< Default value for EMU_MEMFEATURE */
#define _EMU_MEMFEATURE_MASK                                0x00000300UL                           /**< Mask for EMU_MEMFEATURE */
#define _EMU_MEMFEATURE_RAM0DIV_SHIFT                       8                                      /**< Shift value for EMU_RAM0DIV */
#define _EMU_MEMFEATURE_RAM0DIV_MASK                        0x300UL                                /**< Bit mask for EMU_RAM0DIV */
#define _EMU_MEMFEATURE_RAM0DIV_DEFAULT                     0x00000000UL                           /**< Mode DEFAULT for EMU_MEMFEATURE */
#define _EMU_MEMFEATURE_RAM0DIV_DIV1                        0x00000000UL                           /**< Mode DIV1 for EMU_MEMFEATURE */
#define _EMU_MEMFEATURE_RAM0DIV_DIV2                        0x00000001UL                           /**< Mode DIV2 for EMU_MEMFEATURE */
#define _EMU_MEMFEATURE_RAM0DIV_DIV4                        0x00000002UL                           /**< Mode DIV4 for EMU_MEMFEATURE */
#define _EMU_MEMFEATURE_RAM0DIV_DIV8                        0x00000003UL                           /**< Mode DIV8 for EMU_MEMFEATURE */
#define EMU_MEMFEATURE_RAM0DIV_DEFAULT                      (_EMU_MEMFEATURE_RAM0DIV_DEFAULT << 8) /**< Shifted mode DEFAULT for EMU_MEMFEATURE */
#define EMU_MEMFEATURE_RAM0DIV_DIV1                         (_EMU_MEMFEATURE_RAM0DIV_DIV1 << 8)    /**< Shifted mode DIV1 for EMU_MEMFEATURE */
#define EMU_MEMFEATURE_RAM0DIV_DIV2                         (_EMU_MEMFEATURE_RAM0DIV_DIV2 << 8)    /**< Shifted mode DIV2 for EMU_MEMFEATURE */
#define EMU_MEMFEATURE_RAM0DIV_DIV4                         (_EMU_MEMFEATURE_RAM0DIV_DIV4 << 8)    /**< Shifted mode DIV4 for EMU_MEMFEATURE */
#define EMU_MEMFEATURE_RAM0DIV_DIV8                         (_EMU_MEMFEATURE_RAM0DIV_DIV8 << 8)    /**< Shifted mode DIV8 for EMU_MEMFEATURE */

/** @} End of group EFM32HGFULL_EMU */

/**************************************************************************//**
 * @defgroup EFM32HGFULL_RMU_BitFields  EFM32HGFULL_RMU Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for RMU CTRL */
#define _RMU_CTRL_RESETVALUE                                               0x00000000UL                        /**< Default value for RMU_CTRL */
#define _RMU_CTRL_MASK                                                     0x00000001UL                        /**< Mask for RMU_CTRL */
#define RMU_CTRL_LOCKUPRDIS                                                (0x1UL << 0)                        /**< Lockup Reset Disable */
#define _RMU_CTRL_LOCKUPRDIS_SHIFT                                         0                                   /**< Shift value for RMU_LOCKUPRDIS */
#define _RMU_CTRL_LOCKUPRDIS_MASK                                          0x1UL                               /**< Bit mask for RMU_LOCKUPRDIS */
#define _RMU_CTRL_LOCKUPRDIS_DEFAULT                                       0x00000000UL                        /**< Mode DEFAULT for RMU_CTRL */
#define RMU_CTRL_LOCKUPRDIS_DEFAULT                                        (_RMU_CTRL_LOCKUPRDIS_DEFAULT << 0) /**< Shifted mode DEFAULT for RMU_CTRL */

/* Bit fields for RMU RSTCAUSE */
#define _RMU_RSTCAUSE_RESETVALUE                                           0x00000000UL                             /**< Default value for RMU_RSTCAUSE */
#define _RMU_RSTCAUSE_MASK                                                 0x000007FFUL                             /**< Mask for RMU_RSTCAUSE */
#define RMU_RSTCAUSE_PORST                                                 (0x1UL << 0)                             /**< Power On Reset */
#define _RMU_RSTCAUSE_PORST_SHIFT                                          0                                        /**< Shift value for RMU_PORST */
#define _RMU_RSTCAUSE_PORST_MASK                                           0x1UL                                    /**< Bit mask for RMU_PORST */
#define _RMU_RSTCAUSE_PORST_DEFAULT                                        0x00000000UL                             /**< Mode DEFAULT for RMU_RSTCAUSE */
#define RMU_RSTCAUSE_PORST_DEFAULT                                         (_RMU_RSTCAUSE_PORST_DEFAULT << 0)       /**< Shifted mode DEFAULT for RMU_RSTCAUSE */
#define RMU_RSTCAUSE_BODUNREGRST                                           (0x1UL << 1)                             /**< Brown Out Detector Unregulated Domain Reset */
#define _RMU_RSTCAUSE_BODUNREGRST_SHIFT                                    1                                        /**< Shift value for RMU_BODUNREGRST */
#define _RMU_RSTCAUSE_BODUNREGRST_MASK                                     0x2UL                                    /**< Bit mask for RMU_BODUNREGRST */
#define _RMU_RSTCAUSE_BODUNREGRST_DEFAULT                                  0x00000000UL                             /**< Mode DEFAULT for RMU_RSTCAUSE */
#define RMU_RSTCAUSE_BODUNREGRST_DEFAULT                                   (_RMU_RSTCAUSE_BODUNREGRST_DEFAULT << 1) /**< Shifted mode DEFAULT for RMU_RSTCAUSE */
#define RMU_RSTCAUSE_BODREGRST                                             (0x1UL << 2)                             /**< Brown Out Detector Regulated Domain Reset */
#define _RMU_RSTCAUSE_BODREGRST_SHIFT                                      2                                        /**< Shift value for RMU_BODREGRST */
#define _RMU_RSTCAUSE_BODREGRST_MASK                                       0x4UL                                    /**< Bit mask for RMU_BODREGRST */
#define _RMU_RSTCAUSE_BODREGRST_DEFAULT                                    0x00000000UL                             /**< Mode DEFAULT for RMU_RSTCAUSE */
#define RMU_RSTCAUSE_BODREGRST_DEFAULT                                     (_RMU_RSTCAUSE_BODREGRST_DEFAULT << 2)   /**< Shifted mode DEFAULT for RMU_RSTCAUSE */
#define RMU_RSTCAUSE_EXTRST                                                (0x1UL << 3)                             /**< External Pin Reset */
#define _RMU_RSTCAUSE_EXTRST_SHIFT                                         3                                        /**< Shift value for RMU_EXTRST */
#define _RMU_RSTCAUSE_EXTRST_MASK                                          0x8UL                                    /**< Bit mask for RMU_EXTRST */
#define _RMU_RSTCAUSE_EXTRST_DEFAULT                                       0x00000000UL                             /**< Mode DEFAULT for RMU_RSTCAUSE */
#define RMU_RSTCAUSE_EXTRST_DEFAULT                                        (_RMU_RSTCAUSE_EXTRST_DEFAULT << 3)      /**< Shifted mode DEFAULT for RMU_RSTCAUSE */
#define RMU_RSTCAUSE_WDOGRST                                               (0x1UL << 4)                             /**< Watchdog Reset */
#define _RMU_RSTCAUSE_WDOGRST_SHIFT                                        4                                        /**< Shift value for RMU_WDOGRST */
#define _RMU_RSTCAUSE_WDOGRST_MASK                                         0x10UL                                   /**< Bit mask for RMU_WDOGRST */
#define _RMU_RSTCAUSE_WDOGRST_DEFAULT                                      0x00000000UL                             /**< Mode DEFAULT for RMU_RSTCAUSE */
#define RMU_RSTCAUSE_WDOGRST_DEFAULT                                       (_RMU_RSTCAUSE_WDOGRST_DEFAULT << 4)     /**< Shifted mode DEFAULT for RMU_RSTCAUSE */
#define RMU_RSTCAUSE_LOCKUPRST                                             (0x1UL << 5)                             /**< LOCKUP Reset */
#define _RMU_RSTCAUSE_LOCKUPRST_SHIFT                                      5                                        /**< Shift value for RMU_LOCKUPRST */
#define _RMU_RSTCAUSE_LOCKUPRST_MASK                                       0x20UL                                   /**< Bit mask for RMU_LOCKUPRST */
#define _RMU_RSTCAUSE_LOCKUPRST_DEFAULT                                    0x00000000UL                             /**< Mode DEFAULT for RMU_RSTCAUSE */
#define RMU_RSTCAUSE_LOCKUPRST_DEFAULT                                     (_RMU_RSTCAUSE_LOCKUPRST_DEFAULT << 5)   /**< Shifted mode DEFAULT for RMU_RSTCAUSE */
#define RMU_RSTCAUSE_SYSREQRST                                             (0x1UL << 6)                             /**< System Request Reset */
#define _RMU_RSTCAUSE_SYSREQRST_SHIFT                                      6                                        /**< Shift value for RMU_SYSREQRST */
#define _RMU_RSTCAUSE_SYSREQRST_MASK                                       0x40UL                                   /**< Bit mask for RMU_SYSREQRST */
#define _RMU_RSTCAUSE_SYSREQRST_DEFAULT                                    0x00000000UL                             /**< Mode DEFAULT for RMU_RSTCAUSE */
#define RMU_RSTCAUSE_SYSREQRST_DEFAULT                                     (_RMU_RSTCAUSE_SYSREQRST_DEFAULT << 6)   /**< Shifted mode DEFAULT for RMU_RSTCAUSE */
#define RMU_RSTCAUSE_EM4RST                                                (0x1UL << 7)                             /**< EM4 Reset */
#define _RMU_RSTCAUSE_EM4RST_SHIFT                                         7                                        /**< Shift value for RMU_EM4RST */
#define _RMU_RSTCAUSE_EM4RST_MASK                                          0x80UL                                   /**< Bit mask for RMU_EM4RST */
#define _RMU_RSTCAUSE_EM4RST_DEFAULT                                       0x00000000UL                             /**< Mode DEFAULT for RMU_RSTCAUSE */
#define RMU_RSTCAUSE_EM4RST_DEFAULT                                        (_RMU_RSTCAUSE_EM4RST_DEFAULT << 7)      /**< Shifted mode DEFAULT for RMU_RSTCAUSE */
#define RMU_RSTCAUSE_EM4WURST                                              (0x1UL << 8)                             /**< EM4 Wake-up Reset */
#define _RMU_RSTCAUSE_EM4WURST_SHIFT                                       8                                        /**< Shift value for RMU_EM4WURST */
#define _RMU_RSTCAUSE_EM4WURST_MASK                                        0x100UL                                  /**< Bit mask for RMU_EM4WURST */
#define _RMU_RSTCAUSE_EM4WURST_DEFAULT                                     0x00000000UL                             /**< Mode DEFAULT for RMU_RSTCAUSE */
#define RMU_RSTCAUSE_EM4WURST_DEFAULT                                      (_RMU_RSTCAUSE_EM4WURST_DEFAULT << 8)    /**< Shifted mode DEFAULT for RMU_RSTCAUSE */
#define RMU_RSTCAUSE_BODAVDD0                                              (0x1UL << 9)                             /**< AVDD0 Bod Reset */
#define _RMU_RSTCAUSE_BODAVDD0_SHIFT                                       9                                        /**< Shift value for RMU_BODAVDD0 */
#define _RMU_RSTCAUSE_BODAVDD0_MASK                                        0x200UL                                  /**< Bit mask for RMU_BODAVDD0 */
#define _RMU_RSTCAUSE_BODAVDD0_DEFAULT                                     0x00000000UL                             /**< Mode DEFAULT for RMU_RSTCAUSE */
#define RMU_RSTCAUSE_BODAVDD0_DEFAULT                                      (_RMU_RSTCAUSE_BODAVDD0_DEFAULT << 9)    /**< Shifted mode DEFAULT for RMU_RSTCAUSE */
#define RMU_RSTCAUSE_BODAVDD1                                              (0x1UL << 10)                            /**< AVDD1 Bod Reset */
#define _RMU_RSTCAUSE_BODAVDD1_SHIFT                                       10                                       /**< Shift value for RMU_BODAVDD1 */
#define _RMU_RSTCAUSE_BODAVDD1_MASK                                        0x400UL                                  /**< Bit mask for RMU_BODAVDD1 */
#define _RMU_RSTCAUSE_BODAVDD1_DEFAULT                                     0x00000000UL                             /**< Mode DEFAULT for RMU_RSTCAUSE */
#define RMU_RSTCAUSE_BODAVDD1_DEFAULT                                      (_RMU_RSTCAUSE_BODAVDD1_DEFAULT << 10)   /**< Shifted mode DEFAULT for RMU_RSTCAUSE */

/* Bit fields for RMU CMD */
#define _RMU_CMD_RESETVALUE                                                0x00000000UL                  /**< Default value for RMU_CMD */
#define _RMU_CMD_MASK                                                      0x00000001UL                  /**< Mask for RMU_CMD */
#define RMU_CMD_RCCLR                                                      (0x1UL << 0)                  /**< Reset Cause Clear */
#define _RMU_CMD_RCCLR_SHIFT                                               0                             /**< Shift value for RMU_RCCLR */
#define _RMU_CMD_RCCLR_MASK                                                0x1UL                         /**< Bit mask for RMU_RCCLR */
#define _RMU_CMD_RCCLR_DEFAULT                                             0x00000000UL                  /**< Mode DEFAULT for RMU_CMD */
#define RMU_CMD_RCCLR_DEFAULT                                              (_RMU_CMD_RCCLR_DEFAULT << 0) /**< Shifted mode DEFAULT for RMU_CMD */

/* Bit fields for RMU PORBODCONFIG */
#define _RMU_PORBODCONFIG_RESETVALUE                                       0x13001153UL                                                            /**< Default value for RMU_PORBODCONFIG */
#define _RMU_PORBODCONFIG_MASK                                             0x5F337777UL                                                            /**< Mask for RMU_PORBODCONFIG */
#define _RMU_PORBODCONFIG_PORBOD_BOD_THRESHOLD_SHIFT                       0                                                                       /**< Shift value for RMU_PORBOD_BOD_THRESHOLD */
#define _RMU_PORBODCONFIG_PORBOD_BOD_THRESHOLD_MASK                        0x7UL                                                                   /**< Bit mask for RMU_PORBOD_BOD_THRESHOLD */
#define _RMU_PORBODCONFIG_PORBOD_BOD_THRESHOLD_DEFAULT                     0x00000003UL                                                            /**< Mode DEFAULT for RMU_PORBODCONFIG */
#define RMU_PORBODCONFIG_PORBOD_BOD_THRESHOLD_DEFAULT                      (_RMU_PORBODCONFIG_PORBOD_BOD_THRESHOLD_DEFAULT << 0)                   /**< Shifted mode DEFAULT for RMU_PORBODCONFIG */
#define _RMU_PORBODCONFIG_PORBOD_DREG_THRESHOLD_SHIFT                      4                                                                       /**< Shift value for RMU_PORBOD_DREG_THRESHOLD */
#define _RMU_PORBODCONFIG_PORBOD_DREG_THRESHOLD_MASK                       0x70UL                                                                  /**< Bit mask for RMU_PORBOD_DREG_THRESHOLD */
#define _RMU_PORBODCONFIG_PORBOD_DREG_THRESHOLD_DEFAULT                    0x00000005UL                                                            /**< Mode DEFAULT for RMU_PORBODCONFIG */
#define RMU_PORBODCONFIG_PORBOD_DREG_THRESHOLD_DEFAULT                     (_RMU_PORBODCONFIG_PORBOD_DREG_THRESHOLD_DEFAULT << 4)                  /**< Shifted mode DEFAULT for RMU_PORBODCONFIG */
#define _RMU_PORBODCONFIG_PORBOD_BOD_FLANKDET_CURR_SHIFT                   8                                                                       /**< Shift value for RMU_PORBOD_BOD_FLANKDET_CURR */
#define _RMU_PORBODCONFIG_PORBOD_BOD_FLANKDET_CURR_MASK                    0x700UL                                                                 /**< Bit mask for RMU_PORBOD_BOD_FLANKDET_CURR */
#define _RMU_PORBODCONFIG_PORBOD_BOD_FLANKDET_CURR_DEFAULT                 0x00000001UL                                                            /**< Mode DEFAULT for RMU_PORBODCONFIG */
#define RMU_PORBODCONFIG_PORBOD_BOD_FLANKDET_CURR_DEFAULT                  (_RMU_PORBODCONFIG_PORBOD_BOD_FLANKDET_CURR_DEFAULT << 8)               /**< Shifted mode DEFAULT for RMU_PORBODCONFIG */
#define _RMU_PORBODCONFIG_PORBOD_BOD_FLANKDET_DREG_CURR_SHIFT              12                                                                      /**< Shift value for RMU_PORBOD_BOD_FLANKDET_DREG_CURR */
#define _RMU_PORBODCONFIG_PORBOD_BOD_FLANKDET_DREG_CURR_MASK               0x7000UL                                                                /**< Bit mask for RMU_PORBOD_BOD_FLANKDET_DREG_CURR */
#define _RMU_PORBODCONFIG_PORBOD_BOD_FLANKDET_DREG_CURR_DEFAULT            0x00000001UL                                                            /**< Mode DEFAULT for RMU_PORBODCONFIG */
#define RMU_PORBODCONFIG_PORBOD_BOD_FLANKDET_DREG_CURR_DEFAULT             (_RMU_PORBODCONFIG_PORBOD_BOD_FLANKDET_DREG_CURR_DEFAULT << 12)         /**< Shifted mode DEFAULT for RMU_PORBODCONFIG */
#define _RMU_PORBODCONFIG_PORBOD_BOD_FLANKDET_THR_SHIFT                    16                                                                      /**< Shift value for RMU_PORBOD_BOD_FLANKDET_THR */
#define _RMU_PORBODCONFIG_PORBOD_BOD_FLANKDET_THR_MASK                     0x30000UL                                                               /**< Bit mask for RMU_PORBOD_BOD_FLANKDET_THR */
#define _RMU_PORBODCONFIG_PORBOD_BOD_FLANKDET_THR_DEFAULT                  0x00000000UL                                                            /**< Mode DEFAULT for RMU_PORBODCONFIG */
#define RMU_PORBODCONFIG_PORBOD_BOD_FLANKDET_THR_DEFAULT                   (_RMU_PORBODCONFIG_PORBOD_BOD_FLANKDET_THR_DEFAULT << 16)               /**< Shifted mode DEFAULT for RMU_PORBODCONFIG */
#define _RMU_PORBODCONFIG_PORBOD_BOD_FLANKDET_DREG_THR_SHIFT               20                                                                      /**< Shift value for RMU_PORBOD_BOD_FLANKDET_DREG_THR */
#define _RMU_PORBODCONFIG_PORBOD_BOD_FLANKDET_DREG_THR_MASK                0x300000UL                                                              /**< Bit mask for RMU_PORBOD_BOD_FLANKDET_DREG_THR */
#define _RMU_PORBODCONFIG_PORBOD_BOD_FLANKDET_DREG_THR_DEFAULT             0x00000000UL                                                            /**< Mode DEFAULT for RMU_PORBODCONFIG */
#define RMU_PORBODCONFIG_PORBOD_BOD_FLANKDET_DREG_THR_DEFAULT              (_RMU_PORBODCONFIG_PORBOD_BOD_FLANKDET_DREG_THR_DEFAULT << 20)          /**< Shifted mode DEFAULT for RMU_PORBODCONFIG */
#define RMU_PORBODCONFIG_PORBOD_BOD_FLANKDET_RC                            (0x1UL << 24)                                                           /**< Brownout Unreg Flankdetector Time */
#define _RMU_PORBODCONFIG_PORBOD_BOD_FLANKDET_RC_SHIFT                     24                                                                      /**< Shift value for RMU_PORBOD_BOD_FLANKDET_RC */
#define _RMU_PORBODCONFIG_PORBOD_BOD_FLANKDET_RC_MASK                      0x1000000UL                                                             /**< Bit mask for RMU_PORBOD_BOD_FLANKDET_RC */
#define _RMU_PORBODCONFIG_PORBOD_BOD_FLANKDET_RC_DEFAULT                   0x00000001UL                                                            /**< Mode DEFAULT for RMU_PORBODCONFIG */
#define RMU_PORBODCONFIG_PORBOD_BOD_FLANKDET_RC_DEFAULT                    (_RMU_PORBODCONFIG_PORBOD_BOD_FLANKDET_RC_DEFAULT << 24)                /**< Shifted mode DEFAULT for RMU_PORBODCONFIG */
#define RMU_PORBODCONFIG_PORBOD_BOD_FLANKDET_DREG_RC                       (0x1UL << 25)                                                           /**< Brownout Reg Flankdetector Time */
#define _RMU_PORBODCONFIG_PORBOD_BOD_FLANKDET_DREG_RC_SHIFT                25                                                                      /**< Shift value for RMU_PORBOD_BOD_FLANKDET_DREG_RC */
#define _RMU_PORBODCONFIG_PORBOD_BOD_FLANKDET_DREG_RC_MASK                 0x2000000UL                                                             /**< Bit mask for RMU_PORBOD_BOD_FLANKDET_DREG_RC */
#define _RMU_PORBODCONFIG_PORBOD_BOD_FLANKDET_DREG_RC_DEFAULT              0x00000001UL                                                            /**< Mode DEFAULT for RMU_PORBODCONFIG */
#define RMU_PORBODCONFIG_PORBOD_BOD_FLANKDET_DREG_RC_DEFAULT               (_RMU_PORBODCONFIG_PORBOD_BOD_FLANKDET_DREG_RC_DEFAULT << 25)           /**< Shifted mode DEFAULT for RMU_PORBODCONFIG */
#define RMU_PORBODCONFIG_PORBOD_THRESHOLD_PROGRAMMING                      (0x1UL << 26)                                                           /**< Threshold Programming */
#define _RMU_PORBODCONFIG_PORBOD_THRESHOLD_PROGRAMMING_SHIFT               26                                                                      /**< Shift value for RMU_PORBOD_THRESHOLD_PROGRAMMING */
#define _RMU_PORBODCONFIG_PORBOD_THRESHOLD_PROGRAMMING_MASK                0x4000000UL                                                             /**< Bit mask for RMU_PORBOD_THRESHOLD_PROGRAMMING */
#define _RMU_PORBODCONFIG_PORBOD_THRESHOLD_PROGRAMMING_DEFAULT             0x00000000UL                                                            /**< Mode DEFAULT for RMU_PORBODCONFIG */
#define RMU_PORBODCONFIG_PORBOD_THRESHOLD_PROGRAMMING_DEFAULT              (_RMU_PORBODCONFIG_PORBOD_THRESHOLD_PROGRAMMING_DEFAULT << 26)          /**< Shifted mode DEFAULT for RMU_PORBODCONFIG */
#define _RMU_PORBODCONFIG_PORBOD_AND_DREG_MAIN_REFERENCE_ADJUST_SHIFT      27                                                                      /**< Shift value for RMU_PORBOD_AND_DREG_MAIN_REFERENCE_ADJUST */
#define _RMU_PORBODCONFIG_PORBOD_AND_DREG_MAIN_REFERENCE_ADJUST_MASK       0x18000000UL                                                            /**< Bit mask for RMU_PORBOD_AND_DREG_MAIN_REFERENCE_ADJUST */
#define _RMU_PORBODCONFIG_PORBOD_AND_DREG_MAIN_REFERENCE_ADJUST_DEFAULT    0x00000002UL                                                            /**< Mode DEFAULT for RMU_PORBODCONFIG */
#define RMU_PORBODCONFIG_PORBOD_AND_DREG_MAIN_REFERENCE_ADJUST_DEFAULT     (_RMU_PORBODCONFIG_PORBOD_AND_DREG_MAIN_REFERENCE_ADJUST_DEFAULT << 27) /**< Shifted mode DEFAULT for RMU_PORBODCONFIG */
#define RMU_PORBODCONFIG_PORBOD_FORCE_BOD_REF_ALWAYS_ON                    (0x1UL << 30)                                                           /**< Force Brownout Reference On */
#define _RMU_PORBODCONFIG_PORBOD_FORCE_BOD_REF_ALWAYS_ON_SHIFT             30                                                                      /**< Shift value for RMU_PORBOD_FORCE_BOD_REF_ALWAYS_ON */
#define _RMU_PORBODCONFIG_PORBOD_FORCE_BOD_REF_ALWAYS_ON_MASK              0x40000000UL                                                            /**< Bit mask for RMU_PORBOD_FORCE_BOD_REF_ALWAYS_ON */
#define _RMU_PORBODCONFIG_PORBOD_FORCE_BOD_REF_ALWAYS_ON_DEFAULT           0x00000000UL                                                            /**< Mode DEFAULT for RMU_PORBODCONFIG */
#define RMU_PORBODCONFIG_PORBOD_FORCE_BOD_REF_ALWAYS_ON_DEFAULT            (_RMU_PORBODCONFIG_PORBOD_FORCE_BOD_REF_ALWAYS_ON_DEFAULT << 30)        /**< Shifted mode DEFAULT for RMU_PORBODCONFIG */

/** @} End of group EFM32HGFULL_RMU */

