stevew817/DAPLink/source/common/cmsis-core/siliconlabs/efm32hg/efm32hgfull.h
/* Bit fields for CMU LCDCTRL */
#define _CMU_LCDCTRL_RESETVALUE                        0x00000020UL                         /**< Default value for CMU_LCDCTRL */
#define _CMU_LCDCTRL_MASK                              0x0000007FUL                         /**< Mask for CMU_LCDCTRL */
#define _CMU_LCDCTRL_FDIV_SHIFT                        0                                    /**< Shift value for CMU_FDIV */
#define _CMU_LCDCTRL_FDIV_MASK                         0x7UL                                /**< Bit mask for CMU_FDIV */
#define _CMU_LCDCTRL_FDIV_DEFAULT                      0x00000000UL                         /**< Mode DEFAULT for CMU_LCDCTRL */
#define CMU_LCDCTRL_FDIV_DEFAULT                       (_CMU_LCDCTRL_FDIV_DEFAULT << 0)     /**< Shifted mode DEFAULT for CMU_LCDCTRL */
#define CMU_LCDCTRL_VBOOSTEN                           (0x1UL << 3)                         /**< Voltage Boost Enable */
#define _CMU_LCDCTRL_VBOOSTEN_SHIFT                    3                                    /**< Shift value for CMU_VBOOSTEN */
#define _CMU_LCDCTRL_VBOOSTEN_MASK                     0x8UL                                /**< Bit mask for CMU_VBOOSTEN */
#define _CMU_LCDCTRL_VBOOSTEN_DEFAULT                  0x00000000UL                         /**< Mode DEFAULT for CMU_LCDCTRL */
#define CMU_LCDCTRL_VBOOSTEN_DEFAULT                   (_CMU_LCDCTRL_VBOOSTEN_DEFAULT << 3) /**< Shifted mode DEFAULT for CMU_LCDCTRL */
#define _CMU_LCDCTRL_VBFDIV_SHIFT                      4                                    /**< Shift value for CMU_VBFDIV */
#define _CMU_LCDCTRL_VBFDIV_MASK                       0x70UL                               /**< Bit mask for CMU_VBFDIV */
#define _CMU_LCDCTRL_VBFDIV_DIV1                       0x00000000UL                         /**< Mode DIV1 for CMU_LCDCTRL */
#define _CMU_LCDCTRL_VBFDIV_DIV2                       0x00000001UL                         /**< Mode DIV2 for CMU_LCDCTRL */
#define _CMU_LCDCTRL_VBFDIV_DEFAULT                    0x00000002UL                         /**< Mode DEFAULT for CMU_LCDCTRL */
#define _CMU_LCDCTRL_VBFDIV_DIV4                       0x00000002UL                         /**< Mode DIV4 for CMU_LCDCTRL */
#define _CMU_LCDCTRL_VBFDIV_DIV8                       0x00000003UL                         /**< Mode DIV8 for CMU_LCDCTRL */
#define _CMU_LCDCTRL_VBFDIV_DIV16                      0x00000004UL                         /**< Mode DIV16 for CMU_LCDCTRL */
#define _CMU_LCDCTRL_VBFDIV_DIV32                      0x00000005UL                         /**< Mode DIV32 for CMU_LCDCTRL */
#define _CMU_LCDCTRL_VBFDIV_DIV64                      0x00000006UL                         /**< Mode DIV64 for CMU_LCDCTRL */
#define _CMU_LCDCTRL_VBFDIV_DIV128                     0x00000007UL                         /**< Mode DIV128 for CMU_LCDCTRL */
#define CMU_LCDCTRL_VBFDIV_DIV1                        (_CMU_LCDCTRL_VBFDIV_DIV1 << 4)      /**< Shifted mode DIV1 for CMU_LCDCTRL */
#define CMU_LCDCTRL_VBFDIV_DIV2                        (_CMU_LCDCTRL_VBFDIV_DIV2 << 4)      /**< Shifted mode DIV2 for CMU_LCDCTRL */
#define CMU_LCDCTRL_VBFDIV_DEFAULT                     (_CMU_LCDCTRL_VBFDIV_DEFAULT << 4)   /**< Shifted mode DEFAULT for CMU_LCDCTRL */
#define CMU_LCDCTRL_VBFDIV_DIV4                        (_CMU_LCDCTRL_VBFDIV_DIV4 << 4)      /**< Shifted mode DIV4 for CMU_LCDCTRL */
#define CMU_LCDCTRL_VBFDIV_DIV8                        (_CMU_LCDCTRL_VBFDIV_DIV8 << 4)      /**< Shifted mode DIV8 for CMU_LCDCTRL */
#define CMU_LCDCTRL_VBFDIV_DIV16                       (_CMU_LCDCTRL_VBFDIV_DIV16 << 4)     /**< Shifted mode DIV16 for CMU_LCDCTRL */
#define CMU_LCDCTRL_VBFDIV_DIV32                       (_CMU_LCDCTRL_VBFDIV_DIV32 << 4)     /**< Shifted mode DIV32 for CMU_LCDCTRL */
#define CMU_LCDCTRL_VBFDIV_DIV64                       (_CMU_LCDCTRL_VBFDIV_DIV64 << 4)     /**< Shifted mode DIV64 for CMU_LCDCTRL */
#define CMU_LCDCTRL_VBFDIV_DIV128                      (_CMU_LCDCTRL_VBFDIV_DIV128 << 4)    /**< Shifted mode DIV128 for CMU_LCDCTRL */

/* Bit fields for CMU ROUTE */
#define _CMU_ROUTE_RESETVALUE                          0x00000000UL                         /**< Default value for CMU_ROUTE */
#define _CMU_ROUTE_MASK                                0x0000001FUL                         /**< Mask for CMU_ROUTE */
#define CMU_ROUTE_CLKOUT0PEN                           (0x1UL << 0)                         /**< CLKOUT0 Pin Enable */
#define _CMU_ROUTE_CLKOUT0PEN_SHIFT                    0                                    /**< Shift value for CMU_CLKOUT0PEN */
#define _CMU_ROUTE_CLKOUT0PEN_MASK                     0x1UL                                /**< Bit mask for CMU_CLKOUT0PEN */
#define _CMU_ROUTE_CLKOUT0PEN_DEFAULT                  0x00000000UL                         /**< Mode DEFAULT for CMU_ROUTE */
#define CMU_ROUTE_CLKOUT0PEN_DEFAULT                   (_CMU_ROUTE_CLKOUT0PEN_DEFAULT << 0) /**< Shifted mode DEFAULT for CMU_ROUTE */
#define CMU_ROUTE_CLKOUT1PEN                           (0x1UL << 1)                         /**< CLKOUT1 Pin Enable */
#define _CMU_ROUTE_CLKOUT1PEN_SHIFT                    1                                    /**< Shift value for CMU_CLKOUT1PEN */
#define _CMU_ROUTE_CLKOUT1PEN_MASK                     0x2UL                                /**< Bit mask for CMU_CLKOUT1PEN */
#define _CMU_ROUTE_CLKOUT1PEN_DEFAULT                  0x00000000UL                         /**< Mode DEFAULT for CMU_ROUTE */
#define CMU_ROUTE_CLKOUT1PEN_DEFAULT                   (_CMU_ROUTE_CLKOUT1PEN_DEFAULT << 1) /**< Shifted mode DEFAULT for CMU_ROUTE */
#define _CMU_ROUTE_LOCATION_SHIFT                      2                                    /**< Shift value for CMU_LOCATION */
#define _CMU_ROUTE_LOCATION_MASK                       0x1CUL                               /**< Bit mask for CMU_LOCATION */
#define _CMU_ROUTE_LOCATION_LOC0                       0x00000000UL                         /**< Mode LOC0 for CMU_ROUTE */
#define _CMU_ROUTE_LOCATION_DEFAULT                    0x00000000UL                         /**< Mode DEFAULT for CMU_ROUTE */
#define _CMU_ROUTE_LOCATION_LOC1                       0x00000001UL                         /**< Mode LOC1 for CMU_ROUTE */
#define _CMU_ROUTE_LOCATION_LOC2                       0x00000002UL                         /**< Mode LOC2 for CMU_ROUTE */
#define _CMU_ROUTE_LOCATION_LOC3                       0x00000003UL                         /**< Mode LOC3 for CMU_ROUTE */
#define CMU_ROUTE_LOCATION_LOC0                        (_CMU_ROUTE_LOCATION_LOC0 << 2)      /**< Shifted mode LOC0 for CMU_ROUTE */
#define CMU_ROUTE_LOCATION_DEFAULT                     (_CMU_ROUTE_LOCATION_DEFAULT << 2)   /**< Shifted mode DEFAULT for CMU_ROUTE */
#define CMU_ROUTE_LOCATION_LOC1                        (_CMU_ROUTE_LOCATION_LOC1 << 2)      /**< Shifted mode LOC1 for CMU_ROUTE */
#define CMU_ROUTE_LOCATION_LOC2                        (_CMU_ROUTE_LOCATION_LOC2 << 2)      /**< Shifted mode LOC2 for CMU_ROUTE */
#define CMU_ROUTE_LOCATION_LOC3                        (_CMU_ROUTE_LOCATION_LOC3 << 2)      /**< Shifted mode LOC3 for CMU_ROUTE */

/* Bit fields for CMU LOCK */
#define _CMU_LOCK_RESETVALUE                           0x00000000UL                      /**< Default value for CMU_LOCK */
#define _CMU_LOCK_MASK                                 0x0000FFFFUL                      /**< Mask for CMU_LOCK */
#define _CMU_LOCK_LOCKKEY_SHIFT                        0                                 /**< Shift value for CMU_LOCKKEY */
#define _CMU_LOCK_LOCKKEY_MASK                         0xFFFFUL                          /**< Bit mask for CMU_LOCKKEY */
#define _CMU_LOCK_LOCKKEY_DEFAULT                      0x00000000UL                      /**< Mode DEFAULT for CMU_LOCK */
#define _CMU_LOCK_LOCKKEY_LOCK                         0x00000000UL                      /**< Mode LOCK for CMU_LOCK */
#define _CMU_LOCK_LOCKKEY_UNLOCKED                     0x00000000UL                      /**< Mode UNLOCKED for CMU_LOCK */
#define _CMU_LOCK_LOCKKEY_LOCKED                       0x00000001UL                      /**< Mode LOCKED for CMU_LOCK */
#define _CMU_LOCK_LOCKKEY_UNLOCK                       0x0000580EUL                      /**< Mode UNLOCK for CMU_LOCK */
#define CMU_LOCK_LOCKKEY_DEFAULT                       (_CMU_LOCK_LOCKKEY_DEFAULT << 0)  /**< Shifted mode DEFAULT for CMU_LOCK */
#define CMU_LOCK_LOCKKEY_LOCK                          (_CMU_LOCK_LOCKKEY_LOCK << 0)     /**< Shifted mode LOCK for CMU_LOCK */
#define CMU_LOCK_LOCKKEY_UNLOCKED                      (_CMU_LOCK_LOCKKEY_UNLOCKED << 0) /**< Shifted mode UNLOCKED for CMU_LOCK */
#define CMU_LOCK_LOCKKEY_LOCKED                        (_CMU_LOCK_LOCKKEY_LOCKED << 0)   /**< Shifted mode LOCKED for CMU_LOCK */
#define CMU_LOCK_LOCKKEY_UNLOCK                        (_CMU_LOCK_LOCKKEY_UNLOCK << 0)   /**< Shifted mode UNLOCK for CMU_LOCK */

/* Bit fields for CMU HFCORECLKENMASK0 */
#define _CMU_HFCORECLKENMASK0_RESETVALUE               0x00000FFFUL                              /**< Default value for CMU_HFCORECLKENMASK0 */
#define _CMU_HFCORECLKENMASK0_MASK                     0x0000001BUL                              /**< Mask for CMU_HFCORECLKENMASK0 */
#define CMU_HFCORECLKENMASK0_AES                       (0x1UL << 0)                              /**< Advanced Encryption Standard Accelerator Lock */
#define _CMU_HFCORECLKENMASK0_AES_SHIFT                0                                         /**< Shift value for CMU_AES */
#define _CMU_HFCORECLKENMASK0_AES_MASK                 0x1UL                                     /**< Bit mask for CMU_AES */
#define _CMU_HFCORECLKENMASK0_AES_DEFAULT              0x00000001UL                              /**< Mode DEFAULT for CMU_HFCORECLKENMASK0 */
#define CMU_HFCORECLKENMASK0_AES_DEFAULT               (_CMU_HFCORECLKENMASK0_AES_DEFAULT << 0)  /**< Shifted mode DEFAULT for CMU_HFCORECLKENMASK0 */
#define CMU_HFCORECLKENMASK0_DMA                       (0x1UL << 1)                              /**< Direct Memory Access Controller Lock */
#define _CMU_HFCORECLKENMASK0_DMA_SHIFT                1                                         /**< Shift value for CMU_DMA */
#define _CMU_HFCORECLKENMASK0_DMA_MASK                 0x2UL                                     /**< Bit mask for CMU_DMA */
#define _CMU_HFCORECLKENMASK0_DMA_DEFAULT              0x00000001UL                              /**< Mode DEFAULT for CMU_HFCORECLKENMASK0 */
#define CMU_HFCORECLKENMASK0_DMA_DEFAULT               (_CMU_HFCORECLKENMASK0_DMA_DEFAULT << 1)  /**< Shifted mode DEFAULT for CMU_HFCORECLKENMASK0 */
#define CMU_HFCORECLKENMASK0_USBC                      (0x1UL << 3)                              /**< Universal Serial Bus Interface Core Lock */
#define _CMU_HFCORECLKENMASK0_USBC_SHIFT               3                                         /**< Shift value for CMU_USBC */
#define _CMU_HFCORECLKENMASK0_USBC_MASK                0x8UL                                     /**< Bit mask for CMU_USBC */
#define _CMU_HFCORECLKENMASK0_USBC_DEFAULT             0x00000001UL                              /**< Mode DEFAULT for CMU_HFCORECLKENMASK0 */
#define CMU_HFCORECLKENMASK0_USBC_DEFAULT              (_CMU_HFCORECLKENMASK0_USBC_DEFAULT << 3) /**< Shifted mode DEFAULT for CMU_HFCORECLKENMASK0 */
#define CMU_HFCORECLKENMASK0_USB                       (0x1UL << 4)                              /**< Universal Serial Bus Interface Lock */
#define _CMU_HFCORECLKENMASK0_USB_SHIFT                4                                         /**< Shift value for CMU_USB */
#define _CMU_HFCORECLKENMASK0_USB_MASK                 0x10UL                                    /**< Bit mask for CMU_USB */
#define _CMU_HFCORECLKENMASK0_USB_DEFAULT              0x00000001UL                              /**< Mode DEFAULT for CMU_HFCORECLKENMASK0 */
#define CMU_HFCORECLKENMASK0_USB_DEFAULT               (_CMU_HFCORECLKENMASK0_USB_DEFAULT << 4)  /**< Shifted mode DEFAULT for CMU_HFCORECLKENMASK0 */

/* Bit fields for CMU HFPERCLKENMASK0 */
#define _CMU_HFPERCLKENMASK0_RESETVALUE                0x00007FFFUL                               /**< Default value for CMU_HFPERCLKENMASK0 */
#define _CMU_HFPERCLKENMASK0_MASK                      0x00000EBEUL                               /**< Mask for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_TIMER1                     (0x1UL << 1)                               /**< Timer 1 Lock */
#define _CMU_HFPERCLKENMASK0_TIMER1_SHIFT              1                                          /**< Shift value for CMU_TIMER1 */
#define _CMU_HFPERCLKENMASK0_TIMER1_MASK               0x2UL                                      /**< Bit mask for CMU_TIMER1 */
#define _CMU_HFPERCLKENMASK0_TIMER1_DEFAULT            0x00000001UL                               /**< Mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_TIMER1_DEFAULT             (_CMU_HFPERCLKENMASK0_TIMER1_DEFAULT << 1) /**< Shifted mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_TIMER2                     (0x1UL << 2)                               /**< Timer 2 Lock */
#define _CMU_HFPERCLKENMASK0_TIMER2_SHIFT              2                                          /**< Shift value for CMU_TIMER2 */
#define _CMU_HFPERCLKENMASK0_TIMER2_MASK               0x4UL                                      /**< Bit mask for CMU_TIMER2 */
#define _CMU_HFPERCLKENMASK0_TIMER2_DEFAULT            0x00000001UL                               /**< Mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_TIMER2_DEFAULT             (_CMU_HFPERCLKENMASK0_TIMER2_DEFAULT << 2) /**< Shifted mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_USART0                     (0x1UL << 3)                               /**< Universal Synchronous/Asynchronous Receiver/Transmitter 0 Lock */
#define _CMU_HFPERCLKENMASK0_USART0_SHIFT              3                                          /**< Shift value for CMU_USART0 */
#define _CMU_HFPERCLKENMASK0_USART0_MASK               0x8UL                                      /**< Bit mask for CMU_USART0 */
#define _CMU_HFPERCLKENMASK0_USART0_DEFAULT            0x00000001UL                               /**< Mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_USART0_DEFAULT             (_CMU_HFPERCLKENMASK0_USART0_DEFAULT << 3) /**< Shifted mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_USART1                     (0x1UL << 4)                               /**< Universal Synchronous/Asynchronous Receiver/Transmitter 1 Lock */
#define _CMU_HFPERCLKENMASK0_USART1_SHIFT              4                                          /**< Shift value for CMU_USART1 */
#define _CMU_HFPERCLKENMASK0_USART1_MASK               0x10UL                                     /**< Bit mask for CMU_USART1 */
#define _CMU_HFPERCLKENMASK0_USART1_DEFAULT            0x00000001UL                               /**< Mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_USART1_DEFAULT             (_CMU_HFPERCLKENMASK0_USART1_DEFAULT << 4) /**< Shifted mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_ACMP0                      (0x1UL << 5)                               /**< Analog Comparator 0 Lock */
#define _CMU_HFPERCLKENMASK0_ACMP0_SHIFT               5                                          /**< Shift value for CMU_ACMP0 */
#define _CMU_HFPERCLKENMASK0_ACMP0_MASK                0x20UL                                     /**< Bit mask for CMU_ACMP0 */
#define _CMU_HFPERCLKENMASK0_ACMP0_DEFAULT             0x00000001UL                               /**< Mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_ACMP0_DEFAULT              (_CMU_HFPERCLKENMASK0_ACMP0_DEFAULT << 5)  /**< Shifted mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_IDAC0                      (0x1UL << 7)                               /**< Current Digital to Analog Converter 0 Lock */
#define _CMU_HFPERCLKENMASK0_IDAC0_SHIFT               7                                          /**< Shift value for CMU_IDAC0 */
#define _CMU_HFPERCLKENMASK0_IDAC0_MASK                0x80UL                                     /**< Bit mask for CMU_IDAC0 */
#define _CMU_HFPERCLKENMASK0_IDAC0_DEFAULT             0x00000001UL                               /**< Mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_IDAC0_DEFAULT              (_CMU_HFPERCLKENMASK0_IDAC0_DEFAULT << 7)  /**< Shifted mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_VCMP                       (0x1UL << 9)                               /**< Voltage Comparator Lock */
#define _CMU_HFPERCLKENMASK0_VCMP_SHIFT                9                                          /**< Shift value for CMU_VCMP */
#define _CMU_HFPERCLKENMASK0_VCMP_MASK                 0x200UL                                    /**< Bit mask for CMU_VCMP */
#define _CMU_HFPERCLKENMASK0_VCMP_DEFAULT              0x00000001UL                               /**< Mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_VCMP_DEFAULT               (_CMU_HFPERCLKENMASK0_VCMP_DEFAULT << 9)   /**< Shifted mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_ADC0                       (0x1UL << 10)                              /**< Analog to Digital Converter 0 Lock */
#define _CMU_HFPERCLKENMASK0_ADC0_SHIFT                10                                         /**< Shift value for CMU_ADC0 */
#define _CMU_HFPERCLKENMASK0_ADC0_MASK                 0x400UL                                    /**< Bit mask for CMU_ADC0 */
#define _CMU_HFPERCLKENMASK0_ADC0_DEFAULT              0x00000001UL                               /**< Mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_ADC0_DEFAULT               (_CMU_HFPERCLKENMASK0_ADC0_DEFAULT << 10)  /**< Shifted mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_I2C0                       (0x1UL << 11)                              /**< I2C 0 Lock */
#define _CMU_HFPERCLKENMASK0_I2C0_SHIFT                11                                         /**< Shift value for CMU_I2C0 */
#define _CMU_HFPERCLKENMASK0_I2C0_MASK                 0x800UL                                    /**< Bit mask for CMU_I2C0 */
#define _CMU_HFPERCLKENMASK0_I2C0_DEFAULT              0x00000001UL                               /**< Mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_I2C0_DEFAULT               (_CMU_HFPERCLKENMASK0_I2C0_DEFAULT << 11)  /**< Shifted mode DEFAULT for CMU_HFPERCLKENMASK0 */

/* Bit fields for CMU LFACLKENMASK0 */
#define _CMU_LFACLKENMASK0_RESETVALUE                  0x00000001UL /**< Default value for CMU_LFACLKENMASK0 */
#define _CMU_LFACLKENMASK0_MASK                        0x00000000UL /**< Mask for CMU_LFACLKENMASK0 */

/* Bit fields for CMU LFBCLKENMASK0 */
#define _CMU_LFBCLKENMASK0_RESETVALUE                  0x00000001UL                              /**< Default value for CMU_LFBCLKENMASK0 */
#define _CMU_LFBCLKENMASK0_MASK                        0x00000001UL                              /**< Mask for CMU_LFBCLKENMASK0 */
#define CMU_LFBCLKENMASK0_LEUART0                      (0x1UL << 0)                              /**< Low Energy UART 0 Lock */
#define _CMU_LFBCLKENMASK0_LEUART0_SHIFT               0                                         /**< Shift value for CMU_LEUART0 */
#define _CMU_LFBCLKENMASK0_LEUART0_MASK                0x1UL                                     /**< Bit mask for CMU_LEUART0 */
#define _CMU_LFBCLKENMASK0_LEUART0_DEFAULT             0x00000001UL                              /**< Mode DEFAULT for CMU_LFBCLKENMASK0 */
#define CMU_LFBCLKENMASK0_LEUART0_DEFAULT              (_CMU_LFBCLKENMASK0_LEUART0_DEFAULT << 0) /**< Shifted mode DEFAULT for CMU_LFBCLKENMASK0 */

/* Bit fields for CMU LFCCLKENMASK0 */
#define _CMU_LFCCLKENMASK0_RESETVALUE                  0x00000001UL /**< Default value for CMU_LFCCLKENMASK0 */
#define _CMU_LFCCLKENMASK0_MASK                        0x00000000UL /**< Mask for CMU_LFCCLKENMASK0 */

/* Bit fields for CMU PCNTCLKENMASK */
#define _CMU_PCNTCLKENMASK_RESETVALUE                  0x00000001UL                            /**< Default value for CMU_PCNTCLKENMASK */
#define _CMU_PCNTCLKENMASK_MASK                        0x00000001UL                            /**< Mask for CMU_PCNTCLKENMASK */
#define CMU_PCNTCLKENMASK_PCNT0                        (0x1UL << 0)                            /**< Pulse Counter 0 Lock */
#define _CMU_PCNTCLKENMASK_PCNT0_SHIFT                 0                                       /**< Shift value for CMU_PCNT0 */
#define _CMU_PCNTCLKENMASK_PCNT0_MASK                  0x1UL                                   /**< Bit mask for CMU_PCNT0 */
#define _CMU_PCNTCLKENMASK_PCNT0_DEFAULT               0x00000001UL                            /**< Mode DEFAULT for CMU_PCNTCLKENMASK */
#define CMU_PCNTCLKENMASK_PCNT0_DEFAULT                (_CMU_PCNTCLKENMASK_PCNT0_DEFAULT << 0) /**< Shifted mode DEFAULT for CMU_PCNTCLKENMASK */

