stevew817/DAPLink/source/common/cmsis-core/siliconlabs/efm32hg/efm32hgfull.h
/* Bit fields for CMU TEST */
#define _CMU_TEST_RESETVALUE                           0x00000524UL                                /**< Default value for CMU_TEST */
#define _CMU_TEST_MASK                                 0x001F3FFFUL                                /**< Mask for CMU_TEST */
#define _CMU_TEST_HFRCOPROCCOMP_SHIFT                  0                                           /**< Shift value for CMU_HFRCOPROCCOMP */
#define _CMU_TEST_HFRCOPROCCOMP_MASK                   0x7UL                                       /**< Bit mask for CMU_HFRCOPROCCOMP */
#define _CMU_TEST_HFRCOPROCCOMP_DEFAULT                0x00000004UL                                /**< Mode DEFAULT for CMU_TEST */
#define CMU_TEST_HFRCOPROCCOMP_DEFAULT                 (_CMU_TEST_HFRCOPROCCOMP_DEFAULT << 0)      /**< Shifted mode DEFAULT for CMU_TEST */
#define _CMU_TEST_HFRCOSUPPLYCOMP_SHIFT                3                                           /**< Shift value for CMU_HFRCOSUPPLYCOMP */
#define _CMU_TEST_HFRCOSUPPLYCOMP_MASK                 0x38UL                                      /**< Bit mask for CMU_HFRCOSUPPLYCOMP */
#define _CMU_TEST_HFRCOSUPPLYCOMP_DEFAULT              0x00000004UL                                /**< Mode DEFAULT for CMU_TEST */
#define CMU_TEST_HFRCOSUPPLYCOMP_DEFAULT               (_CMU_TEST_HFRCOSUPPLYCOMP_DEFAULT << 3)    /**< Shifted mode DEFAULT for CMU_TEST */
#define _CMU_TEST_HFRCOTEMPCOMP_SHIFT                  6                                           /**< Shift value for CMU_HFRCOTEMPCOMP */
#define _CMU_TEST_HFRCOTEMPCOMP_MASK                   0x1C0UL                                     /**< Bit mask for CMU_HFRCOTEMPCOMP */
#define _CMU_TEST_HFRCOTEMPCOMP_DEFAULT                0x00000004UL                                /**< Mode DEFAULT for CMU_TEST */
#define CMU_TEST_HFRCOTEMPCOMP_DEFAULT                 (_CMU_TEST_HFRCOTEMPCOMP_DEFAULT << 6)      /**< Shifted mode DEFAULT for CMU_TEST */
#define _CMU_TEST_LFRCOPROCCOMP_SHIFT                  9                                           /**< Shift value for CMU_LFRCOPROCCOMP */
#define _CMU_TEST_LFRCOPROCCOMP_MASK                   0xE00UL                                     /**< Bit mask for CMU_LFRCOPROCCOMP */
#define _CMU_TEST_LFRCOPROCCOMP_DEFAULT                0x00000002UL                                /**< Mode DEFAULT for CMU_TEST */
#define CMU_TEST_LFRCOPROCCOMP_DEFAULT                 (_CMU_TEST_LFRCOPROCCOMP_DEFAULT << 9)      /**< Shifted mode DEFAULT for CMU_TEST */
#define CMU_TEST_LFRCOVREF100NAEN                      (0x1UL << 12)                               /**< Enable use of 100 nA instead 10 nA */
#define _CMU_TEST_LFRCOVREF100NAEN_SHIFT               12                                          /**< Shift value for CMU_LFRCOVREF100NAEN */
#define _CMU_TEST_LFRCOVREF100NAEN_MASK                0x1000UL                                    /**< Bit mask for CMU_LFRCOVREF100NAEN */
#define _CMU_TEST_LFRCOVREF100NAEN_DEFAULT             0x00000000UL                                /**< Mode DEFAULT for CMU_TEST */
#define CMU_TEST_LFRCOVREF100NAEN_DEFAULT              (_CMU_TEST_LFRCOVREF100NAEN_DEFAULT << 12)  /**< Shifted mode DEFAULT for CMU_TEST */
#define CMU_TEST_LFRCOLARGERCCAPEN                     (0x1UL << 13)                               /**< For 32 KHz program to 0, for 1 KHz program to 1 */
#define _CMU_TEST_LFRCOLARGERCCAPEN_SHIFT              13                                          /**< Shift value for CMU_LFRCOLARGERCCAPEN */
#define _CMU_TEST_LFRCOLARGERCCAPEN_MASK               0x2000UL                                    /**< Bit mask for CMU_LFRCOLARGERCCAPEN */
#define _CMU_TEST_LFRCOLARGERCCAPEN_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for CMU_TEST */
#define CMU_TEST_LFRCOLARGERCCAPEN_DEFAULT             (_CMU_TEST_LFRCOLARGERCCAPEN_DEFAULT << 13) /**< Shifted mode DEFAULT for CMU_TEST */
#define CMU_TEST_LEWSYNCPRS                            (0x1UL << 16)                               /**< Enable PRS inputs to LE Write Synchronization circuit. R1 and R2 input is taken from two PRS channels defined in LEWSYNC-parameters LEWSYNC_PRS_R1_INPUT and LEWSYNC_PRS_R2_INPUT */
#define _CMU_TEST_LEWSYNCPRS_SHIFT                     16                                          /**< Shift value for CMU_LEWSYNCPRS */
#define _CMU_TEST_LEWSYNCPRS_MASK                      0x10000UL                                   /**< Bit mask for CMU_LEWSYNCPRS */
#define _CMU_TEST_LEWSYNCPRS_DEFAULT                   0x00000000UL                                /**< Mode DEFAULT for CMU_TEST */
#define CMU_TEST_LEWSYNCPRS_DEFAULT                    (_CMU_TEST_LEWSYNCPRS_DEFAULT << 16)        /**< Shifted mode DEFAULT for CMU_TEST */
#define CMU_TEST_LEWSYNCBLOCK                          (0x1UL << 17)                               /**< Block all LE Write Synchronization Mutex cells */
#define _CMU_TEST_LEWSYNCBLOCK_SHIFT                   17                                          /**< Shift value for CMU_LEWSYNCBLOCK */
#define _CMU_TEST_LEWSYNCBLOCK_MASK                    0x20000UL                                   /**< Bit mask for CMU_LEWSYNCBLOCK */
#define _CMU_TEST_LEWSYNCBLOCK_DEFAULT                 0x00000000UL                                /**< Mode DEFAULT for CMU_TEST */
#define CMU_TEST_LEWSYNCBLOCK_DEFAULT                  (_CMU_TEST_LEWSYNCBLOCK_DEFAULT << 17)      /**< Shifted mode DEFAULT for CMU_TEST */
#define CMU_TEST_LEWSYNCDELAY                          (0x1UL << 18)                               /**< Insert extra delays in all LEWSYNC delay chains */
#define _CMU_TEST_LEWSYNCDELAY_SHIFT                   18                                          /**< Shift value for CMU_LEWSYNCDELAY */
#define _CMU_TEST_LEWSYNCDELAY_MASK                    0x40000UL                                   /**< Bit mask for CMU_LEWSYNCDELAY */
#define _CMU_TEST_LEWSYNCDELAY_DEFAULT                 0x00000000UL                                /**< Mode DEFAULT for CMU_TEST */
#define CMU_TEST_LEWSYNCDELAY_DEFAULT                  (_CMU_TEST_LEWSYNCDELAY_DEFAULT << 18)      /**< Shifted mode DEFAULT for CMU_TEST */
#define CMU_TEST_LEWSYNCOBS                            (0x1UL << 19)                               /**< Enable observation of LEWSYNC related PRS outputs (MUTG1,MIXCLK) */
#define _CMU_TEST_LEWSYNCOBS_SHIFT                     19                                          /**< Shift value for CMU_LEWSYNCOBS */
#define _CMU_TEST_LEWSYNCOBS_MASK                      0x80000UL                                   /**< Bit mask for CMU_LEWSYNCOBS */
#define _CMU_TEST_LEWSYNCOBS_DEFAULT                   0x00000000UL                                /**< Mode DEFAULT for CMU_TEST */
#define CMU_TEST_LEWSYNCOBS_DEFAULT                    (_CMU_TEST_LEWSYNCOBS_DEFAULT << 19)        /**< Shifted mode DEFAULT for CMU_TEST */
#define CMU_TEST_LEWSYNCOBSINV                         (0x1UL << 20)                               /**< Enable inverted observation of LEWSYNC related PRS outputs (MUTG1,RTCCLKAPBLE) */
#define _CMU_TEST_LEWSYNCOBSINV_SHIFT                  20                                          /**< Shift value for CMU_LEWSYNCOBSINV */
#define _CMU_TEST_LEWSYNCOBSINV_MASK                   0x100000UL                                  /**< Bit mask for CMU_LEWSYNCOBSINV */
#define _CMU_TEST_LEWSYNCOBSINV_DEFAULT                0x00000000UL                                /**< Mode DEFAULT for CMU_TEST */
#define CMU_TEST_LEWSYNCOBSINV_DEFAULT                 (_CMU_TEST_LEWSYNCOBSINV_DEFAULT << 20)     /**< Shifted mode DEFAULT for CMU_TEST */

/* Bit fields for CMU RST */
#define _CMU_RST_RESETVALUE                            0x00000000UL                  /**< Default value for CMU_RST */
#define _CMU_RST_MASK                                  0x00000001UL                  /**< Mask for CMU_RST */
#define CMU_RST_LFRST                                  (0x1UL << 0)                  /**< Low Frequency Reset */
#define _CMU_RST_LFRST_SHIFT                           0                             /**< Shift value for CMU_LFRST */
#define _CMU_RST_LFRST_MASK                            0x1UL                         /**< Bit mask for CMU_LFRST */
#define _CMU_RST_LFRST_DEFAULT                         0x00000000UL                  /**< Mode DEFAULT for CMU_RST */
#define CMU_RST_LFRST_DEFAULT                          (_CMU_RST_LFRST_DEFAULT << 0) /**< Shifted mode DEFAULT for CMU_RST */

/* Bit fields for CMU LPOSCCTRL */
#define _CMU_LPOSCCTRL_RESETVALUE                      0x00000012UL                               /**< Default value for CMU_LPOSCCTRL */
#define _CMU_LPOSCCTRL_MASK                            0x00000153UL                               /**< Mask for CMU_LPOSCCTRL */
#define _CMU_LPOSCCTRL_LFXOAMP_SHIFT                   0                                          /**< Shift value for CMU_LFXOAMP */
#define _CMU_LPOSCCTRL_LFXOAMP_MASK                    0x3UL                                      /**< Bit mask for CMU_LFXOAMP */
#define _CMU_LPOSCCTRL_LFXOAMP_DEFAULT                 0x00000002UL                               /**< Mode DEFAULT for CMU_LPOSCCTRL */
#define CMU_LPOSCCTRL_LFXOAMP_DEFAULT                  (_CMU_LPOSCCTRL_LFXOAMP_DEFAULT << 0)      /**< Shifted mode DEFAULT for CMU_LPOSCCTRL */
#define CMU_LPOSCCTRL_LFXOCURR                         (0x1UL << 4)                               /**< LFXO Current */
#define _CMU_LPOSCCTRL_LFXOCURR_SHIFT                  4                                          /**< Shift value for CMU_LFXOCURR */
#define _CMU_LPOSCCTRL_LFXOCURR_MASK                   0x10UL                                     /**< Bit mask for CMU_LFXOCURR */
#define _CMU_LPOSCCTRL_LFXOCURR_DEFAULT                0x00000001UL                               /**< Mode DEFAULT for CMU_LPOSCCTRL */
#define CMU_LPOSCCTRL_LFXOCURR_DEFAULT                 (_CMU_LPOSCCTRL_LFXOCURR_DEFAULT << 4)     /**< Shifted mode DEFAULT for CMU_LPOSCCTRL */
#define CMU_LPOSCCTRL_LFXOCORECURR                     (0x1UL << 6)                               /**< LFXO Core Current */
#define _CMU_LPOSCCTRL_LFXOCORECURR_SHIFT              6                                          /**< Shift value for CMU_LFXOCORECURR */
#define _CMU_LPOSCCTRL_LFXOCORECURR_MASK               0x40UL                                     /**< Bit mask for CMU_LFXOCORECURR */
#define _CMU_LPOSCCTRL_LFXOCORECURR_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for CMU_LPOSCCTRL */
#define CMU_LPOSCCTRL_LFXOCORECURR_DEFAULT             (_CMU_LPOSCCTRL_LFXOCORECURR_DEFAULT << 6) /**< Shifted mode DEFAULT for CMU_LPOSCCTRL */
#define CMU_LPOSCCTRL_LFXORES                          (0x1UL << 8)                               /**< LFXO Res */
#define _CMU_LPOSCCTRL_LFXORES_SHIFT                   8                                          /**< Shift value for CMU_LFXORES */
#define _CMU_LPOSCCTRL_LFXORES_MASK                    0x100UL                                    /**< Bit mask for CMU_LFXORES */
#define _CMU_LPOSCCTRL_LFXORES_DEFAULT                 0x00000000UL                               /**< Mode DEFAULT for CMU_LPOSCCTRL */
#define CMU_LPOSCCTRL_LFXORES_DEFAULT                  (_CMU_LPOSCCTRL_LFXORES_DEFAULT << 8)      /**< Shifted mode DEFAULT for CMU_LPOSCCTRL */

/* Bit fields for CMU USBCRCTRL */
#define _CMU_USBCRCTRL_RESETVALUE                      0x00000000UL                            /**< Default value for CMU_USBCRCTRL */
#define _CMU_USBCRCTRL_MASK                            0x0001000FUL                            /**< Mask for CMU_USBCRCTRL */
#define CMU_USBCRCTRL_EN                               (0x1UL << 0)                            /**< Clock Recovery Enable */
#define _CMU_USBCRCTRL_EN_SHIFT                        0                                       /**< Shift value for CMU_EN */
#define _CMU_USBCRCTRL_EN_MASK                         0x1UL                                   /**< Bit mask for CMU_EN */
#define _CMU_USBCRCTRL_EN_DEFAULT                      0x00000000UL                            /**< Mode DEFAULT for CMU_USBCRCTRL */
#define CMU_USBCRCTRL_EN_DEFAULT                       (_CMU_USBCRCTRL_EN_DEFAULT << 0)        /**< Shifted mode DEFAULT for CMU_USBCRCTRL */
#define CMU_USBCRCTRL_LSMODE                           (0x1UL << 1)                            /**< Low Speed Clock Recovery Mode */
#define _CMU_USBCRCTRL_LSMODE_SHIFT                    1                                       /**< Shift value for CMU_LSMODE */
#define _CMU_USBCRCTRL_LSMODE_MASK                     0x2UL                                   /**< Bit mask for CMU_LSMODE */
#define _CMU_USBCRCTRL_LSMODE_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for CMU_USBCRCTRL */
#define CMU_USBCRCTRL_LSMODE_DEFAULT                   (_CMU_USBCRCTRL_LSMODE_DEFAULT << 1)    /**< Shifted mode DEFAULT for CMU_USBCRCTRL */
#define CMU_USBCRCTRL_OLEN                             (0x1UL << 2)                            /**< Oscillator Open-Loop Mode Enable */
#define _CMU_USBCRCTRL_OLEN_SHIFT                      2                                       /**< Shift value for CMU_OLEN */
#define _CMU_USBCRCTRL_OLEN_MASK                       0x4UL                                   /**< Bit mask for CMU_OLEN */
#define _CMU_USBCRCTRL_OLEN_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for CMU_USBCRCTRL */
#define CMU_USBCRCTRL_OLEN_DEFAULT                     (_CMU_USBCRCTRL_OLEN_DEFAULT << 2)      /**< Shifted mode DEFAULT for CMU_USBCRCTRL */
#define CMU_USBCRCTRL_SSEN                             (0x1UL << 3)                            /**< Single Step Enable */
#define _CMU_USBCRCTRL_SSEN_SHIFT                      3                                       /**< Shift value for CMU_SSEN */
#define _CMU_USBCRCTRL_SSEN_MASK                       0x8UL                                   /**< Bit mask for CMU_SSEN */
#define _CMU_USBCRCTRL_SSEN_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for CMU_USBCRCTRL */
#define CMU_USBCRCTRL_SSEN_DEFAULT                     (_CMU_USBCRCTRL_SSEN_DEFAULT << 3)      /**< Shifted mode DEFAULT for CMU_USBCRCTRL */
#define CMU_USBCRCTRL_SDELAYEN                         (0x1UL << 16)                           /**< Slip delay enable */
#define _CMU_USBCRCTRL_SDELAYEN_SHIFT                  16                                      /**< Shift value for CMU_SDELAYEN */
#define _CMU_USBCRCTRL_SDELAYEN_MASK                   0x10000UL                               /**< Bit mask for CMU_SDELAYEN */
#define _CMU_USBCRCTRL_SDELAYEN_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for CMU_USBCRCTRL */
#define CMU_USBCRCTRL_SDELAYEN_DEFAULT                 (_CMU_USBCRCTRL_SDELAYEN_DEFAULT << 16) /**< Shifted mode DEFAULT for CMU_USBCRCTRL */

/* Bit fields for CMU USHFRCOCTRL */
#define _CMU_USHFRCOCTRL_RESETVALUE                    0x000FF040UL                             /**< Default value for CMU_USHFRCOCTRL */
#define _CMU_USHFRCOCTRL_MASK                          0x000FF37FUL                             /**< Mask for CMU_USHFRCOCTRL */
#define _CMU_USHFRCOCTRL_TUNING_SHIFT                  0                                        /**< Shift value for CMU_TUNING */
#define _CMU_USHFRCOCTRL_TUNING_MASK                   0x7FUL                                   /**< Bit mask for CMU_TUNING */
#define _CMU_USHFRCOCTRL_TUNING_DEFAULT                0x00000040UL                             /**< Mode DEFAULT for CMU_USHFRCOCTRL */
#define CMU_USHFRCOCTRL_TUNING_DEFAULT                 (_CMU_USHFRCOCTRL_TUNING_DEFAULT << 0)   /**< Shifted mode DEFAULT for CMU_USHFRCOCTRL */
#define CMU_USHFRCOCTRL_DITHEN                         (0x1UL << 8)                             /**< USHFRCO dither enable */
#define _CMU_USHFRCOCTRL_DITHEN_SHIFT                  8                                        /**< Shift value for CMU_DITHEN */
#define _CMU_USHFRCOCTRL_DITHEN_MASK                   0x100UL                                  /**< Bit mask for CMU_DITHEN */
#define _CMU_USHFRCOCTRL_DITHEN_DEFAULT                0x00000000UL                             /**< Mode DEFAULT for CMU_USHFRCOCTRL */
#define CMU_USHFRCOCTRL_DITHEN_DEFAULT                 (_CMU_USHFRCOCTRL_DITHEN_DEFAULT << 8)   /**< Shifted mode DEFAULT for CMU_USHFRCOCTRL */
#define CMU_USHFRCOCTRL_SUSPEND                        (0x1UL << 9)                             /**< USHFRCO suspend */
#define _CMU_USHFRCOCTRL_SUSPEND_SHIFT                 9                                        /**< Shift value for CMU_SUSPEND */
#define _CMU_USHFRCOCTRL_SUSPEND_MASK                  0x200UL                                  /**< Bit mask for CMU_SUSPEND */
#define _CMU_USHFRCOCTRL_SUSPEND_DEFAULT               0x00000000UL                             /**< Mode DEFAULT for CMU_USHFRCOCTRL */
#define CMU_USHFRCOCTRL_SUSPEND_DEFAULT                (_CMU_USHFRCOCTRL_SUSPEND_DEFAULT << 9)  /**< Shifted mode DEFAULT for CMU_USHFRCOCTRL */
#define _CMU_USHFRCOCTRL_TIMEOUT_SHIFT                 12                                       /**< Shift value for CMU_TIMEOUT */
#define _CMU_USHFRCOCTRL_TIMEOUT_MASK                  0xFF000UL                                /**< Bit mask for CMU_TIMEOUT */
#define _CMU_USHFRCOCTRL_TIMEOUT_DEFAULT               0x000000FFUL                             /**< Mode DEFAULT for CMU_USHFRCOCTRL */
#define CMU_USHFRCOCTRL_TIMEOUT_DEFAULT                (_CMU_USHFRCOCTRL_TIMEOUT_DEFAULT << 12) /**< Shifted mode DEFAULT for CMU_USHFRCOCTRL */

/* Bit fields for CMU USHFRCOTUNE */
#define _CMU_USHFRCOTUNE_RESETVALUE                    0x00000020UL                               /**< Default value for CMU_USHFRCOTUNE */
#define _CMU_USHFRCOTUNE_MASK                          0x0000003FUL                               /**< Mask for CMU_USHFRCOTUNE */
#define _CMU_USHFRCOTUNE_FINETUNING_SHIFT              0                                          /**< Shift value for CMU_FINETUNING */
#define _CMU_USHFRCOTUNE_FINETUNING_MASK               0x3FUL                                     /**< Bit mask for CMU_FINETUNING */
#define _CMU_USHFRCOTUNE_FINETUNING_DEFAULT            0x00000020UL                               /**< Mode DEFAULT for CMU_USHFRCOTUNE */
#define CMU_USHFRCOTUNE_FINETUNING_DEFAULT             (_CMU_USHFRCOTUNE_FINETUNING_DEFAULT << 0) /**< Shifted mode DEFAULT for CMU_USHFRCOTUNE */

/* Bit fields for CMU USHFRCOCONF */
#define _CMU_USHFRCOCONF_RESETVALUE                    0x00000001UL                                   /**< Default value for CMU_USHFRCOCONF */
#define _CMU_USHFRCOCONF_MASK                          0x00000017UL                                   /**< Mask for CMU_USHFRCOCONF */
#define _CMU_USHFRCOCONF_BAND_SHIFT                    0                                              /**< Shift value for CMU_BAND */
#define _CMU_USHFRCOCONF_BAND_MASK                     0x7UL                                          /**< Bit mask for CMU_BAND */
#define _CMU_USHFRCOCONF_BAND_DEFAULT                  0x00000001UL                                   /**< Mode DEFAULT for CMU_USHFRCOCONF */
#define _CMU_USHFRCOCONF_BAND_48MHZ                    0x00000001UL                                   /**< Mode 48MHZ for CMU_USHFRCOCONF */
#define _CMU_USHFRCOCONF_BAND_24MHZ                    0x00000003UL                                   /**< Mode 24MHZ for CMU_USHFRCOCONF */
#define CMU_USHFRCOCONF_BAND_DEFAULT                   (_CMU_USHFRCOCONF_BAND_DEFAULT << 0)           /**< Shifted mode DEFAULT for CMU_USHFRCOCONF */
#define CMU_USHFRCOCONF_BAND_48MHZ                     (_CMU_USHFRCOCONF_BAND_48MHZ << 0)             /**< Shifted mode 48MHZ for CMU_USHFRCOCONF */
#define CMU_USHFRCOCONF_BAND_24MHZ                     (_CMU_USHFRCOCONF_BAND_24MHZ << 0)             /**< Shifted mode 24MHZ for CMU_USHFRCOCONF */
#define CMU_USHFRCOCONF_USHFRCODIV2DIS                 (0x1UL << 4)                                   /**< USHFRCO divider for HFCLK disable */
#define _CMU_USHFRCOCONF_USHFRCODIV2DIS_SHIFT          4                                              /**< Shift value for CMU_USHFRCODIV2DIS */
#define _CMU_USHFRCOCONF_USHFRCODIV2DIS_MASK           0x10UL                                         /**< Bit mask for CMU_USHFRCODIV2DIS */
#define _CMU_USHFRCOCONF_USHFRCODIV2DIS_DEFAULT        0x00000000UL                                   /**< Mode DEFAULT for CMU_USHFRCOCONF */
#define CMU_USHFRCOCONF_USHFRCODIV2DIS_DEFAULT         (_CMU_USHFRCOCONF_USHFRCODIV2DIS_DEFAULT << 4) /**< Shifted mode DEFAULT for CMU_USHFRCOCONF */

/* Bit fields for CMU USHFRCOCAL1 */
#define _CMU_USHFRCOCAL1_RESETVALUE                    0x000003CAUL                              /**< Default value for CMU_USHFRCOCAL1 */
#define _CMU_USHFRCOCAL1_MASK                          0x03FFFFFFUL                              /**< Mask for CMU_USHFRCOCAL1 */
#define CMU_USHFRCOCAL1_LATEN                          (0x1UL << 0)                              /**< Oscillator latch enable. */
#define _CMU_USHFRCOCAL1_LATEN_SHIFT                   0                                         /**< Shift value for CMU_LATEN */
#define _CMU_USHFRCOCAL1_LATEN_MASK                    0x1UL                                     /**< Bit mask for CMU_LATEN */
#define _CMU_USHFRCOCAL1_LATEN_DEFAULT                 0x00000000UL                              /**< Mode DEFAULT for CMU_USHFRCOCAL1 */
#define CMU_USHFRCOCAL1_LATEN_DEFAULT                  (_CMU_USHFRCOCAL1_LATEN_DEFAULT << 0)     /**< Shifted mode DEFAULT for CMU_USHFRCOCAL1 */
#define _CMU_USHFRCOCAL1_OSCIFL_SHIFT                  1                                         /**< Shift value for CMU_OSCIFL */
#define _CMU_USHFRCOCAL1_OSCIFL_MASK                   0x3EUL                                    /**< Bit mask for CMU_OSCIFL */
#define _CMU_USHFRCOCAL1_OSCIFL_DEFAULT                0x00000005UL                              /**< Mode DEFAULT for CMU_USHFRCOCAL1 */
#define CMU_USHFRCOCAL1_OSCIFL_DEFAULT                 (_CMU_USHFRCOCAL1_OSCIFL_DEFAULT << 1)    /**< Shifted mode DEFAULT for CMU_USHFRCOCAL1 */
#define _CMU_USHFRCOCAL1_POWER_SHIFT                   6                                         /**< Shift value for CMU_POWER */
#define _CMU_USHFRCOCAL1_POWER_MASK                    0x3C0UL                                   /**< Bit mask for CMU_POWER */
#define _CMU_USHFRCOCAL1_POWER_DEFAULT                 0x0000000FUL                              /**< Mode DEFAULT for CMU_USHFRCOCAL1 */
#define CMU_USHFRCOCAL1_POWER_DEFAULT                  (_CMU_USHFRCOCAL1_POWER_DEFAULT << 6)     /**< Shifted mode DEFAULT for CMU_USHFRCOCAL1 */
#define _CMU_USHFRCOCAL1_OSCIOFFR_SHIFT                10                                        /**< Shift value for CMU_OSCIOFFR */
#define _CMU_USHFRCOCAL1_OSCIOFFR_MASK                 0x3FC00UL                                 /**< Bit mask for CMU_OSCIOFFR */
#define _CMU_USHFRCOCAL1_OSCIOFFR_DEFAULT              0x00000000UL                              /**< Mode DEFAULT for CMU_USHFRCOCAL1 */
#define CMU_USHFRCOCAL1_OSCIOFFR_DEFAULT               (_CMU_USHFRCOCAL1_OSCIOFFR_DEFAULT << 10) /**< Shifted mode DEFAULT for CMU_USHFRCOCAL1 */
#define _CMU_USHFRCOCAL1_OSCIOFFS_SHIFT                18                                        /**< Shift value for CMU_OSCIOFFS */
#define _CMU_USHFRCOCAL1_OSCIOFFS_MASK                 0x3FC0000UL                               /**< Bit mask for CMU_OSCIOFFS */
#define _CMU_USHFRCOCAL1_OSCIOFFS_DEFAULT              0x00000000UL                              /**< Mode DEFAULT for CMU_USHFRCOCAL1 */
#define CMU_USHFRCOCAL1_OSCIOFFS_DEFAULT               (_CMU_USHFRCOCAL1_OSCIOFFS_DEFAULT << 18) /**< Shifted mode DEFAULT for CMU_USHFRCOCAL1 */

