stevew817/DAPLink/source/common/cmsis-core/siliconlabs/efm32hg/efm32hgfull.h
/* Bit fields for CMU USHFRCOCAL2 */
#define _CMU_USHFRCOCAL2_RESETVALUE                    0x00000025UL                                    /**< Default value for CMU_USHFRCOCAL2 */
#define _CMU_USHFRCOCAL2_MASK                          0x07FFFFFFUL                                    /**< Mask for CMU_USHFRCOCAL2 */
#define _CMU_USHFRCOCAL2_OSCITM_SHIFT                  0                                               /**< Shift value for CMU_OSCITM */
#define _CMU_USHFRCOCAL2_OSCITM_MASK                   0xFFUL                                          /**< Bit mask for CMU_OSCITM */
#define _CMU_USHFRCOCAL2_OSCITM_DEFAULT                0x00000025UL                                    /**< Mode DEFAULT for CMU_USHFRCOCAL2 */
#define CMU_USHFRCOCAL2_OSCITM_DEFAULT                 (_CMU_USHFRCOCAL2_OSCITM_DEFAULT << 0)          /**< Shifted mode DEFAULT for CMU_USHFRCOCAL2 */
#define _CMU_USHFRCOCAL2_VBGFINETRIM_SHIFT             8                                               /**< Shift value for CMU_VBGFINETRIM */
#define _CMU_USHFRCOCAL2_VBGFINETRIM_MASK              0x700UL                                         /**< Bit mask for CMU_VBGFINETRIM */
#define _CMU_USHFRCOCAL2_VBGFINETRIM_DEFAULT           0x00000000UL                                    /**< Mode DEFAULT for CMU_USHFRCOCAL2 */
#define CMU_USHFRCOCAL2_VBGFINETRIM_DEFAULT            (_CMU_USHFRCOCAL2_VBGFINETRIM_DEFAULT << 8)     /**< Shifted mode DEFAULT for CMU_USHFRCOCAL2 */
#define _CMU_USHFRCOCAL2_VBGCOARSETRIM_SHIFT           11                                              /**< Shift value for CMU_VBGCOARSETRIM */
#define _CMU_USHFRCOCAL2_VBGCOARSETRIM_MASK            0xF800UL                                        /**< Bit mask for CMU_VBGCOARSETRIM */
#define _CMU_USHFRCOCAL2_VBGCOARSETRIM_DEFAULT         0x00000000UL                                    /**< Mode DEFAULT for CMU_USHFRCOCAL2 */
#define CMU_USHFRCOCAL2_VBGCOARSETRIM_DEFAULT          (_CMU_USHFRCOCAL2_VBGCOARSETRIM_DEFAULT << 11)  /**< Shifted mode DEFAULT for CMU_USHFRCOCAL2 */
#define _CMU_USHFRCOCAL2_TESTCTRL_SHIFT                16                                              /**< Shift value for CMU_TESTCTRL */
#define _CMU_USHFRCOCAL2_TESTCTRL_MASK                 0xFF0000UL                                      /**< Bit mask for CMU_TESTCTRL */
#define _CMU_USHFRCOCAL2_TESTCTRL_DEFAULT              0x00000000UL                                    /**< Mode DEFAULT for CMU_USHFRCOCAL2 */
#define CMU_USHFRCOCAL2_TESTCTRL_DEFAULT               (_CMU_USHFRCOCAL2_TESTCTRL_DEFAULT << 16)       /**< Shifted mode DEFAULT for CMU_USHFRCOCAL2 */
#define _CMU_USHFRCOCAL2_USHFRCOTESTSEL_SHIFT          24                                              /**< Shift value for CMU_USHFRCOTESTSEL */
#define _CMU_USHFRCOCAL2_USHFRCOTESTSEL_MASK           0x3000000UL                                     /**< Bit mask for CMU_USHFRCOTESTSEL */
#define _CMU_USHFRCOCAL2_USHFRCOTESTSEL_DEFAULT        0x00000000UL                                    /**< Mode DEFAULT for CMU_USHFRCOCAL2 */
#define CMU_USHFRCOCAL2_USHFRCOTESTSEL_DEFAULT         (_CMU_USHFRCOCAL2_USHFRCOTESTSEL_DEFAULT << 24) /**< Shifted mode DEFAULT for CMU_USHFRCOCAL2 */
#define CMU_USHFRCOCAL2_REGBYPASS                      (0x1UL << 26)                                   /**< USHFRCO Regulator Bypass */
#define _CMU_USHFRCOCAL2_REGBYPASS_SHIFT               26                                              /**< Shift value for CMU_REGBYPASS */
#define _CMU_USHFRCOCAL2_REGBYPASS_MASK                0x4000000UL                                     /**< Bit mask for CMU_REGBYPASS */
#define _CMU_USHFRCOCAL2_REGBYPASS_DEFAULT             0x00000000UL                                    /**< Mode DEFAULT for CMU_USHFRCOCAL2 */
#define CMU_USHFRCOCAL2_REGBYPASS_DEFAULT              (_CMU_USHFRCOCAL2_REGBYPASS_DEFAULT << 26)      /**< Shifted mode DEFAULT for CMU_USHFRCOCAL2 */

/* Bit fields for CMU USHFRCOCALLOCK */
#define _CMU_USHFRCOCALLOCK_RESETVALUE                 0x00000000UL                                       /**< Default value for CMU_USHFRCOCALLOCK */
#define _CMU_USHFRCOCALLOCK_MASK                       0x0000FFFFUL                                       /**< Mask for CMU_USHFRCOCALLOCK */
#define _CMU_USHFRCOCALLOCK_USHFRCOLOCKKEY_SHIFT       0                                                  /**< Shift value for CMU_USHFRCOLOCKKEY */
#define _CMU_USHFRCOCALLOCK_USHFRCOLOCKKEY_MASK        0xFFFFUL                                           /**< Bit mask for CMU_USHFRCOLOCKKEY */
#define _CMU_USHFRCOCALLOCK_USHFRCOLOCKKEY_DEFAULT     0x00000000UL                                       /**< Mode DEFAULT for CMU_USHFRCOCALLOCK */
#define _CMU_USHFRCOCALLOCK_USHFRCOLOCKKEY_LOCK        0x00000000UL                                       /**< Mode LOCK for CMU_USHFRCOCALLOCK */
#define _CMU_USHFRCOCALLOCK_USHFRCOLOCKKEY_UNLOCKED    0x00000000UL                                       /**< Mode UNLOCKED for CMU_USHFRCOCALLOCK */
#define _CMU_USHFRCOCALLOCK_USHFRCOLOCKKEY_LOCKED      0x00000001UL                                       /**< Mode LOCKED for CMU_USHFRCOCALLOCK */
#define _CMU_USHFRCOCALLOCK_USHFRCOLOCKKEY_UNLOCK      0x0000A71FUL                                       /**< Mode UNLOCK for CMU_USHFRCOCALLOCK */
#define CMU_USHFRCOCALLOCK_USHFRCOLOCKKEY_DEFAULT      (_CMU_USHFRCOCALLOCK_USHFRCOLOCKKEY_DEFAULT << 0)  /**< Shifted mode DEFAULT for CMU_USHFRCOCALLOCK */
#define CMU_USHFRCOCALLOCK_USHFRCOLOCKKEY_LOCK         (_CMU_USHFRCOCALLOCK_USHFRCOLOCKKEY_LOCK << 0)     /**< Shifted mode LOCK for CMU_USHFRCOCALLOCK */
#define CMU_USHFRCOCALLOCK_USHFRCOLOCKKEY_UNLOCKED     (_CMU_USHFRCOCALLOCK_USHFRCOLOCKKEY_UNLOCKED << 0) /**< Shifted mode UNLOCKED for CMU_USHFRCOCALLOCK */
#define CMU_USHFRCOCALLOCK_USHFRCOLOCKKEY_LOCKED       (_CMU_USHFRCOCALLOCK_USHFRCOLOCKKEY_LOCKED << 0)   /**< Shifted mode LOCKED for CMU_USHFRCOCALLOCK */
#define CMU_USHFRCOCALLOCK_USHFRCOLOCKKEY_UNLOCK       (_CMU_USHFRCOCALLOCK_USHFRCOLOCKKEY_UNLOCK << 0)   /**< Shifted mode UNLOCK for CMU_USHFRCOCALLOCK */

/** @} End of group EFM32HGFULL_CMU */

/**************************************************************************//**
 * @defgroup EFM32HGFULL_PRS_BitFields  EFM32HGFULL_PRS Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for PRS SWPULSE */
#define _PRS_SWPULSE_RESETVALUE                  0x00000000UL                         /**< Default value for PRS_SWPULSE */
#define _PRS_SWPULSE_MASK                        0x0000003FUL                         /**< Mask for PRS_SWPULSE */
#define PRS_SWPULSE_CH0PULSE                     (0x1UL << 0)                         /**< Channel 0 Pulse Generation */
#define _PRS_SWPULSE_CH0PULSE_SHIFT              0                                    /**< Shift value for PRS_CH0PULSE */
#define _PRS_SWPULSE_CH0PULSE_MASK               0x1UL                                /**< Bit mask for PRS_CH0PULSE */
#define _PRS_SWPULSE_CH0PULSE_DEFAULT            0x00000000UL                         /**< Mode DEFAULT for PRS_SWPULSE */
#define PRS_SWPULSE_CH0PULSE_DEFAULT             (_PRS_SWPULSE_CH0PULSE_DEFAULT << 0) /**< Shifted mode DEFAULT for PRS_SWPULSE */
#define PRS_SWPULSE_CH1PULSE                     (0x1UL << 1)                         /**< Channel 1 Pulse Generation */
#define _PRS_SWPULSE_CH1PULSE_SHIFT              1                                    /**< Shift value for PRS_CH1PULSE */
#define _PRS_SWPULSE_CH1PULSE_MASK               0x2UL                                /**< Bit mask for PRS_CH1PULSE */
#define _PRS_SWPULSE_CH1PULSE_DEFAULT            0x00000000UL                         /**< Mode DEFAULT for PRS_SWPULSE */
#define PRS_SWPULSE_CH1PULSE_DEFAULT             (_PRS_SWPULSE_CH1PULSE_DEFAULT << 1) /**< Shifted mode DEFAULT for PRS_SWPULSE */
#define PRS_SWPULSE_CH2PULSE                     (0x1UL << 2)                         /**< Channel 2 Pulse Generation */
#define _PRS_SWPULSE_CH2PULSE_SHIFT              2                                    /**< Shift value for PRS_CH2PULSE */
#define _PRS_SWPULSE_CH2PULSE_MASK               0x4UL                                /**< Bit mask for PRS_CH2PULSE */
#define _PRS_SWPULSE_CH2PULSE_DEFAULT            0x00000000UL                         /**< Mode DEFAULT for PRS_SWPULSE */
#define PRS_SWPULSE_CH2PULSE_DEFAULT             (_PRS_SWPULSE_CH2PULSE_DEFAULT << 2) /**< Shifted mode DEFAULT for PRS_SWPULSE */
#define PRS_SWPULSE_CH3PULSE                     (0x1UL << 3)                         /**< Channel 3 Pulse Generation */
#define _PRS_SWPULSE_CH3PULSE_SHIFT              3                                    /**< Shift value for PRS_CH3PULSE */
#define _PRS_SWPULSE_CH3PULSE_MASK               0x8UL                                /**< Bit mask for PRS_CH3PULSE */
#define _PRS_SWPULSE_CH3PULSE_DEFAULT            0x00000000UL                         /**< Mode DEFAULT for PRS_SWPULSE */
#define PRS_SWPULSE_CH3PULSE_DEFAULT             (_PRS_SWPULSE_CH3PULSE_DEFAULT << 3) /**< Shifted mode DEFAULT for PRS_SWPULSE */
#define PRS_SWPULSE_CH4PULSE                     (0x1UL << 4)                         /**< Channel 4 Pulse Generation */
#define _PRS_SWPULSE_CH4PULSE_SHIFT              4                                    /**< Shift value for PRS_CH4PULSE */
#define _PRS_SWPULSE_CH4PULSE_MASK               0x10UL                               /**< Bit mask for PRS_CH4PULSE */
#define _PRS_SWPULSE_CH4PULSE_DEFAULT            0x00000000UL                         /**< Mode DEFAULT for PRS_SWPULSE */
#define PRS_SWPULSE_CH4PULSE_DEFAULT             (_PRS_SWPULSE_CH4PULSE_DEFAULT << 4) /**< Shifted mode DEFAULT for PRS_SWPULSE */
#define PRS_SWPULSE_CH5PULSE                     (0x1UL << 5)                         /**< Channel 5 Pulse Generation */
#define _PRS_SWPULSE_CH5PULSE_SHIFT              5                                    /**< Shift value for PRS_CH5PULSE */
#define _PRS_SWPULSE_CH5PULSE_MASK               0x20UL                               /**< Bit mask for PRS_CH5PULSE */
#define _PRS_SWPULSE_CH5PULSE_DEFAULT            0x00000000UL                         /**< Mode DEFAULT for PRS_SWPULSE */
#define PRS_SWPULSE_CH5PULSE_DEFAULT             (_PRS_SWPULSE_CH5PULSE_DEFAULT << 5) /**< Shifted mode DEFAULT for PRS_SWPULSE */

/* Bit fields for PRS SWLEVEL */
#define _PRS_SWLEVEL_RESETVALUE                  0x00000000UL                         /**< Default value for PRS_SWLEVEL */
#define _PRS_SWLEVEL_MASK                        0x0000003FUL                         /**< Mask for PRS_SWLEVEL */
#define PRS_SWLEVEL_CH0LEVEL                     (0x1UL << 0)                         /**< Channel 0 Software Level */
#define _PRS_SWLEVEL_CH0LEVEL_SHIFT              0                                    /**< Shift value for PRS_CH0LEVEL */
#define _PRS_SWLEVEL_CH0LEVEL_MASK               0x1UL                                /**< Bit mask for PRS_CH0LEVEL */
#define _PRS_SWLEVEL_CH0LEVEL_DEFAULT            0x00000000UL                         /**< Mode DEFAULT for PRS_SWLEVEL */
#define PRS_SWLEVEL_CH0LEVEL_DEFAULT             (_PRS_SWLEVEL_CH0LEVEL_DEFAULT << 0) /**< Shifted mode DEFAULT for PRS_SWLEVEL */
#define PRS_SWLEVEL_CH1LEVEL                     (0x1UL << 1)                         /**< Channel 1 Software Level */
#define _PRS_SWLEVEL_CH1LEVEL_SHIFT              1                                    /**< Shift value for PRS_CH1LEVEL */
#define _PRS_SWLEVEL_CH1LEVEL_MASK               0x2UL                                /**< Bit mask for PRS_CH1LEVEL */
#define _PRS_SWLEVEL_CH1LEVEL_DEFAULT            0x00000000UL                         /**< Mode DEFAULT for PRS_SWLEVEL */
#define PRS_SWLEVEL_CH1LEVEL_DEFAULT             (_PRS_SWLEVEL_CH1LEVEL_DEFAULT << 1) /**< Shifted mode DEFAULT for PRS_SWLEVEL */
#define PRS_SWLEVEL_CH2LEVEL                     (0x1UL << 2)                         /**< Channel 2 Software Level */
#define _PRS_SWLEVEL_CH2LEVEL_SHIFT              2                                    /**< Shift value for PRS_CH2LEVEL */
#define _PRS_SWLEVEL_CH2LEVEL_MASK               0x4UL                                /**< Bit mask for PRS_CH2LEVEL */
#define _PRS_SWLEVEL_CH2LEVEL_DEFAULT            0x00000000UL                         /**< Mode DEFAULT for PRS_SWLEVEL */
#define PRS_SWLEVEL_CH2LEVEL_DEFAULT             (_PRS_SWLEVEL_CH2LEVEL_DEFAULT << 2) /**< Shifted mode DEFAULT for PRS_SWLEVEL */
#define PRS_SWLEVEL_CH3LEVEL                     (0x1UL << 3)                         /**< Channel 3 Software Level */
#define _PRS_SWLEVEL_CH3LEVEL_SHIFT              3                                    /**< Shift value for PRS_CH3LEVEL */
#define _PRS_SWLEVEL_CH3LEVEL_MASK               0x8UL                                /**< Bit mask for PRS_CH3LEVEL */
#define _PRS_SWLEVEL_CH3LEVEL_DEFAULT            0x00000000UL                         /**< Mode DEFAULT for PRS_SWLEVEL */
#define PRS_SWLEVEL_CH3LEVEL_DEFAULT             (_PRS_SWLEVEL_CH3LEVEL_DEFAULT << 3) /**< Shifted mode DEFAULT for PRS_SWLEVEL */
#define PRS_SWLEVEL_CH4LEVEL                     (0x1UL << 4)                         /**< Channel 4 Software Level */
#define _PRS_SWLEVEL_CH4LEVEL_SHIFT              4                                    /**< Shift value for PRS_CH4LEVEL */
#define _PRS_SWLEVEL_CH4LEVEL_MASK               0x10UL                               /**< Bit mask for PRS_CH4LEVEL */
#define _PRS_SWLEVEL_CH4LEVEL_DEFAULT            0x00000000UL                         /**< Mode DEFAULT for PRS_SWLEVEL */
#define PRS_SWLEVEL_CH4LEVEL_DEFAULT             (_PRS_SWLEVEL_CH4LEVEL_DEFAULT << 4) /**< Shifted mode DEFAULT for PRS_SWLEVEL */
#define PRS_SWLEVEL_CH5LEVEL                     (0x1UL << 5)                         /**< Channel 5 Software Level */
#define _PRS_SWLEVEL_CH5LEVEL_SHIFT              5                                    /**< Shift value for PRS_CH5LEVEL */
#define _PRS_SWLEVEL_CH5LEVEL_MASK               0x20UL                               /**< Bit mask for PRS_CH5LEVEL */
#define _PRS_SWLEVEL_CH5LEVEL_DEFAULT            0x00000000UL                         /**< Mode DEFAULT for PRS_SWLEVEL */
#define PRS_SWLEVEL_CH5LEVEL_DEFAULT             (_PRS_SWLEVEL_CH5LEVEL_DEFAULT << 5) /**< Shifted mode DEFAULT for PRS_SWLEVEL */

