stevew817/DAPLink/source/common/cmsis-core/siliconlabs/efm32hg/efm32hgfull.h
/* Bit fields for PRS ROUTE */
#define _PRS_ROUTE_RESETVALUE                    0x00000000UL                       /**< Default value for PRS_ROUTE */
#define _PRS_ROUTE_MASK                          0x0000070FUL                       /**< Mask for PRS_ROUTE */
#define PRS_ROUTE_CH0PEN                         (0x1UL << 0)                       /**< CH0 Pin Enable */
#define _PRS_ROUTE_CH0PEN_SHIFT                  0                                  /**< Shift value for PRS_CH0PEN */
#define _PRS_ROUTE_CH0PEN_MASK                   0x1UL                              /**< Bit mask for PRS_CH0PEN */
#define _PRS_ROUTE_CH0PEN_DEFAULT                0x00000000UL                       /**< Mode DEFAULT for PRS_ROUTE */
#define PRS_ROUTE_CH0PEN_DEFAULT                 (_PRS_ROUTE_CH0PEN_DEFAULT << 0)   /**< Shifted mode DEFAULT for PRS_ROUTE */
#define PRS_ROUTE_CH1PEN                         (0x1UL << 1)                       /**< CH1 Pin Enable */
#define _PRS_ROUTE_CH1PEN_SHIFT                  1                                  /**< Shift value for PRS_CH1PEN */
#define _PRS_ROUTE_CH1PEN_MASK                   0x2UL                              /**< Bit mask for PRS_CH1PEN */
#define _PRS_ROUTE_CH1PEN_DEFAULT                0x00000000UL                       /**< Mode DEFAULT for PRS_ROUTE */
#define PRS_ROUTE_CH1PEN_DEFAULT                 (_PRS_ROUTE_CH1PEN_DEFAULT << 1)   /**< Shifted mode DEFAULT for PRS_ROUTE */
#define PRS_ROUTE_CH2PEN                         (0x1UL << 2)                       /**< CH2 Pin Enable */
#define _PRS_ROUTE_CH2PEN_SHIFT                  2                                  /**< Shift value for PRS_CH2PEN */
#define _PRS_ROUTE_CH2PEN_MASK                   0x4UL                              /**< Bit mask for PRS_CH2PEN */
#define _PRS_ROUTE_CH2PEN_DEFAULT                0x00000000UL                       /**< Mode DEFAULT for PRS_ROUTE */
#define PRS_ROUTE_CH2PEN_DEFAULT                 (_PRS_ROUTE_CH2PEN_DEFAULT << 2)   /**< Shifted mode DEFAULT for PRS_ROUTE */
#define PRS_ROUTE_CH3PEN                         (0x1UL << 3)                       /**< CH3 Pin Enable */
#define _PRS_ROUTE_CH3PEN_SHIFT                  3                                  /**< Shift value for PRS_CH3PEN */
#define _PRS_ROUTE_CH3PEN_MASK                   0x8UL                              /**< Bit mask for PRS_CH3PEN */
#define _PRS_ROUTE_CH3PEN_DEFAULT                0x00000000UL                       /**< Mode DEFAULT for PRS_ROUTE */
#define PRS_ROUTE_CH3PEN_DEFAULT                 (_PRS_ROUTE_CH3PEN_DEFAULT << 3)   /**< Shifted mode DEFAULT for PRS_ROUTE */
#define _PRS_ROUTE_LOCATION_SHIFT                8                                  /**< Shift value for PRS_LOCATION */
#define _PRS_ROUTE_LOCATION_MASK                 0x700UL                            /**< Bit mask for PRS_LOCATION */
#define _PRS_ROUTE_LOCATION_LOC0                 0x00000000UL                       /**< Mode LOC0 for PRS_ROUTE */
#define _PRS_ROUTE_LOCATION_DEFAULT              0x00000000UL                       /**< Mode DEFAULT for PRS_ROUTE */
#define _PRS_ROUTE_LOCATION_LOC1                 0x00000001UL                       /**< Mode LOC1 for PRS_ROUTE */
#define _PRS_ROUTE_LOCATION_LOC2                 0x00000002UL                       /**< Mode LOC2 for PRS_ROUTE */
#define _PRS_ROUTE_LOCATION_LOC3                 0x00000003UL                       /**< Mode LOC3 for PRS_ROUTE */
#define PRS_ROUTE_LOCATION_LOC0                  (_PRS_ROUTE_LOCATION_LOC0 << 8)    /**< Shifted mode LOC0 for PRS_ROUTE */
#define PRS_ROUTE_LOCATION_DEFAULT               (_PRS_ROUTE_LOCATION_DEFAULT << 8) /**< Shifted mode DEFAULT for PRS_ROUTE */
#define PRS_ROUTE_LOCATION_LOC1                  (_PRS_ROUTE_LOCATION_LOC1 << 8)    /**< Shifted mode LOC1 for PRS_ROUTE */
#define PRS_ROUTE_LOCATION_LOC2                  (_PRS_ROUTE_LOCATION_LOC2 << 8)    /**< Shifted mode LOC2 for PRS_ROUTE */
#define PRS_ROUTE_LOCATION_LOC3                  (_PRS_ROUTE_LOCATION_LOC3 << 8)    /**< Shifted mode LOC3 for PRS_ROUTE */

/* Bit fields for PRS CH_CTRL */
#define _PRS_CH_CTRL_RESETVALUE                  0x00000000UL                                 /**< Default value for PRS_CH_CTRL */
#define _PRS_CH_CTRL_MASK                        0x133F0007UL                                 /**< Mask for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_SHIFT                0                                            /**< Shift value for PRS_SIGSEL */
#define _PRS_CH_CTRL_SIGSEL_MASK                 0x7UL                                        /**< Bit mask for PRS_SIGSEL */
#define _PRS_CH_CTRL_SIGSEL_VCMPOUT              0x00000000UL                                 /**< Mode VCMPOUT for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_ACMP0OUT             0x00000000UL                                 /**< Mode ACMP0OUT for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_ADC0SINGLE           0x00000000UL                                 /**< Mode ADC0SINGLE for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_USART0IRTX           0x00000000UL                                 /**< Mode USART0IRTX for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_USART1IRTX           0x00000000UL                                 /**< Mode USART1IRTX for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_TIMER0UF             0x00000000UL                                 /**< Mode TIMER0UF for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_TIMER1UF             0x00000000UL                                 /**< Mode TIMER1UF for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_TIMER2UF             0x00000000UL                                 /**< Mode TIMER2UF for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_USBSOF               0x00000000UL                                 /**< Mode USBSOF for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_RTCOF                0x00000000UL                                 /**< Mode RTCOF for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_GPIOPIN0             0x00000000UL                                 /**< Mode GPIOPIN0 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_GPIOPIN8             0x00000000UL                                 /**< Mode GPIOPIN8 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_PCNT0TCC             0x00000000UL                                 /**< Mode PCNT0TCC for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_LETESTMUTG1          0x00000000UL                                 /**< Mode LETESTMUTG1 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_MANTESTLFABLOCK      0x00000000UL                                 /**< Mode MANTESTLFABLOCK for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_ADC0SCAN             0x00000001UL                                 /**< Mode ADC0SCAN for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_USART0TXC            0x00000001UL                                 /**< Mode USART0TXC for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_USART1TXC            0x00000001UL                                 /**< Mode USART1TXC for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_TIMER0OF             0x00000001UL                                 /**< Mode TIMER0OF for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_TIMER1OF             0x00000001UL                                 /**< Mode TIMER1OF for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_TIMER2OF             0x00000001UL                                 /**< Mode TIMER2OF for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_USBSOFSR             0x00000001UL                                 /**< Mode USBSOFSR for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_RTCCOMP0             0x00000001UL                                 /**< Mode RTCCOMP0 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_GPIOPIN1             0x00000001UL                                 /**< Mode GPIOPIN1 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_GPIOPIN9             0x00000001UL                                 /**< Mode GPIOPIN9 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_LETESTRTCCLKAPBLE    0x00000001UL                                 /**< Mode LETESTRTCCLKAPBLE for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_MANTESTLFADLY        0x00000001UL                                 /**< Mode MANTESTLFADLY for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_USART0RXDATAV        0x00000002UL                                 /**< Mode USART0RXDATAV for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_USART1RXDATAV        0x00000002UL                                 /**< Mode USART1RXDATAV for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_TIMER0CC0            0x00000002UL                                 /**< Mode TIMER0CC0 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_TIMER1CC0            0x00000002UL                                 /**< Mode TIMER1CC0 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_TIMER2CC0            0x00000002UL                                 /**< Mode TIMER2CC0 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_RTCCOMP1             0x00000002UL                                 /**< Mode RTCCOMP1 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_GPIOPIN2             0x00000002UL                                 /**< Mode GPIOPIN2 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_GPIOPIN10            0x00000002UL                                 /**< Mode GPIOPIN10 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_MANTESTLFAPULSE      0x00000002UL                                 /**< Mode MANTESTLFAPULSE for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_TIMER0CC1            0x00000003UL                                 /**< Mode TIMER0CC1 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_TIMER1CC1            0x00000003UL                                 /**< Mode TIMER1CC1 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_TIMER2CC1            0x00000003UL                                 /**< Mode TIMER2CC1 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_GPIOPIN3             0x00000003UL                                 /**< Mode GPIOPIN3 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_GPIOPIN11            0x00000003UL                                 /**< Mode GPIOPIN11 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_MANTESTGMCCALACT     0x00000003UL                                 /**< Mode MANTESTGMCCALACT for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_TIMER0CC2            0x00000004UL                                 /**< Mode TIMER0CC2 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_TIMER1CC2            0x00000004UL                                 /**< Mode TIMER1CC2 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_TIMER2CC2            0x00000004UL                                 /**< Mode TIMER2CC2 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_GPIOPIN4             0x00000004UL                                 /**< Mode GPIOPIN4 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_GPIOPIN12            0x00000004UL                                 /**< Mode GPIOPIN12 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_GPIOPIN5             0x00000005UL                                 /**< Mode GPIOPIN5 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_GPIOPIN13            0x00000005UL                                 /**< Mode GPIOPIN13 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_GPIOPIN6             0x00000006UL                                 /**< Mode GPIOPIN6 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_GPIOPIN14            0x00000006UL                                 /**< Mode GPIOPIN14 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_GPIOPIN7             0x00000007UL                                 /**< Mode GPIOPIN7 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SIGSEL_GPIOPIN15            0x00000007UL                                 /**< Mode GPIOPIN15 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_VCMPOUT               (_PRS_CH_CTRL_SIGSEL_VCMPOUT << 0)           /**< Shifted mode VCMPOUT for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_ACMP0OUT              (_PRS_CH_CTRL_SIGSEL_ACMP0OUT << 0)          /**< Shifted mode ACMP0OUT for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_ADC0SINGLE            (_PRS_CH_CTRL_SIGSEL_ADC0SINGLE << 0)        /**< Shifted mode ADC0SINGLE for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_USART0IRTX            (_PRS_CH_CTRL_SIGSEL_USART0IRTX << 0)        /**< Shifted mode USART0IRTX for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_USART1IRTX            (_PRS_CH_CTRL_SIGSEL_USART1IRTX << 0)        /**< Shifted mode USART1IRTX for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_TIMER0UF              (_PRS_CH_CTRL_SIGSEL_TIMER0UF << 0)          /**< Shifted mode TIMER0UF for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_TIMER1UF              (_PRS_CH_CTRL_SIGSEL_TIMER1UF << 0)          /**< Shifted mode TIMER1UF for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_TIMER2UF              (_PRS_CH_CTRL_SIGSEL_TIMER2UF << 0)          /**< Shifted mode TIMER2UF for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_USBSOF                (_PRS_CH_CTRL_SIGSEL_USBSOF << 0)            /**< Shifted mode USBSOF for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_RTCOF                 (_PRS_CH_CTRL_SIGSEL_RTCOF << 0)             /**< Shifted mode RTCOF for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN0              (_PRS_CH_CTRL_SIGSEL_GPIOPIN0 << 0)          /**< Shifted mode GPIOPIN0 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN8              (_PRS_CH_CTRL_SIGSEL_GPIOPIN8 << 0)          /**< Shifted mode GPIOPIN8 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_PCNT0TCC              (_PRS_CH_CTRL_SIGSEL_PCNT0TCC << 0)          /**< Shifted mode PCNT0TCC for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_LETESTMUTG1           (_PRS_CH_CTRL_SIGSEL_LETESTMUTG1 << 0)       /**< Shifted mode LETESTMUTG1 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_MANTESTLFABLOCK       (_PRS_CH_CTRL_SIGSEL_MANTESTLFABLOCK << 0)   /**< Shifted mode MANTESTLFABLOCK for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_ADC0SCAN              (_PRS_CH_CTRL_SIGSEL_ADC0SCAN << 0)          /**< Shifted mode ADC0SCAN for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_USART0TXC             (_PRS_CH_CTRL_SIGSEL_USART0TXC << 0)         /**< Shifted mode USART0TXC for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_USART1TXC             (_PRS_CH_CTRL_SIGSEL_USART1TXC << 0)         /**< Shifted mode USART1TXC for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_TIMER0OF              (_PRS_CH_CTRL_SIGSEL_TIMER0OF << 0)          /**< Shifted mode TIMER0OF for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_TIMER1OF              (_PRS_CH_CTRL_SIGSEL_TIMER1OF << 0)          /**< Shifted mode TIMER1OF for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_TIMER2OF              (_PRS_CH_CTRL_SIGSEL_TIMER2OF << 0)          /**< Shifted mode TIMER2OF for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_USBSOFSR              (_PRS_CH_CTRL_SIGSEL_USBSOFSR << 0)          /**< Shifted mode USBSOFSR for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_RTCCOMP0              (_PRS_CH_CTRL_SIGSEL_RTCCOMP0 << 0)          /**< Shifted mode RTCCOMP0 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN1              (_PRS_CH_CTRL_SIGSEL_GPIOPIN1 << 0)          /**< Shifted mode GPIOPIN1 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN9              (_PRS_CH_CTRL_SIGSEL_GPIOPIN9 << 0)          /**< Shifted mode GPIOPIN9 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_LETESTRTCCLKAPBLE     (_PRS_CH_CTRL_SIGSEL_LETESTRTCCLKAPBLE << 0) /**< Shifted mode LETESTRTCCLKAPBLE for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_MANTESTLFADLY         (_PRS_CH_CTRL_SIGSEL_MANTESTLFADLY << 0)     /**< Shifted mode MANTESTLFADLY for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_USART0RXDATAV         (_PRS_CH_CTRL_SIGSEL_USART0RXDATAV << 0)     /**< Shifted mode USART0RXDATAV for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_USART1RXDATAV         (_PRS_CH_CTRL_SIGSEL_USART1RXDATAV << 0)     /**< Shifted mode USART1RXDATAV for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_TIMER0CC0             (_PRS_CH_CTRL_SIGSEL_TIMER0CC0 << 0)         /**< Shifted mode TIMER0CC0 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_TIMER1CC0             (_PRS_CH_CTRL_SIGSEL_TIMER1CC0 << 0)         /**< Shifted mode TIMER1CC0 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_TIMER2CC0             (_PRS_CH_CTRL_SIGSEL_TIMER2CC0 << 0)         /**< Shifted mode TIMER2CC0 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_RTCCOMP1              (_PRS_CH_CTRL_SIGSEL_RTCCOMP1 << 0)          /**< Shifted mode RTCCOMP1 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN2              (_PRS_CH_CTRL_SIGSEL_GPIOPIN2 << 0)          /**< Shifted mode GPIOPIN2 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN10             (_PRS_CH_CTRL_SIGSEL_GPIOPIN10 << 0)         /**< Shifted mode GPIOPIN10 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_MANTESTLFAPULSE       (_PRS_CH_CTRL_SIGSEL_MANTESTLFAPULSE << 0)   /**< Shifted mode MANTESTLFAPULSE for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_TIMER0CC1             (_PRS_CH_CTRL_SIGSEL_TIMER0CC1 << 0)         /**< Shifted mode TIMER0CC1 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_TIMER1CC1             (_PRS_CH_CTRL_SIGSEL_TIMER1CC1 << 0)         /**< Shifted mode TIMER1CC1 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_TIMER2CC1             (_PRS_CH_CTRL_SIGSEL_TIMER2CC1 << 0)         /**< Shifted mode TIMER2CC1 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN3              (_PRS_CH_CTRL_SIGSEL_GPIOPIN3 << 0)          /**< Shifted mode GPIOPIN3 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN11             (_PRS_CH_CTRL_SIGSEL_GPIOPIN11 << 0)         /**< Shifted mode GPIOPIN11 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_MANTESTGMCCALACT      (_PRS_CH_CTRL_SIGSEL_MANTESTGMCCALACT << 0)  /**< Shifted mode MANTESTGMCCALACT for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_TIMER0CC2             (_PRS_CH_CTRL_SIGSEL_TIMER0CC2 << 0)         /**< Shifted mode TIMER0CC2 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_TIMER1CC2             (_PRS_CH_CTRL_SIGSEL_TIMER1CC2 << 0)         /**< Shifted mode TIMER1CC2 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_TIMER2CC2             (_PRS_CH_CTRL_SIGSEL_TIMER2CC2 << 0)         /**< Shifted mode TIMER2CC2 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN4              (_PRS_CH_CTRL_SIGSEL_GPIOPIN4 << 0)          /**< Shifted mode GPIOPIN4 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN12             (_PRS_CH_CTRL_SIGSEL_GPIOPIN12 << 0)         /**< Shifted mode GPIOPIN12 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN5              (_PRS_CH_CTRL_SIGSEL_GPIOPIN5 << 0)          /**< Shifted mode GPIOPIN5 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN13             (_PRS_CH_CTRL_SIGSEL_GPIOPIN13 << 0)         /**< Shifted mode GPIOPIN13 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN6              (_PRS_CH_CTRL_SIGSEL_GPIOPIN6 << 0)          /**< Shifted mode GPIOPIN6 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN14             (_PRS_CH_CTRL_SIGSEL_GPIOPIN14 << 0)         /**< Shifted mode GPIOPIN14 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN7              (_PRS_CH_CTRL_SIGSEL_GPIOPIN7 << 0)          /**< Shifted mode GPIOPIN7 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN15             (_PRS_CH_CTRL_SIGSEL_GPIOPIN15 << 0)         /**< Shifted mode GPIOPIN15 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_SHIFT             16                                           /**< Shift value for PRS_SOURCESEL */
#define _PRS_CH_CTRL_SOURCESEL_MASK              0x3F0000UL                                   /**< Bit mask for PRS_SOURCESEL */
#define _PRS_CH_CTRL_SOURCESEL_NONE              0x00000000UL                                 /**< Mode NONE for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_VCMP              0x00000001UL                                 /**< Mode VCMP for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_ACMP0             0x00000002UL                                 /**< Mode ACMP0 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_ADC0              0x00000008UL                                 /**< Mode ADC0 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_USART0            0x00000010UL                                 /**< Mode USART0 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_USART1            0x00000011UL                                 /**< Mode USART1 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_TIMER0            0x0000001CUL                                 /**< Mode TIMER0 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_TIMER1            0x0000001DUL                                 /**< Mode TIMER1 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_TIMER2            0x0000001EUL                                 /**< Mode TIMER2 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_USB               0x00000024UL                                 /**< Mode USB for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_RTC               0x00000028UL                                 /**< Mode RTC for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_GPIOL             0x00000030UL                                 /**< Mode GPIOL for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_GPIOH             0x00000031UL                                 /**< Mode GPIOH for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_PCNT0             0x00000036UL                                 /**< Mode PCNT0 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_LETEST            0x0000003EUL                                 /**< Mode LETEST for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_MANTEST           0x0000003FUL                                 /**< Mode MANTEST for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_NONE               (_PRS_CH_CTRL_SOURCESEL_NONE << 16)          /**< Shifted mode NONE for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_VCMP               (_PRS_CH_CTRL_SOURCESEL_VCMP << 16)          /**< Shifted mode VCMP for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_ACMP0              (_PRS_CH_CTRL_SOURCESEL_ACMP0 << 16)         /**< Shifted mode ACMP0 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_ADC0               (_PRS_CH_CTRL_SOURCESEL_ADC0 << 16)          /**< Shifted mode ADC0 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_USART0             (_PRS_CH_CTRL_SOURCESEL_USART0 << 16)        /**< Shifted mode USART0 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_USART1             (_PRS_CH_CTRL_SOURCESEL_USART1 << 16)        /**< Shifted mode USART1 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_TIMER0             (_PRS_CH_CTRL_SOURCESEL_TIMER0 << 16)        /**< Shifted mode TIMER0 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_TIMER1             (_PRS_CH_CTRL_SOURCESEL_TIMER1 << 16)        /**< Shifted mode TIMER1 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_TIMER2             (_PRS_CH_CTRL_SOURCESEL_TIMER2 << 16)        /**< Shifted mode TIMER2 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_USB                (_PRS_CH_CTRL_SOURCESEL_USB << 16)           /**< Shifted mode USB for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_RTC                (_PRS_CH_CTRL_SOURCESEL_RTC << 16)           /**< Shifted mode RTC for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_GPIOL              (_PRS_CH_CTRL_SOURCESEL_GPIOL << 16)         /**< Shifted mode GPIOL for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_GPIOH              (_PRS_CH_CTRL_SOURCESEL_GPIOH << 16)         /**< Shifted mode GPIOH for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_PCNT0              (_PRS_CH_CTRL_SOURCESEL_PCNT0 << 16)         /**< Shifted mode PCNT0 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_LETEST             (_PRS_CH_CTRL_SOURCESEL_LETEST << 16)        /**< Shifted mode LETEST for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_MANTEST            (_PRS_CH_CTRL_SOURCESEL_MANTEST << 16)       /**< Shifted mode MANTEST for PRS_CH_CTRL */
#define _PRS_CH_CTRL_EDSEL_SHIFT                 24                                           /**< Shift value for PRS_EDSEL */
#define _PRS_CH_CTRL_EDSEL_MASK                  0x3000000UL                                  /**< Bit mask for PRS_EDSEL */
